[{"name": " Salvia azurea var. grandiflora (Pitcher Sage)", "desc": "Salvia azurea var. grandiflora (Pitcher Sage) is a clump-forming, shrubby perennial with beautiful wands of sky blue flowers, up to 12 in. long (30 cm). Blooming from midsummer to frost, the elegant flowering wands are borne on slender stems clad with long, narrow, grayish-green leaves. Hardy, this Salvia enjoys an upright habit until midsummer, but will sprawl over nearby plants when it begins to bloom.", "url": "/plant/Salvia-azurea-var-grandiflora", "img_src": "/rendition.grid_lg/uploads/plant/1522776276-a015c4ee3fe2112fe/botanikfoto-548152-LOptimized.jpg"}, {"name": "Acer japonicum 'Aconitifolium' (Full Moon Maple)", "desc": "Incredibly popular, award-winning Acer japonicum 'Aconitifolium' (Full Moon Maple) is a large bushy deciduous shrub or small tree with attractive foliage and stunning fall color. Emerging bright green in spring, the palmate, almost fern-like leaves are deeply cut into 7-11 lobes. One of the most desirable features of this cultivar is its intense fall coloration, when the leaves develop brilliant scarlet and carmine tones tinged with purple. Since they persist a long time on the plant, they provide a long-lasting fall display.", "url": "/plant/Acer-japonicum-Aconitifolium", "img_src": "/rendition.grid_lg/uploads/plant/1537797625-3fafd11f841a01af2/botanikfoto-535248-LOptimized.jpg"}, {"name": "Acer palmatum 'Koto-no-ito' (Japanese Maple)", "desc": "Acer palmatum 'Koto-no-ito' is a deciduous shrub or small tree with pretty, trailing leaves comprised of 5-7 narrow, straplike lobes, which emerge with crimson tones before quickly turning bright green. Born on short red stalks, the elegant leaves warm up to vibrant orange-yellow in fall", "url": "/plant/Acer-palmatum-Koto-no-ito-Japanese-Maple", "img_src": "/rendition.grid_lg/uploads/plant/1477165485-5b8e5da3efe2cea21/DP9348%20Acer%20palmatum%20koto%20no%20ito.jpg"}, {"name": "Achillea 'Fanal' or 'The Beacon' (Yarrow)", "desc": "Weeks of rich red blossoms! If you are looking for abundant blooms in shades of crimson for weeks of summer color, Achillea 'Fanal' previously known as 'The Beacon' is what you need.", "url": "/plant/achillea-fanal-or-the-beacon-yarrow", "img_src": "/rendition.grid_lg/uploads/plant/1491345089-3fe54b88d89e46303/Achillea.jpg"}, {"name": "Actaea racemosa (Black Cohosh)", "desc": "Striking all summer long, award-winning Actaea racemosa (Black Cohosh) is a beautiful perennial with deep green, finely divided foliage, enhanced by gracefully arching wands of fragrant white flowers in late summer and fall. The blooms are packed in fluffy spikes, up to 2 ft. long (60 cm), which rise well above the foliage, and mature into attractive seed pods.", "url": "/plant/actaea-racemosa-Black-Cohosh", "img_src": "/rendition.grid_lg/uploads/plant/1507556066-aa3da25470ab10255/47268848_mOptimized.jpg"}, {"name": "Agastache foeniculum 'Alabaster' (Giant Hyssop)", "desc": "Its long flowering season, showy flower spikes, licorice-scented foliage, low maintenance and deer resistance explain its great popularity among gardeners", "url": "/plant/agastache-rugosa-alabaster-giant-hyssop", "img_src": "/rendition.grid_lg/jardin/images/main_picture_524aff2267cda.jpg"}, {"name": "Alchemilla mollis (Lady's Mantle)", "desc": "A bestseller that should be in most gardens, Alchemilla mollis provides a lovely finish to a border or a path edge and blends beautifully with most plants.", "url": "/plant/alchemilla-mollis", "img_src": "/rendition.grid_lg/uploads/plant/1428507547-663e992dffd40b619/DSC_2721.jpg"}, {"name": "Allium schoenoprasum (Chives)", "desc": "Great for spicing up salads or edging borders! Chives (Allium schoenoprasum) are cultivated both for their culinary uses and their ornamental value.", "url": "/plant/allium-schoenoprasum-chives", "img_src": "/rendition.grid_lg/uploads/plant/1504625855-cab4894c09f59bae6/16015728_m.jpg"}, {"name": "Amaryllis 'Dancing Queen' (Hippeastrum)", "desc": "Resembling peonies, Amaryllis 'Dancing Queen' will take your breath away. This stunning beauty mesmerizes the viewer with extra large, luscious, frilly edged, double flowers, up to 9 in. across (22 cm), adorned with red and white stripes. The dramatic blossoms are packed with 12-14 tepals and several petaloid stamens.", "url": "/plant/amaryllis-dancing-queen-hippeastrum", "img_src": "/rendition.grid_lg/uploads/plant/1532781793-554c08366facf7e25/Hippeastrum%20Dancing%20Queen%20Optimized.jpg"}, {"name": "Amaryllis 'Nymph' (Hippeastrum)", "desc": "Bringing instant glamor to your home, Amaryllis 'Nymph' (Hippeastrum) is a voluptuous beauty with extra large, glistening white, double flowers, up to 10 in. across (25 cm), resembling peonies and delicately brushed with soft pink stripes! A magnificent, double flowering Amaryllis, packed with up to 14 tepals and several petaloids, that makes wonderful cut flowers.", "url": "/plant/amaryllis-nymph-hippeastrum", "img_src": "/rendition.grid_lg/uploads/plant/1532780693-728bcabce5644d272/Hippeastrum%20Nymph%20Â®%20Optimized.jpg"}, {"name": "Amelanchier alnifolia 'Regent' (Serviceberry)", "desc": "A compact serviceberry, Amelanchier alnifolia 'Regent' is an ornamental shrub or small tree which provides multi-season interest. In early spring, before the leaves appear, it produces masses of showy and slightly fragrant white flowers held in upright clusters.", "url": "/plant/Amelanchier-Alnifolia-Regent-Serviceberry", "img_src": "/rendition.grid_lg/uploads/plant/1443194583-c90cf76da64add143/botanikfoto-508355-L.jpg"}, {"name": "Anemone nemorosa 'Vestal' (Wood Anemone)", "desc": "Resembling a perfect powder puff, award-winning Anemone nemorosa 'Vestal' (Wood Anemone) is an herbaceous perennial producing a profusion of single, pure white flowers with 6-7 petals surrounding a cute dome-shaped center packed with narrow staminodes.", "url": "/plant/anemone-nemorosa-Vestal", "img_src": "/rendition.grid_lg/uploads/plant/1533209632-c499d76b52932ed0b/JCS110099%20Optimized.jpg"}, {"name": "Aquilegia chrysantha 'Yellow Queen' (Golden Columbine)", "desc": "Fragrant, Aquilegia chrysantha 'Yellow Queen' features masses of large, up to 3 in. across (7 cm), bright golden-yellow flowers with long, swept back spurs", "url": "/plant/aquilegia-chrysantha-yellow-queen-golden-columbine", "img_src": "/rendition.grid_lg/uploads/plant/1505253004-ca4d7bedd2dae06ed/botanikfoto-497023-L.jpg"}, {"name": "Aronia arbutifolia 'Brilliantissima' (Red Chokeberry)", "desc": "Noted for its attractive glossy red berries and excellent red fall foliage color, Aronia arbutifolia 'Brilliantissima' (Red Chokeberry) is a deciduous shrub adding multi-season beauty to the garden.", "url": "/plant/Aronia-Arbutifolia-Brilliantissima-Red-Chokeberry", "img_src": "/rendition.grid_lg/uploads/plant/1502986793-dbf0dd02d5677bd78/10895428493_a4f709ad2a_k.jpg"}, {"name": "Aster amellus 'Violet Queen' or 'Veilchenkönigin' (Italian Asters)", "desc": "Blooming generously for weeks, from late summer to mid fall, this fall Aster doesn't need staking and is not sensitive to mildew. Native to Europe, it is easy to grow, long lived and is a wonderful addition to the late summer garden.", "url": "/plant/aster-amellus-Violet-Queen-italian-asters", "img_src": "/rendition.grid_lg/uploads/plant/1521477371-d5a0864c06381f324/EH090417Optimized.jpg"}, {"name": "Aster novi-belgii 'Coombe Violet' (New York Asters)", "desc": "Adding brilliant color to the late seasonr garden, Aster novi-belgii 'Coombe Violet' (New York Aster) features masses of rich violet-purple, semi-double flowers with a sunny yellow center.", "url": "/plant/Aster-Novi-Belgii-Coombe-Violet-New-York-Asters", "img_src": "/rendition.grid_lg/uploads/plant/1457702341-570e1259b0335c7ea/CFGe529.jpg"}, {"name": "Astilbe 'Red Sentinel' (Japonica Hybrid)", "desc": "One of the best red Astilbes, Astilbe 'Red Sentinel' features vibrant crimson red flower plumes borne on erect, mahoghany-red stems", "url": "/plant/astilbe-red-sentinel-japonica-hybrid", "img_src": "/rendition.grid_lg/uploads/plant/1430253705-5e11a35c948e5f66f/AST13-16235.jpg"}, {"name": "Athyrium filix-femina (Lady Fern)", "desc": "Noted for its vigor and superb elegance, Athyrium filix-femina (Lady Fern) is a lovely deciduous fern forming a large rosette of upright to arching, lacy, lance-shaped, fresh-green fronds. The stems are generally green, but sometimes display a very interesting red hue.", "url": "/plant/Athyrium-Filix-Femina-Lady-Fern", "img_src": "/rendition.grid_lg/uploads/plant/1460233408-043508da07eb0f32b/botanikfoto-547070-L.jpg"}, {"name": "Baptisia australis var. minor (False Indigo)", "desc": "Tough and durable, Baptisia australis var. minor (False Indigo) is a compact, upright perennial with a long season of interest. In spring, this native to the North American prairies bears spikes of pea-shaped indigo blue flowers, resembling Lupines.", "url": "/plant/Baptisia-Australis-Minor-False-Indigo", "img_src": "/rendition.grid_lg/uploads/plant/1443645131-d7dcf07f468a6df57/5_30a%20Baptisia%20australis,%20or%20False%20Blue%20Indigo,%20a%20native%20perennial,%20shows%20off%20its%20purple%20pea%20family%20flowers.jpg"}, {"name": "Betula ermanii (Erman's Birch)", "desc": "Betula ermanii is a graceful medium-sized birch with peeling creamy bark on the trunk, delicately touched with copper-pink tones, and papery brown bark on the branches.", "url": "/plant/Betula-ermanii-Birch", "img_src": "/rendition.grid_lg/uploads/plant/1470948866-83393a86fef316a8a/46401758_m.jpg"}, {"name": "Brunnera macrophylla (Siberian Bugloss)", "desc": "Resembling Forget-Me-Nots, Brunnera macrophylla (Siberian Bugloss) are rhizomatous herbaceous perennials with large, ovate or heart-shaped basal leaves and pretty sprays of small bright blue flowers in spring. Although their clouds of bright blue flowers add cool and striking color to the landscape, Brunneras are mostly valued for their beautiful foliage which creates a lush carpet of deep green or variegated leaves.", "url": "/plant-variety/brunnera-macrophylla-siberian-bugloss", "img_src": "/rendition.grid_lg/uploads/plant_family/1501261312-985d40f20d6fa9ef4/54578096_m.jpg"}, {"name": "Callicarpa dichotoma (Purple Beautyberry)", "desc": "One of the best ornamental fruiting shrubs, Callicarpa dichotoma (Purple Beautyberry) is a small, compact, rounded, deciduous shrub, primarily grown for its eye-catching display of purple berries from late summer through winter.", "url": "/plant/Callicarpa-Dichotoma-Purple-Beautyberry", "img_src": "/rendition.grid_lg/uploads/plant/1531155462-8a1f7c7ad59ff6d62/botanikfoto-442111-LOptimized.jpg"}, {"name": "Campanula carpatica 'White Clips' (Carpathian Bellflower)", "desc": "A very popular Bellflower, Campanula carpatica 'White Clips' (Carpathian Bellflower) is a low-growing perennial forming a tidy mound of toothed and rounded bright green leaves. In early summer, pristine white, upturned, bell shaped flowers are borne on short stalks just above the foliage. They are produced in such quantities that they nearly cover the entire plant.", "url": "/plant/Campanula-carpatica-White-Clips-Carpathian-Bellflower", "img_src": "/rendition.grid_lg/uploads/plant/1509199249-3a0f6af073bde62eb/65873701_m%20%20Optimized.jpg"}, {"name": "Campanula rotundifolia (Bluebell)", "desc": "Delicate and graceful, Campanula rotundifolia (bluebell) is an upright perennial with attractive, bell-shaped, nodding, blue-violet flowers that hang singly or in clusters at the tip of erect stems throughout summer. Slender, the flowering stems often become so weak that the entire plant bends over.", "url": "/plant/Campanula-rotundifolia-Bluebell", "img_src": "/rendition.grid_lg/uploads/plant/1509197807-d145d54a491ce1b23/33240424_m%20Optimized.jpg"}, {"name": "Caryopteris x clandonensis 'First Choice' (Bluebeard)", "desc": "Blooming earlier than other earlier bluebeards, award-winner Caryopteris x clandonensis 'First Choice' is a compact deciduous shrub of tight habit with deep blue flowers in late summer through early fall. Opening from deep indigo-blue buds, they are attractive to butterflies, bees and other beneficial insects. They contrast nicely with the gray-green foliage of ovate, coarsely toothed, aromatic leaves, which remain fresh-looking all summer long. Valued for its late season blossoms when few other shrubs are in bloom, this easy care shrub is a superb addition to any sunny garden. Perfect for small gardens or containers. Heat tolerant.", "url": "/plant/Caryopteris-x-clandonensis-First-Choice", "img_src": "/rendition.grid_lg/uploads/plant/1538064679-6260736cdff4400f5/PM102475Optimized.jpg"}, {"name": "Chaenomeles speciosa 'Falconnet Charlet' (Japanese Quince)", "desc": "Chaenomeles speciosa 'Falconnet Charlet' (Japanese Quince) is a vigorous, spreading, deciduous shrub with abundant clusters of double, soft salmon-pink flowers. Borne on thorny, tangled branches, they bloom in profusion for 4-6 weeks in early spring, creating a brilliant floral display at a time when there is little to be excited about in the garden.", "url": "/plant/Chaenomeles-speciosa-Falconnet-Charlet", "img_src": "/rendition.grid_lg/uploads/plant/1550587154-481a06a0de5153303/PL150299Optimized.jpg"}, {"name": "Chamaecyparis obtusa 'Fernspray Gold' (Hinoki Cypress)", "desc": "Quite showy, Chamaecyparis obtusa 'Fernspray Gold' (Hinoki Cypress) is a medium-sized, upright, evergreen shrub with a gracefully irregular, pyramidal habit. Its arching to horizontal branches are densely clothed in flat sprays of fern-like foliage. Golden-yellow in full sun, the foliage becomes greener towards the interior of the plant. The typical growth rate is 6-8 in. per year (15-20 cm). A pleasure to look at year-round, this attractive Hinoki Cypress is perfect for sunny borders or rock gardens.", "url": "/plant/Chamaecyparis-obtusa-Fernspray-Gold", "img_src": "/rendition.grid_lg/uploads/plant/1524758928-ae8bfc3822db129a8/chamaecyparis-obtusa-fernspray-gold.jpg"}, {"name": "Chrysanthemum 'Samba'", "desc": "Adding romance to the late season garden, Chrysanthemum 'Samba' is a hardy garden mom featuring profuse rose pink, daisy-like flowers, 2 in. across (5 cm), adorned with a yellow center. Blooming from late summer to late fall, the multibranched stems are covered with flowers which stand out against the glossy green foliage. This perennial forms a compact, bushy mound and does not require staking.", "url": "/plant/Chrysanthemum-Samba", "img_src": "/rendition.grid_lg/uploads/plant/1523034679-6c62d2c70d81d0a4e/Chrysanthemum%20'Samba'Optimized.jpg"}, {"name": "Clematis 'Diana's Delight' (Large-Flowered Clematis)", "desc": "Perfect for the patio, Clematis 'Diana's Delight' is a compact, deciduous climber which produces masses of large, rich lavender-blue flowers, 6-7 in. (15-18 cm), adorned with a crown of creamy yellow stamens. Blooming in late spring to early summer and again in late summer to early fall, you can count on two flower shows a year.", "url": "/plant/clematis-Dianas-Delight", "img_src": "/rendition.grid_lg/uploads/plant/1517478308-8ab849a52028c42b6/dianas_delight_evipo026_1734_%20Optimized.jpg"}, {"name": "Clematis 'Jan Lindmark' (Atragene Group)", "desc": "The earliest Clematis macropetala hybrid to bloom, Clematis 'Jan Lindmark' is a deciduous climber with double, purple-mauve, nodding flowers adorned with slender sepals. Slightly twisted, the sepals open wide to reveal a contrasting white heart.", "url": "/plant/clematis-Jan-Lindmark", "img_src": "/rendition.grid_lg/uploads/plant/1492556314-594e0d37bcf898936/clematis-macropetala-jan-lindmark.jpg"}, {"name": "Clematis 'Rebecca' (Early Large-Flowered Clematis)", "desc": "Regarded by many as one of the best red clematis ever produced, Clematis 'Rebecca' produces an abundance of large, velvety, deep vibrant red flowers, up to 5-7 in. across (12-18 cm), adorned with a wispy boss of creamy-yellow stamens at their center. The stamens are unique in having red connectives, a delicate touch from the breeder, Raymond Evison.", "url": "/plant/clematis-Rebecca", "img_src": "/rendition.grid_lg/uploads/plant/1492177643-00215bd3a572bfd2b/Clematis%20Rebecca.jpg"}, {"name": "Clematis alpina 'Pamela Jackman' (Atragene Group)", "desc": "One of the first clematis to bloom in the spring, Clematis alpina 'Pamela Jackman' is a deciduous climber with masses of nodding, deep blue flowers, 3 in. across (7 cm), adorned with white stamens. Dangling in the wind, the flowers open from narrow, pointed buds. As their sepals unfurl, they gradually rise from bell to flat or gracefully reflexed, revealing the white inner skirt.", "url": "/plant/clematis-alpina-Pamela-Jackman", "img_src": "/rendition.grid_lg/uploads/plant/1492606031-bf2db05d2a44eadbf/Clematis%20Pamela%20Jackman.jpg"}, {"name": "Coreopsis 'Enchanted Eve' (Li' l Bang Series)", "desc": "Reliable and eye-catching, Coreopsis 'Enchanted Eve' is a dwarf perennial forming a compact mound of mid-green foliage that remains fresh-looking all season. Blooming profusely from early summer through fall, it is covered with attractive butter-yellow blossoms adorned with a soft burgundy heart. The cooler the temperature, the larger the burgundy heart.", "url": "/plant/Coreopsis-Enchanted-Eve-Tickseed", "img_src": "/rendition.grid_lg/uploads/plant/1515695751-f27299ebf6044d72d/Coreopsis%20'Enchanted%20Eve'Optimized.jpg"}, {"name": "Cornus kousa (Kousa Dogwood)", "desc": "Cornus kousa (Kousa Dogwood) is a small, deciduous flowering tree or multi-stemmed shrub with 4 seasons of interest. In spring, a heavenly array of star-like blooms appear. They consist of four narrowly pointed white bracts which surround the center cluster of tiny yellowish-green flowers.", "url": "/plant/cornus-kousa-kousa-dogwood", "img_src": "/rendition.grid_lg/uploads/plant/1478189195-2684b7396831abae6/46826749_m.jpg"}, {"name": "Cosmos bipinnatus 'Sonata White'", "desc": "Award-winner Cosmos bipinnatus 'Sonata White' differs from other Cosmos bipinnatus in its compactness and uniformity. Often regarded as a less important bedding plant, annual white Cosmos broke through with Sonata, which produces masses of 3 in. (7cm), pure white blossoms with a golden base from early to late summer.", "url": "/plant/cosmos-bipinnatus-sonata-white", "img_src": "/rendition.grid_lg/uploads/plant/1450908653-d1b4bab174a645bd1/27230973_m.jpg"}, {"name": "Crocus chrysanthus 'Prins Claus' (Snow Crocus)", "desc": "Crocus chrysanthus 'Prins Claus' is so ravishing with its rather large, white flowers delicately striped with blue-purple blotches and its rich golden heart.", "url": "/plant/crocus-chrysanthus-prins-claus", "img_src": "/rendition.grid_lg/uploads/plant/1506611787-47b8591c4192a9991/44565Optimized.jpg"}, {"name": "Cyclamen coum 'Tilebarn Elizabeth' (Persian Violet)", "desc": "One of the brightest jewels of the winter border, Cyclamen coum 'Tilebarn Elizabeth' is a vigorous and delightful tuberous perennial with lovely rounded pewter leaves and small but showy bicolor flowers. Pale pink verging toward white, the luminous blooms are delicately edged in rich rose-red and adorned with a dark blotch at the bottom of each petal.", "url": "/plant/Cyclamen-coum-Tilebarn-Elizabeth", "img_src": "/rendition.grid_lg/uploads/plant/1469644153-2997236320420845a/Cyclamen-23854-Lo-Res.jpg"}, {"name": "Delphinium 'Magic Fountain Sky Blue' (Larkspur)", "desc": "Ideal for small gardens or where space is at a premium, Delphinium 'Magic Fountain Sky Blue' is a shorter variety of Larkspur with elegant but sturdy flower spikes, densely packed with large, semi-double pastel blue florets and contrasting white eyes", "url": "/plant/delphinium-magic-fountain-sky-blue-larkspur", "img_src": "/rendition.grid_lg/uploads/plant/1531598071-bb51397ecc8269953/botanikfoto-475205-LOptimized.jpg"}, {"name": "Dianthus 'Green Ball' (Sweet William)", "desc": "Quite unique, Dianthus barbatus 'Green Ball' (Sweet William) produces perfectly round, fuzzy, ball-shaped, lime green flowers, up to 3 in. across (7 cm), in late spring and summer. The vivid blossoms rise on stiff, erect stems clad with long, glossy, dark green leaves. This hardy annual or short-lived perennial is a charming addition to beds and containers.", "url": "/plant/dianthus-barbatus-Green-Ball", "img_src": "/rendition.grid_lg/uploads/plant/1523299263-311f7edcccbcdd3ee/Dianthus_Green_Ball_Bloom_3298Optimized.jpg"}, {"name": "Dicentra 'Amore Pink' (Fern-Leaf Bleeding Heart)", "desc": "Very floriferous, Dicentra 'Amore Pink' (Fern-Leaf Bleeding Heart) is a compact perennial noted for its beautiful feathery blue-green foliage and its impressive count of soft pink flowers. Blooming over a very long season extending from late spring to late summer, the flowers dangle gracefully above the foliage mound, which remains fresh-looking throughout the growing season. Perfect to brighten shady borders, rock gardens, underplanting shrubs, as edging plant or as a ground cover.", "url": "/plant/Dicentra-Amore-Pink-Bleeding Heart", "img_src": "/rendition.grid_lg/uploads/plant/1537452498-b8cb98cd0ff08e3dc/Dicentra_Amore_Pink_1bOptimized.jpg"}, {"name": "Dryopteris filix-mas (Male Fern)", "desc": "Dryopteris filix-mas (Male Fern) is a large, deciduous fern with erect, stout rhizomes supporting graceful bouquets of lance-shaped, dull green fronds. Tapering at the base, each frond (blade) is pinnate-pinnatifid with 20-30 pairs of long-pointed leaflets per blade. Turning coppery in fall, this most adaptable and robust fern thrives on neglect and is pest and disease free.", "url": "/plant/Dryopteris filix-mas-male-fern", "img_src": "/rendition.grid_lg/uploads/plant/1505506120-020ecdb70faf7c232/1024px-Dryopteris_filix-mas_001.jpg"}, {"name": "Echinacea 'Sombrero Hot Coral' (Coneflower)", "desc": "Noted for its long blooming season, Echinacea 'Sombrero Hot Coral' is a vibrant Coneflower with an abundance of coral-pink flowers, 3 in. across (7 cm), adorned with a skirt of wide, overlapping, drooping petals surrounding a copper central cone. Well branched, its numerous flowering stems are sturdy and held upright.", "url": "/plant/Echinacea-Sombrero-Hot-Coral", "img_src": "/rendition.grid_lg/uploads/plant/1521129416-b22fe151daf130b8a/Echinacea_Sombrero_Hot_Coral_Bloom_3462Optimized.jpg"}, {"name": "Echinacea purpurea 'Razzmatazz' (Coneflower)", "desc": "Incredibly eye-catching and popular, Echinacea 'Razzmatazz' is an exquisite beauty with its pom-pom double Coneflowers! Well-branched, 'Razzmatazz' produces abundant magenta-purple flowers with drooping rays that stick out from a rose-pink central pompon like a formal pink pettiskirt.", "url": "/plant/Echinacea-Purpurea-Razzmatazz-coneflower", "img_src": "/rendition.grid_lg/uploads/plant/1456777867-c91e9b717a447d994/botanikfoto-534506-L.jpg"}, {"name": "Epimedium × versicolor 'Sulphureum' (Barrenwort)", "desc": "One of the best cultivars available, Epimedium × versicolor 'Sulphureum' (Barrenwort) is a low-growing semi-evergreen perennial with heart-shaped, pointed leaves that emerge red-flushed in spring, mature to pale green and turn reddish in fall. In mid to late spring, clouds of two-tone primrose-yellow flowers, 1 in. across (2 cm), are carried in open sprays on wiry stems above the foliage mound. Round and large, the creamy sepals cover the butter yellow flowers adorned with short spurs.", "url": "/plant/Epimedium-versicolor-Sulphureum", "img_src": "/rendition.grid_lg/uploads/plant/1531925590-c773206b8e7bc9624/Epimedium%20x%20versicolor%20'Sulphureum'Optimized.jpg"}, {"name": "Eryngium planum 'Blue Cap' (Flat Sea Holly)", "desc": "Eryngium Planum 'Blue Cap' (Flat Sea Holly) is a clump-forming perennial with a profusion of small, steel-blue flowers, tightly packed into egg-shaped heads, that light up the garden throughout summer. Each flower is adorned with a spiky collar of narrow bracts.", "url": "/plant/eryngium-planum-blue-cap", "img_src": "/rendition.grid_lg/uploads/plant/1548497004-b71742d8a29c19b39/12520188_s%20Optimized.jpg"}, {"name": "Erythronium revolutum (Mahogany Fawn Lily)", "desc": "Erythronium revolutum (Mahogany Fawn Lily) is a charming tuberous perennial boasting up to 4 elegant, nodding, pale to deep pink flowers per stem in mid to late spring. Each blossom features gracefully reflexed petals adorned with contrasting yellow markings in the throat.", "url": "/plant/erythronium-revolutum", "img_src": "/rendition.grid_lg/uploads/plant/1544882581-e132470a2e2c9c251/shutterstock_624046862%20Optimized.jpg"}, {"name": "Euphorbia polychroma (Cushion Spurge)", "desc": "A long season of interest! Long-lived and incredibly showy, Euphorbia polychroma is a mounding, clump-forming perennial considered one of the best for borders.", "url": "/plant/euphorbia-polychroma-cushion-spurge", "img_src": "/rendition.grid_lg/uploads/plant/1426005281-ab7789d606e9201c9/main_picture_540ddd43b67cd.jpg"}, {"name": "Fragaria 'Jewel' (Junebearing Strawberry)", "desc": "Fragaria 'Jewel' (Junebearing Strawberry) is a late midseason cultivar producing large, glossy strawberries of great quality and flavor. Five-petaled white flowers adorned with yellow centers appear in early spring and give way to large red berries which ripen around the month of June, hence the name.", "url": "/plant/Fragaria-ananassa-Jewel", "img_src": "/rendition.grid_lg/uploads/plant/1551379481-90117985486805dcb/20988757_sOptimized.jpg"}, {"name": "Fritillaria meleagris var. unicolor subvar. alba (Checkered Lily)", "desc": "Fritillaria meleagris 'Alba' (Checkered Lily) is a bulbous perennial with charming pendent, pure white, bell-shaped flowers on slender stems in mid to late spring. Its pure white petals are adorned with a faint check pattern like a watermark.", "url": "/plant/fritillaria-meleagris-Alba", "img_src": "/rendition.grid_lg/uploads/plant/1533229511-a7cebd973779fa5bc/Fritillaria%20melegaris%20'Alba%20Optimized.jpg"}, {"name": "Gaillardia x grandiflora 'Sunset Spice' (Blanket Flower)", "desc": "Exceptionally floriferous, Gaillardia x grandiflora 'Sunset Spice' (Blanket Flower) is a bushy, often short-lived herbaceous perennial with eye-catching, red-orange flowers adorned with two rows of flat petals, fringed with yellow at their tips. Blooming from early summer into fall, the daisy-like flowers are colorfast and age well. They cover the compact mound of fresh gray-green foliage. Rich of nectar, the flowers are real magnets for butterflies. Drought and heat tolerant, this Blanket Flower requires little care once established.", "url": "/plant/gaillardia-grandiflora-Sunset-Spice", "img_src": "/rendition.grid_lg/uploads/plant/1528116994-0a1e0f1f5e79f991a/Gaillardia-SM-Sunset-Spice-003-e1429139255165.jpg"}, {"name": "Geranium 'Ann Folkard' (Cranesbill)", "desc": "Noted for its exceptionally long flowering period and spreading habit", "url": "/plant/geranium-ann-folkard-cranesbill", "img_src": "/rendition.grid_lg/uploads/plant/1513010272-d049bea5ea330944f/15043Optimized.jpg"}, {"name": "Geranium pratense (Meadow Cranesbill)", "desc": "Tall, with finely cut leaves forming a dramatic mound, Geranium pratense (Meadow Cranesbill) is a clump-forming perennial with abundant clusters of large, saucer-shaped, blue or violet flowers from late spring to mid-summer. This Geranium may even rebloom in late summer or fall if the plant is cut back after the first flush of blooms.", "url": "/plant/geranium-pratense-meadow-cranesbill", "img_src": "/rendition.grid_lg/uploads/plant/1499097590-74cd0582474606a47/hodge0606-036.jpg"}, {"name": "Geum 'Fireball' (Avens)", "desc": "Long-lasting and regarded as one of the most impressive orange blooming perennials in the spring, Geum 'Fireball' is a clump-forming, herbaceous perennial with profuse and large (1.5 in. or 4 cm across), orange-yellow, semi-double flowers appearing in late spring through early summer.", "url": "/plant/Geum-Fireball-Avens", "img_src": "/rendition.grid_lg/uploads/plant/1454368719-0b4ea7c0a8d839530/Geum_Fireball_4b.jpg"}, {"name": "Gladiolus 'Elvira' (Sword-Lily)", "desc": "Gladiolus 'Elvira' is really charming with its long-lasting, very pale pink flowers with red kiss-like markings on the petals.", "url": "/plant/gladiolus-elvira", "img_src": "/rendition.grid_lg/uploads/plant/1542654321-5da5900879297a0ea/201810%20Gladiolus%20ElviraOptimized.jpg"}, {"name": "Hamamelis x intermedia 'Aurora' (Witch Hazel)", "desc": "Boasting the largest flowers of all Witch hazels, Hamamelis x intermedia 'Aurora' is a vigorous, deciduous shrub with very fragrant, bright yellow flowers in late winter to early spring.", "url": "/plant/Hamamelis-Intermedia-Aurora-Witch-Hazel", "img_src": "/rendition.grid_lg/uploads/plant/1474314301-837917a38159bce2b/hamamelis-x-intermedia-aurora.jpg"}, {"name": "Helenium 'Rubinzwerg' (Sneezeweed)", "desc": "Award-winner Helenium 'Rubinzwerg' features masses of cheerful rich mahogany red daisylike flowers that surround a green disk that matures to dark chocolate and opens with a rim of golden anthers.", "url": "/plant/helenium-rubinzwerg-sneezeweed", "img_src": "/rendition.grid_lg/uploads/plant/1428172136-3ffb29df1efffbad3/100412.jpg"}, {"name": "Helianthus annuus 'Suntastic Yellow with Black Center' (Common Sunflower)", "desc": "Very floriferous and perfect for pots and containers, award-winner Helianthus annuus 'Suntastic Yellow with Black Center' (Common Sunflower) is a dwarf, well-branched annual boasting a profusion of large blossoms, up to 6 in. across (15 cm), adorned with bright golden petals and chocolate brown centers.", "url": "/plant/Helianthus-annuus-Suntastic-Yellow-with-Black-Center", "img_src": "/rendition.grid_lg/uploads/plant/1546546604-2f86336f148258662/Sunflower_Suntastic_Yellow_Black_Eye_Bloom_20389Optimized.jpg"}, {"name": "Helleborus 'Midnight Ruffles' (Hellebore)", "desc": "Helleborus ‘Midnight Ruffles’ is a Lenten Rose with large double flowers, up to 3 in. across (7 cm), packed with gently ruffled, velvety black petals, which contrast with the pale yellow stamens. Blooming heavily in early to mid spring, these nodding beauties rise on sturdy stems and contrast well with the glossy, dark green, evergreen foliage. This Hellebore belongs to the Winter Thrillers Series, which is noted for its double flowered selections which retain their color for up to 12 weeks, long after the flowers are spent.", "url": "/plant/Helleborus-Midnight-Ruffles", "img_src": "/rendition.grid_lg/uploads/plant/1529853061-f0c954bf5448d3adb/Helleborus%20'Midnight%20Ruffles'%20Optimized.jpg"}, {"name": "Helleborus Winter Jewels 'Sparkling Diamond'", "desc": "Amazingly beautiful, Hellebore Winter Jewels 'Sparkling Diamond' (Helleborus) features very large, fully double, lotus-like, cup-shaped pure white blossoms", "url": "/plant/helleborus-winter-jewels-sparkling-diamond", "img_src": "/rendition.grid_lg/uploads/plant/1431624958-3151eaa3e750f22f9/Helleborus_Sparkling_Diamond_4b.jpg"}, {"name": "Hemerocallis 'Awesome Blossom' (Reblooming Daylily)", "desc": "Hemerocallis 'Awesome Blossom' is a breathtaking early midseason Daylily which produces an abundance of large, 5 in. wide (12 cm), antique rose to apricot flowers with a contrasting raisin plum eyezone and a lime-green throat.", "url": "/plant/hemerocallis-Awesome-Blossom-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1518787715-5f593560ede7c3651/27904266_mOptimized.jpg"}, {"name": "Hemerocallis 'Flamingo Fantasy' (Daylily)", "desc": "Fragrant, Hemerocallis 'Flamingo Fantasy' is a lovely early midseason Daylily which produces blooms of large, gently ruffled, clear pink trumpets, 5 in. wide (12 cm), with a rich rose eyezone and a lime-green throat.", "url": "/plant/hemerocallis-Flamingo Fantasy-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452526620-d6eeecf9e87b1c258/Hemerocallis-Flamingo-Fantasy-4568.jpg"}, {"name": "Hemerocallis 'Mardi Gras Parade' (Daylily)", "desc": "Hemerocallis 'Mardi Gras Parade' is an attractive early midseason Daylily which produces an abundance of small, lavender flowers, up to 3.75 in. wide (9 cm), with a large, wine-purple eyezone and a chartreuse green throat.", "url": "/plant/hemerocallis-Mardi-Gras-Parade-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452454899-4c9b8c57c10a51513/Hemerocallis-Mardi-Gras-Parade-2020.jpg"}, {"name": "Hemerocallis 'Primal Scream' (Daylily)", "desc": "A highly popular orange Daylily, multiple award-winner Hemerocallis 'Primal Scream' produces a profusion of vibrant tangerine blossoms with slightly ruffled, recurved petals and soft green throats.", "url": "/plant/hemerocallis-primal-scream-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1430165357-bc509eb52328ae4ae/hemprimalscream_cjw10_2.jpg"}, {"name": "Hemerocallis 'Tiger Swirl' (Daylily)", "desc": "Noted for its uniquely shaped petals, Hemerocallis 'Tiger Swirl' is a midseason Daylily with masses of very large, fragrant, pale golden yellow flowers adorned with a conspicuous raspberry-red eye. Its bottom sepals are smooth, often twisting or curling into a “swirling” motion.", "url": "/plant/hemerocallis-Tiger-Swirl", "img_src": "/rendition.grid_lg/uploads/plant/1518800546-c93f44b7376631a88/Hemerocallis%20'Tiger%20Swirl'Optimized.jpg"}, {"name": "Heuchera 'Frosted Violet' (Coral Bells)", "desc": "Vigorous, Heuchera 'Frosted Violet' is an eye-catching cultivar of Coral Bells with rounded, lobed, pink-purple leaves maturing to silvery-purple to plum-purple with darker veining. These colors intensify with the cool fall weather for an even greater display. The fine hairs which cover the leaves seem to glow in the sun and give a lovely \"frosted\" appearance. In late spring to mid-summer, masses of small, dainty, pale pink flowers keep blooming on tall stems rising up to 30 in. (75 cm) above the evergreen foliage.", "url": "/plant/heuchera-Frosted-Violet", "img_src": "/rendition.grid_lg/uploads/plant/1530167617-1bd2084a10a363596/Heuchera%20'Frosted%20Violet'%20Optimized.jpg"}, {"name": "Hibiscus 'Airbrush Effect' (Rose Mallow)", "desc": "Noted for its abundant flower buds and long blooming season, Hibiscus 'Airbrush Effect' (Rose Mallow) is a compact, well-branched, deciduous shrub with large, vibrant pink flowers, up to 8 in. across (20 cm), adorned with a white halo and a small dark red eye. Their overlapping petals unfurl as the countless buds open to become wide and flat.", "url": "/plant/Hibiscus-Airbrush-Effect-Rose-Mallow", "img_src": "/rendition.grid_lg/uploads/plant/1516971957-d60fa14ec459b929b/Hibiscus%20'Airbrush%20Effect'2%20Optimized.jpg"}, {"name": "Hibiscus syriacus 'Lavender Chiffon' (Rose of Sharon)", "desc": "Award-winning Hibiscus syriacus 'Lavender Chiffon' (Rose of Sharon) is a bushy deciduous shrub noted for its large, lilac-pink, double flowers, up to 4 in. across (10 cm), adorned with darker veins at their center. Blooming continuously from late summer to fall, each flower lasts about one day and stands out against the green foliage of broadly ovate leaves.", "url": "/plant/Hibiscus-syriacus-Lavender-Chiffon-Rose-of-Sharon", "img_src": "/rendition.grid_lg/uploads/plant/1522939539-cf7854f003862488b/Hibiscus%20Lavender%20ChiffonOptimized.jpg"}, {"name": "Hosta 'Brother Stefan' (Plantain Lily)", "desc": "A large hosta of moderate growth rate, Hosta 'Brother Stefan' (Plantain Lily) forms a wide, open mound of thick, heavily seersuckered, medium green leaves with brilliant golden-yellow centers resembling hand prints or maple leaves. In spring, the margin may have a waxy coating making it appear more blue, and the center may be more chartreuse.", "url": "/plant/hosta-Brother-Stefan", "img_src": "/rendition.grid_lg/uploads/plant/1521212964-1309458564052d0ab/Hosta%20'Brother%20Stefan'Optimized.jpg"}, {"name": "Hosta 'Liberty' (Plantain Lily)", "desc": "Hosta 'Liberty' is a large variegated hosta forming an upright mound of thick, broadly heart-shaped, blue-green leaves, 12 in. long (30 cm), widely and irregularly margined golden-yellow, gradually maturing to ivory. Funnel-shaped lavender blooms appear in early to midsummer, rising on scapes 40 in. long (100 cm), but the primary contribution of this hosta is its lovely foliage.", "url": "/plant/hosta-Liberty", "img_src": "/rendition.grid_lg/uploads/plant/1521224332-013753800ef1633bf/Hosta%20'Liberty'2Optimized.jpg"}, {"name": "Hosta 'Wide Brim' (Plantain Lily)", "desc": "Among the most popular variegated hostas ever introduced, Plantain Lily 'Wide Brim' (Hosta) cheerfully brings some color to shady areas! It forms an attractive, dome-shaped mound of broadly heart-shaped, puckered dark green leaves with a blue cast, widely and irregularly margined buttery yellow.", "url": "/plant/hosta-Wide-Brim-plantain-lily", "img_src": "/rendition.grid_lg/uploads/plant/1511998707-d8c154e4c711c467e/PER0288Optimized.jpg"}, {"name": "Hyacinthus orientalis 'Blue Jacket' (Dutch Hyacinth)", "desc": "Highly fragrant, multi-award winning Hyacinth 'Blue Jacket' features dense spikes of deep blue flowers with a dark purple stripe on each petal", "url": "/plant/hyacinthus-orientalis-blue-jacket-dutch-hyacinth", "img_src": "/rendition.grid_lg/uploads/plant/1428091126-1bff302408d9ed1a6/Hyacinthus%20Blue%20Jacket.jpg"}, {"name": "Hydrangea arborescens (Smooth Hydrangea)", "desc": "Native to the Eastern United States, Hydrangea arborescens (Smooth Hydrangea) is a widely branched deciduous shrub, acclaimed for its creamy-white flower clusters that brighten shady areas and bring life to the garden. Blooming profusely from early summer to fall, the distinctly domed to nearly rounded blossoms open lime-green, change to brilliant creamy-white before switching to a tan shade in the fall.", "url": "/plant-variety/hydrangea-arborescens-smooth-hydrangea", "img_src": "/rendition.grid_lg/uploads/plant_family/1515447237-d504ae78926f976c3/20681053_mOptimized.jpg"}, {"name": "Hydrangea paniculata (Panicle Hydrangea)", "desc": "Native to China and Japan, Hydrangea paniculata (Panicle Hydrangea) is a deservedly popular deciduous shrub. Tough, cold-hardy, easy-care, long-lived, it is laden with large, conical, snowy flowers from midsummer to fall. Each lacy flower cluster is composed of small fertile flowers, and larger showy sterile blossoms that are subtended by showy petal-like sepals. As an added bonus, they change color as fall approaches, gradually turning pink, and ultimately brown.", "url": "/plant-variety/hydrangea-paniculata", "img_src": "/rendition.grid_lg/uploads/plant_family/1515452995-2ce5d828d4bbb0fc2/64208710_mOptimized.jpg"}, {"name": "Ilex verticillata 'Mr. Poppins' (Winterberry)", "desc": "Perfect for small spaces, Ilex verticillata 'Mr. Poppins' (Winterberry) is a dwarf deciduous shrub with elliptic, toothed, glossy, dark green leaves. 'Mr. Poppins' is a male plant that does not get fruit but will serve to pollinate female varieties such as 'Berry Poppins' to produce the attractive red berries.", "url": "/plant/Ilex-Verticillata-Mr-Poppins", "img_src": "/rendition.grid_lg/uploads/plant/1530629573-ec7cd9115242cb8b7/mr_poppins_ilex_vert_p7230109_0Optimized.jpg"}, {"name": "Iris 'Absolute Treasure' (Bearded Iris)", "desc": "Noted for its tall stature and sweet fragrance, award-winner Iris 'Absolute Treasure' is a very impressive bearded iris with heavily ruffled sky blue standards floating above slightly paler falls and pleasantly contrasting with the white beard white, tipped gold. A definite diva in the spring garden. 42 inches tall (105 cm).", "url": "/plant/iris-Absolute-Treasure-bearded-iris-1-1", "img_src": "/rendition.grid_lg/uploads/plant/1446828310-f2f76536138ecea48/absolutetreasure_web1.jpg"}, {"name": "Iris 'Clarence' (Reblooming Bearded Iris)", "desc": "Reblooming, fragrant and good looking! Iris 'Clarence' is a striking Tall Bearded Iris with white standards tinted violet contrasting with the light blue-violet falls and creamy beard.", "url": "/plant/iris-clarence-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/jardin/images/main_picture_521f7d7c702f6.jpg"}, {"name": "Iris 'Hello Darkness' (Bearded Iris)", "desc": "One of the darkest iris, multiple award-winning Iris 'Hello Darkness' is a spectacular beauty that commands the attention in the garden with its velvety, purple-black, ruffled flowers.", "url": "/plant/iris-hello-darkness-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1447273737-9b304cffb8bdefaf4/41689001_m.jpg"}, {"name": "Iris 'Pink Attraction' (Reblooming Bearded Iris)", "desc": "Fragrant, reblooming and fabulous looking! Iris 'Pink Attraction' truly deserves its name with its generous display of attractive, ruffled petals, light pink-colored with a streak of violet and an orange beard.", "url": "/plant/iris-pink-attraction-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/jardin/images/main_picture_521fa65483281.jpg"}, {"name": "Iris 'Sugar Blues' (Reblooming Bearded Iris)", "desc": "Putting on two remarkable shows in spring and early fall, Iris 'Sugar Blues' is favored by many gardeners for the beauty of its flowers and its consistent reblooming performance, even in colder climates.", "url": "/plant/iris-Sugar-Blues-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1462532484-7a5237f64c7af3d6d/Iris-Sugar-Blues-jww-2688.jpg"}, {"name": "Iris ensata 'Pink Frost' (Japanese Iris)", "desc": "Japanese Iris 'Pink Frost' (Iris ensata) produces large, gently ruffled, double, lavender-pink flowers, presenting luminous white blotches around their bright yellow throat.", "url": "/plant/iris-ensata-Pink-Frost-japanese-iris", "img_src": "/rendition.grid_lg/uploads/plant/1449089927-c929946f80ef509fc/42377603_m.jpg"}, {"name": "Iris sibirica 'Ruffled Velvet' (Siberian Iris)", "desc": "A jewel in the garden, Iris sibirica 'Ruffled Velvet' (Siberian Iris) is a clump-forming perennial with incredibly beautiful flowers in late spring to early summer. Each blossom features broad amethyst standards and ruffled, deeper purple falls delicately yellow-veined at their base.", "url": "/plant/iris-sibirica-ruffled-velvet-siberian-iris", "img_src": "/rendition.grid_lg/uploads/plant/1516113036-620f8b7757fc5847d/Iris--i-sibirica-i--Ruffled-Velvet-1817Optimized.jpg"}, {"name": "Juniperus communis 'Repanda' (Common Juniper)", "desc": "Juniperus communis 'Repanda' (Common Juniper) is a dense, prostrate, evergreen shrub forming a lovely, uniform carpet. The foliage has a different texture than other junipers giving it a unique look. The branches are thin, nodding at their tips, densely arranged and covered with soft, narrow, dark green needles adorned with white bands. The foliage turns a bronze color in winter. It produces green berries that turn blue or black at maturity.", "url": "/plant/Juniperus-communis-Repanda", "img_src": "/rendition.grid_lg/uploads/plant/1523878737-56798cc59f5912672/botanikfoto-526108-LOptimized.jpg"}, {"name": "Larix kaempferi (Japanese Larch)", "desc": "Larix kaempferi (Japanese Larch) is a vigorous deciduous conifer adorned with a round, straight trunk and long, horizontally spreading branches and slender pendulous branchlets. The crown is conical, dense, becoming irregular and more open with age.", "url": "/plant/Larix-kaempferi", "img_src": "/rendition.grid_lg/uploads/plant/1548416872-a6844214cb608bba5/shutterstock_1057861049%20Optimized.jpg"}, {"name": "Lathyrus odoratus 'Southbourne' (Sweet Pea)", "desc": "Vigorous and delightfully fragrant, Lathyrus odoratus 'Southbourne' is a very attractive Sweet Pea with masses of large, fragrant, shell-pink flowers.", "url": "/plant/Lathyrus-Odoratus-Southbourne-Sweet-Pea", "img_src": "/rendition.grid_lg/uploads/plant/1465225814-6ef07bb78f4934ca3/40159040_m.jpg"}, {"name": "Lavandula x intermedia 'Provence' (Lavender)", "desc": "Many superlatifs can be used to describe Lavandin 'Provence as it is one of the best lavenders for humid summers, one of the lavenders with the strongest fragrance and one of the best lavenders for creating hedges.", "url": "/plant/lavandula-x-intermedia-provence-lavender", "img_src": "/rendition.grid_lg/uploads/plant/1426610621-f226b453adb2aca21/DSC_1473.jpg"}, {"name": "Lilium 'Brindisi' (Longiflorum-Asiatic Lily)", "desc": "Fragrant, Lilium 'Brindisi' is a highly romantic-looking LA hybrid Lily that is full of charm with its upward-facing, soft pink flowers revealing a deeper pink throat. The pleasantly scented blossoms, up to 7 buds per stem, contrast nicely with the lance-like green foliage.", "url": "/plant/lilium-Brindisi-lily", "img_src": "/rendition.grid_lg/uploads/plant/1462477512-6e7e305106e0e47ff/37465.jpg"}, {"name": "Lilium 'Pink Perfection' (Trumpet Lily)", "desc": "Adding stunning height, scent and color to any planting, award-winner Lilium 'Pink Perfection' is an exquisite Trumpet Lily with huge, purplish-pink trumpet-shaped blossoms marked with deep carmine reverse.", "url": "/plant/lilium-pink-perfection-lily", "img_src": "/rendition.grid_lg/uploads/plant/1487278941-b24462f9c4335161e/56859.jpg"}, {"name": "Lilium lancifolium (Tiger Lily)", "desc": "Prolific and impressive, Lilium lancifolium or Lilium tigrinum (Tiger Lily) commands our attention with its bright and showy, orange-colored flowers covered with black or deep crimson spots, giving the appearance of the skin of the tiger", "url": "/plant/lilium-lancifolium-tiger-lily", "img_src": "/rendition.grid_lg/uploads/plant/1487282953-9fe42959fb9b804f1/27585628_m.jpg"}, {"name": "Lonicera 'Mandarin' (Honeysuckle)", "desc": "Lonicera 'Mandarin' (Honeysuckle) is a twining deciduous vine with large whorls of brilliant flowers, bright mandarin orange on the outside and yellow-orange inside. Produced profusely in early summer, they continue blooming intermittently until fall.", "url": "/plant/Lonicera-Mandarin", "img_src": "/rendition.grid_lg/uploads/plant/1543173865-882bcf339fecdeb19/shutterstock_305375525Optimized.jpg"}, {"name": "Lupinus 'Masterpiece' (Lupine)", "desc": "Gracing the garden in late spring - early summer, Lupinus 'Manhattan Lights' (Lupine) features showy, erect spikes of densely packed, sweetly scented, purple and yellow flowers.", "url": "/plant/lupinus-Masterpiece-lupine", "img_src": "/rendition.grid_lg/uploads/plant/1547563289-1ac5845f0583e161c/shutterstock_665937412Optimized.jpg"}, {"name": "Magnolia 'Daybreak'", "desc": "Delightfully fragrant, award-winning Magnolia 'Daybreak' is a small deciduous tree adorned with a profusion of rose-pink flowers in mid to late spring. Emerging with a light green cast, the large flowers, up to 10 in. across (25 cm), count 8 splayed-out tepals which are lighter on the inside.", "url": "/plant/Magnolia-Daybreak", "img_src": "/rendition.grid_lg/uploads/plant/1477689172-24c20ab7cc56d12b3/59975683_m.jpg"}, {"name": "Magnolia × loebneri 'Leonard Messel'", "desc": "Noted for its frost resistance, award-winning Magnolia x loebneri 'Leonard Messel' is a vigorous medium-sized deciduous shrub or small tree of remarkable beauty when in full bloom.", "url": "/plant/Magnolia-loebneri-Leonard-Messel", "img_src": "/rendition.grid_lg/uploads/plant/1477678112-3439e3add8ff938ef/59975660_m.jpg"}, {"name": "Malus 'Royalty' (Crabapple)", "desc": "One of the very best crabapples for dark purple foliage, Malus 'Royalty' is a dense, spreading deciduous tree with ovate dark purple leaves, turning vivid red in the fall. Masses of fragrant, purplish-red, single flowers appear in pretty clusters in mid-spring.", "url": "/plant/Malus-Royalty", "img_src": "/rendition.grid_lg/uploads/plant/1540034898-a882b17cd530308d9/56354271_s%20Optimized.jpg"}, {"name": "Malus hupehensis (Tea Crabapple)", "desc": "Extremely picturesque, Malus hupehensis (Tea Crabapple) is a vigorous deciduous tree of widely spreading, vase-shaped habit with straight, upright limbs studded with countless, short lateral twigs on which flower spurs are formed. Opening from pink buds, masses of fragrant, single white blossoms appear in mid-spring.", "url": "/plant/Malus-hupehensis", "img_src": "/rendition.grid_lg/uploads/plant/1540051924-6676adff993f654ca/botanikfoto-437366-L%20Optimized.jpg"}, {"name": "Miscanthus sinensis 'Kleine Silberspinne' (Maiden Grass)", "desc": "Ideal for small gardens! Quite compact, award-winner Maiden Grass 'Kleine Silberspinne' (Miscanthus sinensis) or 'Little Silver Spider' in English, is a remarkable ornamental grass for many reasons.", "url": "/plant/miscanthus-sinensis-kleine-silberspinne-maiden-grass", "img_src": "/rendition.grid_lg/uploads/plant/1539808748-636186a1b48c106cd/Miscanthus_sinensis_Kleine_Silberspinne_HF105601Optimized.jpg"}, {"name": "Monarda 'Leading Lady Lilac' (Bee Balm)", "desc": "Compact and early flowering, Monarda 'Leading Lady Lilac' (Bee Balm) is a clump-forming, densely branched perennial which produces pale lilac-purple flowers, borne in dense, globular terminal heads. A fine mist of dark purple spots appears on the open petals. Blooming for weeks from early to mid summer, they rest upon a whorl of decorative bracts and attract scores of butterflies and hummingbirds.", "url": "/plant/monarda-Leading-Lady-Lilac", "img_src": "/rendition.grid_lg/uploads/plant/1549100902-cbf79ec6da12dcc4e/Monarda%20'Leading%20Lady%20Lilac'%20PP26431%20CPBR5565%200001%20high%20res%20Optimized.jpg"}, {"name": "Muscari 'Baby's Breath' (Grape Hyacinth)", "desc": "Particularly beautiful, Muscari 'Baby's Breath' is a distinctive grape hyacinth with clusters of pale, icy blue flowers that open from lime-green buds. Vigorous and delightfully scented, it is perfect for borders, containers or at home in a vase. Rising up to 6-8 inches tall (15-20 cm), this Grape Hyacinth will naturalize well", "url": "/plant/muscari-Babys-Breath", "img_src": "/rendition.grid_lg/uploads/plant/1529677542-1c85ad7f68fc9f346/220415%20Muscari%20'Baby%20Breath'-Ipheion%20'Alberto%20Castillo'%20Optimized.jpg"}, {"name": "Narcissus 'Carlton' (Large-Cupped Daffodil)", "desc": "Rich of a strong vanilla scent, multiple award-winning Narcissus 'Carlton' is an exquisite, solid golden-yellow daffodil featuring very large flowers, 5 in. across (12 cm), adorned with wide, gracefully frilled cups and broad, overlapping petals. Blooming in mid spring, this highly popular Large-Cupped Daffodil is a strong performer of immense vigor, and one of the best perennializers. It is famously reliable for large scale plantings.", "url": "/plant/narcissus-carlton-large-cupped-daffodil", "img_src": "/rendition.grid_lg/uploads/plant/1536697670-75237685424fecd1d/206360%20Narcissus%20CarltonOptimized.jpg"}, {"name": "Narcissus 'Jetfire' (Cyclamineus Daffodil)", "desc": "Free flowering and slightly scented, multiple award-winner Narcissus 'Jetfire' or 'Jet Fire' is one of the most striking of all dwarf narcissus, producing large flowers, 3 in. across (7.5 cm), adorned with vivid yellow, strongly reflexed petals and an extraordinary reddish-orange trumpet. Blooming in early to mid spring, one flower per stem, this small but sturdy Miniature Daffodil is terrific for borders or containers.", "url": "/plant/narcissus-jetfire-cyclamineus-daffodil", "img_src": "/rendition.grid_lg/uploads/plant/1536689182-68a74c9d3c0920f5f/208621%20Narcissus%20JetfireOptimized.jpg"}, {"name": "Narcissus 'Silver Smiles' (Jonquil Daffodil)", "desc": "Fragrant, Narcissus 'Silver Smiles' is a lovely Jonquil Daffodil featuring clusters of 3 flowers per stem, elegantly combining glistening creamy-white petals and pale yellow cups that gradually fade to white. Blooming in mid to late spring, this daffodil fills the air with its wonderful fragrance and adds charm to beds, borders and containers. Performs well in both warm and cold climates.", "url": "/plant/Narcissus-Silver-Smiles", "img_src": "/rendition.grid_lg/uploads/plant/1536386819-2041c3d57d2632ce1/91587221_s%20Optimized.jpg"}, {"name": "Nepeta racemosa 'Blue Wonder' (Catmint)", "desc": "Catmint 'Blue Wonder' (Nepeta racemosa) is a lovely dwarf perennial noted for its continuous massive dark blue blooms, on short spikes atop aromatic, gray-green foliage, from late spring to early fall.", "url": "/plant/nepeta-racemosa-blue-wonder", "img_src": "/rendition.grid_lg/jardin/images/main_picture_527b8471652a6.jpg"}, {"name": "Paeonia 'America' (Peony)", "desc": "Widely regarded to be the best of the single, red Hybrid Peonies, award-winner 'America' features large, brilliant, scarlet-red flowers opening from cup-shaped buds.", "url": "/plant/paeonia-America-peony", "img_src": "/rendition.grid_lg/uploads/plant/1450038200-87d8debc5bd6a92c2/DSC_6303.jpg"}, {"name": "Paeonia 'Lovely Rose' (Peony)", "desc": "A very pretty Hybrid Peony, award-winner 'Lovely Rose' produces eye-catching, semi-double, silky, creamy rose-pink flowers. Cup-shaped, the large petals surround a center filled with bright golden-yellow stamens.", "url": "/plant/paeonia-Lovely Rose-peony", "img_src": "/rendition.grid_lg/uploads/plant/1449948378-bd788fb8a5bcf4fbc/DSC_6254.jpg"}, {"name": "Paeonia lactiflora 'Cheddar Charm' (Peony)", "desc": "Delicately fragrant, Peony 'Cheddar Charm' (Paeonia lactiflora) will charm you every spring with its large blossoms of anemone form. It features a double ring of overlapping, wavy white guard petals surrounding a heart packed with brilliant, forked, golden-yellow staminodes.", "url": "/plant/paeonia-lactiflora-Cheddar-Charm-peony", "img_src": "/rendition.grid_lg/uploads/plant/1450359551-659272e5abffa6d69/DSC_6403.jpg"}, {"name": "Paeonia lactiflora 'Martha Bulloch' (Peony)", "desc": "Fragrant and floriferous, Peony 'Martha Bulloch' (Paeonia lactiflora) is a real masterpiece with its enormous, rose-shaped, double flowers, up to 9-12 in. across (22-30 cm).", "url": "/plant/paeonia-lactiflora-Martha-Bulloch-peony", "img_src": "/rendition.grid_lg/uploads/plant/1449942694-2e2c3aa0a1eb0ed6e/14584866_m.jpg"}, {"name": "Panicum virgatum 'Cloud Nine' (Switch Grass)", "desc": "One of the tallest switch grass, Panicum virgatum 'Cloud Nine' forms an erect-stemmed and narrow clump of glaucous blue foliage in spring, which gets topped in mid to late summer by a profusion of finely-textured, airy golden flower panicles which hover over the foliage like an airy cloud.", "url": "/plant/panicum-virgatum", "img_src": "/rendition.grid_lg/uploads/plant/1433256670-603d263a69fa7639a/Panicum_virgatum_Cloud_Nine_2009_09.jpg"}, {"name": "Papaver orientale 'Turkenlouis' (Oriental Poppy)", "desc": "Perhaps one of the showiest, Oriental Poppy 'Turkenlouis' (Papaver orientale) features huge, crepe papery, cup-shaped flowers with deeply fringed red-orange petals surrounding a dark center", "url": "/plant/papaver-orientale-Turkenlouis-oriental-poppy", "img_src": "/rendition.grid_lg/uploads/plant/1430304568-841f7a2dc1de64c56/20307002_m.jpg"}, {"name": "Petunia 'Easy Wave Red Velour'", "desc": "Petunia 'Easy Wave Red Velour' is a mound forming, spreading annual or perennial boasting masses of velvety deep red flowers from late spring to the first frosts. Fast-growing and blooming freely all season, this Petunia is dense and full, making it perfect to quickly cover a large area in the garden, or to gracefully cascade from baskets and containers.", "url": "/plant/Petunia-Easy-Wave-Red-Velour", "img_src": "/rendition.grid_lg/uploads/plant/1556094538-9729f2da0159fad44/Spreading_Petunia_Easy_Wave_Red_Velour_Landscape_22871%20Optimized.jpg"}, {"name": "Petunia 'Supertunia Mulberry Charm'", "desc": "Petunia 'Supertunia Mulberry Charm' is a mounding trailing annual or perennial boasting masses of pale pink flowers adorned with deep purple veins from late spring to the first frosts. Vigorous and blooming freely all season, this Petunia is perfect for the front of flower beds. It is terrific in containers or hanging baskets, where it can function as a filler or trail gracefully over the edges.", "url": "/plant/Petunia-Supertunia-Mulberry-Charm", "img_src": "/rendition.grid_lg/uploads/plant/1556294739-33408f34d65784fe1/supertunia_mulberry_charm_tag%20Optimized.jpg"}, {"name": "Phlox paniculata 'Candy Twist' (Garden Phlox)", "desc": "A dwarf and compact garden phlox, Phlox paniculata 'Candy Twist' is an herbaceous perennial with striking clusters of lavender-pink flowers adorned with contrasting white stripes like the spokes of a wheel. Blooming for weeks from mid to late summer, the fragrant flowers are rich of nectar and visited by hummingbirds and butterflies.", "url": "/plant/phlox-paniculata-Candy-Twist-garden-phlox", "img_src": "/rendition.grid_lg/uploads/plant/1512743115-2d46ce1c94af419ef/43386006_mOptimized.jpg"}, {"name": "Phlox subulata 'Blue Emerald' (Creeping Phlox)", "desc": "Phlox subulata 'Blue Emerald' (Creeping Phlox) is a popular evergreen perennial with masses of delicate lavender-blue flowers which blanket the dark green, needle-like foliage in mid to late spring. Vigorous, it forms a pretty flower carpet and adds a splash of color for about 3-4 weeks. Perfect for rocky areas, slopes and flower borders.", "url": "/plant/phlox-subulata-Blue-Emerald-creeping-phlox", "img_src": "/rendition.grid_lg/uploads/plant/1512589002-c0f9b1fedcd14cc37/11030248_mOptimized.jpg"}, {"name": "Picea glauca 'Echiniformis' (White Spruce)", "desc": "Picea glauca var. albertiana 'Alberta Globe' (White Spruce) is a dwarf, ball-shaped, dense evergreen conifer with perfectly uniform branching. Emerging light green, its fine needles turn to glue-green as they mature. A slow grower, 2 in. per year (5 cm), this Dwarf White Spruce makes a glorious accent in the rock garden.", "url": "/plant/Picea-glauca-Echiniformis", "img_src": "/rendition.grid_lg/uploads/plant/1534104120-5f889a60dcead3e8d/PM113053Optimized.jpg"}, {"name": "Pinus mugo 'Gnom' (Dwarf Mountain Pine)", "desc": "Pinus mugo 'Gnom' is a slow-growing dwarf evergreen Mountain Pine which adds charm and exoticism to the garden. It forms a tight, globular mound with a dense foliage of deep jade-green needles. A very appealing addition for small gardens.", "url": "/plant/Pinus-mugo-Gnom-Dwarf-Mountain-Pine", "img_src": "/rendition.grid_lg/uploads/plant/1534182890-081cbfaee66ad4ced/botanikfoto-517270-LOptimized.jpg"}, {"name": "Polygonatum odoratum 'Variegatum' (Solomon's Seal)", "desc": "Handsome and fragrant, Polygonatum odoratum 'Variegatum' (Fragrant Solomon's Seal) is a rhizomatous, shade-loving perennial with slightly arching stems covered with sweetly scented, vase-shaped, creamy-white flowers tipped with green in late spring to early summer. Gracefully hanging from the leaf axils, they are followed in fall by attractive blue-black berries.", "url": "/plant/Polygonatum-Odoratum-Variegatum-Solomons-Seal", "img_src": "/rendition.grid_lg/uploads/plant/1533819470-0f32e59e243001b46/DSC_5965-2Optimized.jpg"}, {"name": "Primula auricula 'Eden Greenfinch' (Primrose)", "desc": "Robust, Primula auricula 'Eden Greenfinch' is an evergreen, perennial, border auricula forming a rosette of pale green leaves with unusual clusters of lightly fragrant, green-tinged tawny brown flowers adorned with white centers. Borne on short stems, they are produced in mid to late spring. Hardy and easy to grow, it is perfect for the front of borders, rock gardens and containers.", "url": "/plant/Primula-auricula-Eden-Greenfinch", "img_src": "/rendition.grid_lg/uploads/plant/1541522386-d8e19d818d0784d41/70841Optimized.jpg"}, {"name": "Primula veris (Common Cowslip)", "desc": "Fragrant, with rich, sunny yellow flowers, award-winning Primula veris (Common Cowslip) is a semi-evergreen perennial favored by many gardeners with partially shaded gardens", "url": "/plant/primula-veris-common-cowslip", "img_src": "/rendition.grid_lg/uploads/plant/1540564264-e37f5507191eb0b32/shutterstock_193656473%20Optimized.jpg"}, {"name": "Prunus avium 'Rainier' (Sweet Cherry)", "desc": "Regarded by many as the best yellow cherry, Prunus avium 'Rainier' is a large and vigorous cherry tree of pyramidal habit. In mid spring, it boasts an abundance of sweetly scented white flowers clustered along the branches. They are followed by a generous crop of very large, golden-yellow cherries with a showy red blush in early summer.", "url": "/plant/Prunus-avium-Rainier", "img_src": "/rendition.grid_lg/uploads/plant/1552942625-e73f0fd4a4b18b8ef/shutterstock_649224793Optimized.jpg"}, {"name": "Prunus persica 'Reliance' (Peach)", "desc": "Noted for its cold-hardiness, Prunus persica 'Reliance ' is a vigorous and fast-growing peach tree adorned with profuse soft pink blossoms in early-mid spring. They are followed by a heavy crop of medium sized, freestone, red blushed yellow fruits in mid-late summer. The soft yellow flesh enjoys a good flavor. Perfect for eating, baking and canning. Self-pollinating", "url": "/plant/Prunus-persica-Reliance", "img_src": "/rendition.grid_lg/uploads/plant/1552936193-a512843c59d8f6a09/shutterstock_35880316Optimized.jpg"}, {"name": "Pulsatilla vulgaris (Pasque Flower)", "desc": "Award-winning Pulsatilla vulgaris (Pasque Flower) is a lovely early-blooming perennials, which bears a profusion of large, showy blossoms (2-3 in. wide or 5-7 cm) on short stems in spring. A single plant may thrust over 30 blossoms over a couple of months!", "url": "/plant/Pulsatilla-Vulgaris-Pasque-Flower", "img_src": "/rendition.grid_lg/uploads/plant/1442955769-301b8d37373c6f0f7/botanikfoto-471059-L.jpg"}, {"name": "Rhododendron 'April Rose'", "desc": "Slightly fragrant and exceptionally cold hardy, Rhododendron 'April Rose' is prized for its early spring blooms. This semi-dwarf evergreen shrub bears elegant, widely funnel-shaped, double, purplish-red flowers, up to 2 in. wide (5 cm), at the branch tips in early to mid spring.", "url": "/plant/Rhododendron-April-Rose", "img_src": "/rendition.grid_lg/uploads/plant/1445454772-4e529cd16571ceb75/Rhododendron%20April%20Rose.jpg"}, {"name": "Rhododendron 'Scintillation'", "desc": "Prized for its remarkably pretty flowers, multiple award-winning Rhododendron 'Scintillation' is a medium-sized, evergreen shrub which produces large rounded trusses of 11 to 15 soft pink flowers.", "url": "/plant/Rhododendron-Scintillation", "img_src": "/rendition.grid_lg/uploads/plant/1444854707-53c67701718f2a498/botanikfoto-490133-L.jpg"}, {"name": "Ribes uva-crispa 'Pixwell' (Gooseberry)", "desc": "Noted for its high yields, Ribes uva-crispa 'Pixwell' is a small, deciduous shrub that is vigorous and almost thornless. It boasts medium to large, tart, pink fruits which ripen in mid-summer. The gooseberries have a sweet flesh and contrasting tart skin. They are excellent for jam and desserts. This plant is self-fertile.", "url": "/plant/Ribes-uva-crispa-Pixwell", "img_src": "/rendition.grid_lg/uploads/plant/1553631231-cadfd97cc904246f5/shutterstock_57040003Optimized.jpg"}, {"name": "Rosa 'Carding Mill' (English Rose)", "desc": "An outstanding variety particularly suited to American gardening conditions, English Rose 'Carding Mill' (Auswest) features large (3in. - 7 cm), fully double, cupped blossoms (80 petals) in breathtaking shades of pink, rich apricot and soft yellow", "url": "/plant/rose-carding-mill-auswest", "img_src": "/rendition.grid_lg/uploads/plant/1542158985-86d41acba7c822a11/Carding%20Mill%20(Auswest)%20BOptimized.jpg"}, {"name": "Rosa 'Double Knock Out' (Shrub Rose)", "desc": "Blooming its heart out, Rosa 'Double Knock Out' is a compact shrub rose which produces abundant clusters of fully double, vibrant cherry-red flowers, up to 3 in. across (7 cm), packed with up to 24 petals. The blossoms do not fade in the heat and stand out against the disease-resistant, dark purplish-green foliage.", "url": "/plant/Rose-Double-Knock-Out", "img_src": "/rendition.grid_lg/uploads/plant/1516565438-359000bc0e5e4fe13/The%20Double%20Knock%20Out%20Rose%20landscapeOptimized.jpg"}, {"name": "Rosa 'Golden Gate'", "desc": "A short and upright climber, award-winning Rosa 'Golden Gate' features attractive clusters of fragrant, loosely cupped, very full (55-60 petals), semi-double flowers in the most glowing shade of golden-yellow and paling to creamy yellow as they mature. Born from pointed, ovoid buds, the blooms, 3.25 in. across (8 cm), open to reveal golden stamens and exude a pleasant citrus and fruity scent. They stand out against the foliage of large, semi-glossy, mid green, leathery leaves.", "url": "/plant/rose-Golden-Gate", "img_src": "/rendition.grid_lg/uploads/plant/1496856668-7ce6b893a0d2585af/Golden%20Gate%20select.jpg"}, {"name": "Rosa 'Magic Meidiland' (Groundcover Rose)", "desc": "Blooming its heart out, Rosa 'Magic Meidiland' is a ground-hugging, landscape rose producing large clusters of double, fuchsia pink flowers, packed with 17-25 petals. Rich a strong Lily of the Valley fragrance, they bloom continuously from spring until frost.", "url": "/plant/Rose-Magic-Meidiland", "img_src": "/rendition.grid_lg/uploads/plant/1542220841-17317eb28843bbf66/Magic%20MEIDILAND®%20Meibonrib%20(12_4081)_HDOptimized.jpg"}, {"name": "Rosa 'Princess Anne' (English Rose)", "desc": "With large clusters of bold cherry pink blossoms gradually evolving toward lovely shades of purple-lilac, Rosa 'Princess Anne' is a fabulous attraction thanks to its remarkable blooming performance throughout the season, its disease resistance and its spectacular blossoms filled with heart-shaped petals (about 85 petals) creating a pleasing ruffled effect.", "url": "/plant/rose-princess-anne-auskitchen", "img_src": "/rendition.grid_lg/uploads/plant/1542327883-22926a9259801b941/Princess%20Anne%20(Auskitchen)%20A4Optimized.jpg"}, {"name": "Rosa 'Susan Williams-Ellis' (English Rose)", "desc": "Extremely winter hardy, David Austin English Rose 'Susan Williams-Ellis' is a 'sport' of Austin's popular pink rose 'The Mayflower' which was introduced in 2001. Like its parent, this exceptional white rose enjoys a vigorous disease resistance and flowers very early in the season – two to three weeks before most other roses – and then continues to bloom nearly non-stop until frost.", "url": "/plant/rose-susan-williams-ellis-ausquirk", "img_src": "/rendition.grid_lg/uploads/plant/1542372967-8b6e0c00f87746729/David_Austin_English_Rose_Susan_Williams-EllisOptimized.jpg"}, {"name": "Rosa canina (Dog Rose)", "desc": "Tough and fast growing, Rosa canina (Dog Rose) is a vigorous, scrambling, deciduous shrub with multiple arching stems covered with stout, curved thorns and pinnately divided, serrated, mid-green leaves. In late spring to midsummer, lightly scented, pink-flushed, white flowers are produced at the end of the branches", "url": "/plant/Rosa-canina", "img_src": "/rendition.grid_lg/uploads/plant/1547500812-1be955a223d118293/shutterstock_34519018Optimized.jpg"}, {"name": "Rubus idaeus 'September' (Everbearing Raspberry)", "desc": "Vigorous and cold-hardy, Rubus idaeus 'September' (Everbearing Raspberry) is an upright, self-fruitful, thorny shrub which produces 2 crops on each cane: a light crop in early summer followed by a heavy crop in the fall. Clusters of white, rose-like flowers give way to medium to large, juicy, tart, rose-red raspberries, which are great for fresh eating, freezing, preserves and pies.", "url": "/plant/Rubus-idaeus-September", "img_src": "/rendition.grid_lg/uploads/plant/1551729956-e75c60770b62115ca/Raspberry_September_Vegetable_17718Optimized.jpg"}, {"name": "Rudbeckia laciniata 'Hortensia' (Cutleaf Coneflower)", "desc": "Introduced in the Victorian era, Rudbeckia laciniata 'Hortensia' is a tall, robust herbaceous perennial with branched stems bearing fluffy, fully double flowers, 3 in. across (7 cm), packed with golden-yellow rays.", "url": "/plant/Rudbeckia-laciniata-Hortensia", "img_src": "/rendition.grid_lg/uploads/plant/1548753006-b0a9de8c50d9e24cc/shutterstock_747749722Optimized%20Optimized.jpg"}, {"name": "Salvia nemorosa 'Bordeau Steel Blue' (Sage)", "desc": "Salvia nemorosa 'Bordeau Steel Blue' (Sage) is a compact, bushy perennial with erect spikes of icy, lavender-blue flowers appearing in late spring or early summer. Rising above a round clump of green, aromatic foliage, they last for weeks and bring strong color and form to the early summer border.", "url": "/plant/salvia-nemorosa-Bordeau-Steel-Blue", "img_src": "/rendition.grid_lg/uploads/plant/1503057521-da396bbdcf30dd06f/hr_70004288_8.jpg"}, {"name": "Sambucus nigra 'Black Lace' (Elderberry)", "desc": "Noted for its dramatic foliage, award-winning Sambucus nigra 'Black Lace' (Elderberry) is a large, upright, deciduous shrub adorned with a striking lacy foliage of deeply dissected, purple black leaves from spring to fall. In early summer, a profusion of lemon-scented umbels packed with creamy pink flowers are on display.", "url": "/plant/Sambucus-nigra-f-porphyrophylla-Eva", "img_src": "/rendition.grid_lg/uploads/plant/1542904752-0d7dc9934d0e4c3e6/Sambucus%20Black%20Lace%202_1080_1080_60Optimized.jpg"}, {"name": "Sedum 'Class Act' (Stonecrop)", "desc": "Sturdy, compact and handsome, award-winner Sedum 'Class Act' is spectacular in the late summer garden. Opening from gray-green to whitish buds, earlier than most sedums, its large flowerheads, about 4 in. wide (11 cm), are deep, burgundy red, almost ruby-pink.", "url": "/plant/sedum-Class-Act", "img_src": "/rendition.grid_lg/uploads/plant/1453669066-cfc06e76f4be8c113/Sedum_Class_Act_1b.jpg"}, {"name": "Sempervivum 'Commander Hay' (Hens and Chicks)", "desc": "Sempervivum 'Commander Hay' (Hens & Chicks) is a mat-forming succulent perennial forming attractive, evergreen rosettes, 4 in. wide (10 cm), of fleshy, purplish-red leaves adorned with pointed, bright green tips. In summer, a thick flowering stalk arises from the center of the hen rosette and bears showy starry, greenish-red flowers. Cute, but tough, this Sempervivum is tolerant of heat, drought and shade.", "url": "/plant/Sempervivum-Commander-Hay", "img_src": "/rendition.grid_lg/uploads/plant/1525265981-28a7b12a8b2e4cc7c/91449293_s.jpg"}, {"name": "Sorbus alnifolia (Korean Mountain Ash)", "desc": "An ideal specimen tree for small gardens, Sorbus alnifolia (Korean Mountain Ash) is a small, densely-branched, deciduous tree with a long season of interest. Attractive in form, elegant in flower, colorful in fruit and foliage, Sorbus alnifolia stars in almost every season of the year.", "url": "/plant/Sorbus-alnifolia-Korean-Mountain-Ash)", "img_src": "/rendition.grid_lg/uploads/plant/1498676346-f4a7c889bc3bd9008/botanikfoto-406047-L.jpg"}, {"name": "Stipa calamagrostis (Spear Grass)", "desc": "Grown for its early blooming feathery flowers, Stipa calamagrostis is a lovely and graceful free-flowering ornamental grass", "url": "/plant/stipa-calamagrostis-spear-grass", "img_src": "/rendition.grid_lg/uploads/plant/1428404358-7fd8c689a1454e502/botanikfoto-501074-L.jpg"}, {"name": "Syringa vulgaris 'Andenken an Ludwig Spath' (Lilac)", "desc": "Regarded as one of the best purple lilacs, award-winning Syringa vulgaris 'Andenken an Ludwig Spath' is an upright, deciduous shrub with slender panicles, up to 12 in. long (30 cm), packed with amazingly fragrant, single, deep wine-red flowers. Blooming in late spring, the abundant blossoms last 3-4 weeks and make a dramatic display.", "url": "/plant/Syringa-vulgaris-Andenken-an-Ludwig-Spath", "img_src": "/rendition.grid_lg/uploads/plant/1538673025-dae4a0b7445f9491a/101030690_sOptimized.jpg"}, {"name": "Syringa x hyacinthiflora 'Pocahontas' (Early Flowering Lilac)", "desc": "Noted for exceptional hardiness and vigor, award-winner Syringa x hyacinthiflora 'Pocahontas' (Early Flowering Lilac) is an upright, deciduous shrub with showy panicles packed with fragrant, single, rich violet flowers. Blooming in mid spring, about 7-10 days earlier than common lilacs, its abundant blossoms make a dramatic display.", "url": "/plant/Syringa-hyacinthiflora-Pocahontas", "img_src": "/rendition.grid_lg/uploads/plant/1538757853-d1e286c193b73278a/Syringa%20Pocahontas%201_1080_1080_60Optimized.jpg"}, {"name": "Thuja occidentalis 'Anna's Magic Ball' (American Arborvitae)", "desc": "Thuja occidentalis 'Anna's Magic Ball' (American Arborvitae) is a dwarf, evergreen shrub of compact, rounded habit with sprays of cheerful, bright yellow foliage that add year-round color to the landscape. Slow-growing, it maintains its lovely color year-round. Forming a cute little sphere, it is reliable and cold weather resistant and makes a pretty addition to perennial beds, rock gardens and containers. Perfect for small gardens!", "url": "/plant/Thuja-occidentalis-Anna-s-Magic-Ball", "img_src": "/rendition.grid_lg/uploads/plant/1526768520-37be6dac67af00670/proven_winners_thuja_annas_magic_moment_arborvitae_0Optimized.jpg"}, {"name": "Trollius chinensis 'Golden Queen' (Globe Flower)", "desc": "Glowing in the late spring to mid summer garden, Trollius chinensis 'Golden Queen' (Globe Flower) is a particularly striking perennial with attractive, long-stemmed, bowl-shaped, golden-orange flowers, 2-3 in. across (5-7 cm), resembling double buttercups.", "url": "/plant/Trollius-Chinensis-Golden-Queen-Globe-Flower", "img_src": "/rendition.grid_lg/uploads/plant/1461961585-c6b852db603e5670a/44985719_m.jpg"}, {"name": "Tulipa 'Apricot Impression' (Darwin Hybrid Tulip)", "desc": "Tulip 'Apricot Impression' always makes a sensation in the garden with its large and long-lasting tangerine-pink bloom.", "url": "/plant/tulipa-apricot-impression-darwin-hybrid-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506358735-30813ac3a4f30caad/35760.jpg"}, {"name": "Tulipa 'Blue Parrot' (Parrot Tulip)", "desc": "With its over-sized flamboyant flower head atop a tall slender stem, award-winning Tulip 'Blue Parrot' bobs and flutters like its tropical namesake", "url": "/plant/tulipa-blue-parrot-parrot-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505935907-ddca22eb505328fdd/30655.jpg"}, {"name": "Tulipa 'Couleur Cardinal' (Single Early Tulip)", "desc": "Quite short, Tulip 'Couleur Cardinal' nevertheless has a commanding presence in the early-mid spring garden with its rich, deep-red flowers with a plum blush, all set on dark sturdy stems that withstand wind and rain.", "url": "/plant/tulipa-couleur-cardinal-single-early-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505836122-b634c9ca69d56e083/Tulipa%20couleur%20cardinal.jpg"}, {"name": "Tulipa 'Fire of Love' (Greigii Tulip)", "desc": "Noted for it striking variegated foliage, Tulip 'Fire of Love' is very eye-catching with its bright red flowers held above beautifully striped leaves. Adorned with purple dots, the elegantly curled, blue-green leaves are outlined in creamy-yellow.", "url": "/plant/tulipa-Fire-of-Love-greigii-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506007658-87c30f097e97802de/9447017_m.jpg"}, {"name": "Tulipa 'Greuze' (Single Late Tulip)", "desc": "Excellent for cutting, Tulip 'Greuze' is a gorgeous tulip with large, intense, rich violet-purple blossoms. Introduced in 1891, this heirloom tulip is named after an 18th-century French painter.", "url": "/plant/tulipa-Greuze-single-late-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1502291996-bc01b4c8a152cb1fb/Tulipa%20Greuze.jpg"}, {"name": "Tulipa 'Lilac Perfection' (Double Late Tulip)", "desc": "Enormous double lilac flowers! Tulip 'Lilac Perfection' bears a densely-packed bowl of large lilac-purple petals and looks almost like a rose with its double set of petals.", "url": "/plant/tulipa-lilac-perfection-double-late-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505863411-88a7c83616c9d72f7/22142.jpg"}, {"name": "Tulipa 'Orange Angelique' (Double Late Tulip)", "desc": "Will Tulip 'Orange Angelique' become America's favorite like its cousin Tulip 'Angelique'? Highly probable.", "url": "/plant/tulipa-orange-angelique-double-late-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505863899-96101097cd10e0ca7/0266769.jpg"}, {"name": "Tulipa 'Queensland' (Fringed Tulip)", "desc": "Exceptionally pretty and long-lasting, Tulip 'Queensland' is a fabulous double flowering tulip variety full of reddish-pink ruffled flowers with finely incised white edges atop broad lance-shaped leaves", "url": "/plant/tulipa-queensland-fringed-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506019570-40d35a2e2e7c5253f/Tulip%20Queensland.jpg"}, {"name": "Tulipa 'Swan Wings' (Fringed Tulip)", "desc": "Resembling unfurling swan's wings. Tulip 'Swan Wings' is a lovely tulip exhibiting pure white flowers delicately fringed at the end like the immaculate feathers of a swan. As an added bonus, it is fragrant", "url": "/plant/tulipa-swan-wings-fringed-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506021604-b8b32cf56c9dc0ba4/78176891_m.jpg"}, {"name": "Tulipa batalinii 'Bright Gem' (Botanical Tulip)", "desc": "A charmingly true and perennial tulip, Tulip 'Bright Gem' is an adorable little tulip with sulphur yellow, rounded flowers delicately flushed with apricot.", "url": "/plant/tulipa-batalinii-bright-gem-botanical-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506370245-7b8c5aa54a5ad79a3/Tulipa%20batalinii%20Bright%20GemOptimized.jpg"}, {"name": "Vaccinium corymbosum 'Duke' (Highbush Blueberry)", "desc": "Vaccinium corymbosum 'Duke' is a bushy upright deciduous shrub, with small oval dark green leaves turning attractive shades of yellow and orange in the fall. While blooming late in the season, the fruits ripen early. The advantage of this is that the blossoms will not be damaged by late spring frost. Dainty, waxy, bell-shaped, white flowers give way to medium to large, firm, light blue blueberries which ripen in early summer. The berries have a mildly sweet flavor", "url": "/plant/Vaccinium-Duke", "img_src": "/rendition.grid_lg/uploads/plant/1551545986-a54fe25d2c556ffc1/Blueberry_Duke_Vegetable_17352Optimized.jpg"}, {"name": "Verbena 'Superbena Violet Ice'", "desc": "Noted for its vigor, heat, drought and mildew tolerance, Verbena 'Superbena Violet Ice' is a trailing Verbena with masses of large clusters of rich violet flowers over a long season. Blooming continuously from summer to frost, the blossoms are so profuse that they literally smother the foliage of oval, toothed, mint-like leaves, creating an endless floral carpet.", "url": "/plant/verbena-Superbena-Violet-Ice", "img_src": "/rendition.grid_lg/uploads/plant/1522948656-73a356343cf000ec0/Verbena%20Superbena%20Violet%20IceOptimized.jpg"}, {"name": "Viburnum carlesii 'Spice Baby' (Koreanspice Viburnum)", "desc": "Ideal for small gardens, Viburnum carlesii 'Spice Baby' (Koreanspice Viburnum) is a dwarf, bushy, deciduous shrub with a profusion of large flower clusters that perfume the garden with their sweet, spicy fragrance in spring. Opening from red flower buds, pale pink flowers arranged in snowball clusters gradually fade to white as they mature. Elegantly held above the foliage, they are followed by bright red berries, borne in dense upward clusters. The foliage of broadly ovate, dark green leaves turns glorious red shades in fall.", "url": "/plant/Viburnum-Carlesii-Spice-Baby", "img_src": "/rendition.grid_lg/uploads/plant/1531405873-d2d483f88c83b4d44/spice_ball_viburnum-0670Optimized.jpg"}, {"name": "Vinca minor 'Bowles's Variety' (Periwinkle)", "desc": "Award-winning Vinca minor 'Bowles's Variety' (Periwinkle) is a vigorous, evergreen mat-forming perennial with glossy dark green leaves and large violet-blue flowers from mid-spring to early summer. Borne over a long period, they continue to flower intermittently throughout summer into fall and are valuable for enlivening dark areas.", "url": "/plant/Vinca-minor-Bowles-Variety-Periwinkle", "img_src": "/rendition.grid_lg/uploads/plant/1502390838-96255f1857ee9e232/82857112_m.jpg"}, {"name": "Vitis 'King of the North' (Grape Vine)", "desc": "Cold-hardy, Vitis 'King of the North' is a Labrusca grape variety boasting large clusters of medium to small, dark blue berries in early fall. Juicy and tart, it is perfect for juice, jelly or eating fresh. A very vigorous deciduous shrub, 'King of the North' is self-pollinating, productive and highly disease resistant.", "url": "/plant/Vitis-King-of-the-North", "img_src": "/rendition.grid_lg/uploads/plant/1553691814-b688c0578793156b7/shutterstock_311566949Optimized.jpg"}, {"name": "Wisteria floribunda 'Alba' (White Japanese Wisteria)", "desc": "A famous Wisteria variety that can be admired on the Japanese Bridge, in Claude Monet's garden in Giverny, France. Wisteria floribunda 'Alba' is a beautiful white flowered Japanese Wisteria with very long clusters, up to 24 in. long (60 cm), of pea-like, fragrant white flowers.", "url": "/plant/Wisteria-Floribunda-Alba-White-Japanese-Wisteria", "img_src": "/rendition.grid_lg/uploads/plant/1466091797-6f0d82a8e163210d5/49297594_m.jpg"}, {"name": "Zinnia 'Benary's Giant Wine'", "desc": "Zinnia 'Benary's Giant Wine' features rounded, fully double flowers packed with rich wine-red petals and opening up to 6 in. across (15 cm). As the flower matures, a circle of small golden stars surrounds its center disk. Resembling dahlias, they are borne on very long, sturdy stems and make a big statement in the landscape.", "url": "/plant/zinnia-Benarys-Giant-Wine", "img_src": "/rendition.grid_lg/uploads/plant/1551038038-41216eaf97d5f2c35/Zinnia_Benary_Giant_Wine_Container_18100Optimized.jpg"}, {"name": "Zinnia haageana 'Soleado'", "desc": "Zinnia haageana 'Soleado' features small single golden-orange flowers adorned with paler golden edges and a contrasting reddish-brown ring. They are borne on sturdy stems and make a big statement in the landscape. Blooming profusely over a lengthy season extending from midsummer to frost, this Zinnia is a vigorous and excellent performer in all climates.", "url": "/plant/zinnia-haageana-Soleado", "img_src": "/rendition.grid_lg/uploads/plant/1521668301-328e647af74aa1a32/Zinnia-haageana-SoleadoOptimized.jpg"}]