[{"name": " Salvia azurea var. grandiflora (Pitcher Sage)", "desc": "Salvia azurea var. grandiflora (Pitcher Sage) is a clump-forming, shrubby perennial with beautiful wands of sky blue flowers, up to 12 in. long (30 cm). Blooming from midsummer to frost, the elegant flowering wands are borne on slender stems clad with long, narrow, grayish-green leaves. Hardy, this Salvia enjoys an upright habit until midsummer, but will sprawl over nearby plants when it begins to bloom.", "url": "/plant/Salvia-azurea-var-grandiflora", "img_src": "/rendition.grid_lg/uploads/plant/1522776276-a015c4ee3fe2112fe/botanikfoto-548152-LOptimized.jpg", "img_nm": "SalviaazureavargrandifloraPitcherSage.jpg"}, {"name": "Acer palmatum 'Arakawa' (Japanese Maple)", "desc": "Noted for its remarkable bark, Acer palmatum 'Arakawa' is a vigorous deciduous tree of upright habit, adorned with a delicate foliage of palmate leaves, each adorned with 5-7 slender tipped lobes. Emerging fresh green in spring, the foliage retains its color throughout the summer before gradually changing to brilliant golden-yellow in the fall. On mature specimens (3-5 year old), the bark gets rough and corky, with creases, cracks and fissures, providing year round ornamental interest. A very interesting Japanese maple that is perfect for bonsai use and for the landscape.", "url": "/plant/Acer-palmatum-Arakawa", "img_src": "/rendition.grid_lg/uploads/plant/1537900449-970cfb2c084679b30/Acer%20palmatum%20ArakawaOptimized.jpg", "img_nm": "AcerpalmatumArakawaJapaneseMaple.jpg"}, {"name": "Achillea 'Inca Gold' (Yarrow)", "desc": "Achillea 'Inca Gold' has become a favorite of designers with its masses of long-lasting clusters of vibrant orange flowers delicately fading to gold bronze as they mature.", "url": "/plant/achillea-inca-gold-yarrow", "img_src": "/rendition.grid_lg/uploads/plant/1505306986-132013fd3b82977eb/59724989_m.jpg", "img_nm": "AchilleaIncaGoldYarrow.jpg"}, {"name": "Aeonium canariense (Canary Island Aeonium)", "desc": "Aeonium canariense is an impressive evergreen succulent with large velvety rosettes, 6-12 in. across (15-30 cm), of fleshy leaves. Fresh green when grown in part shade, the soft, fuzzy leaves become tinged with reddish pink when exposed to the sun.", "url": "/plant/Aeonium-canariense", "img_src": "/rendition.grid_lg/uploads/plant/1483717927-71665357477b3c39b/17727649_m.jpg", "img_nm": "AeoniumcanarienseCanaryIslandAeonium.jpg"}, {"name": "Agapanthus comptonii 'Headbourne Hybrids' (African Lily)", "desc": "Among the hardiest Lilies of the Nile, award-winning Agapanthus 'Headbourne Hybrids' produces large rounded clusters, 3-4 in. wide (7-10 cm), of funnel-shaped flowers in variable shades of light and dark violet-blue.", "url": "/plant/agapanthus-Headbourne-Hybrids", "img_src": "/rendition.grid_lg/uploads/plant/1546641800-a9dc85d09313f0a47/12830018_mOptimized.jpg", "img_nm": "AgapanthuscomptoniiHeadbourneHybridsAfricanLily.jpg"}, {"name": "Agave 'Joe Hoak'", "desc": "Incredibly pretty, Agave 'Joe Hoak' is an evergreen succulent perennial which produces striking rosettes of gracefully curving leaves, delicately striated with pale gray-green and cream, and adorned with a terminal reddish-brown spine.", "url": "/plant/Agave-Joe-Hoak", "img_src": "/rendition.grid_lg/uploads/plant/1484587293-190a47e3cb68d0a24/Agave%20desmettiana%20‘Joe%20Hoak’.jpg", "img_nm": "AgaveJoeHoak.jpg"}, {"name": "Agave univittata 'Quadricolor'", "desc": "An exquisite small Agave, Agave univittata 'Quadricolor' is a highly ornamental evergreen succulent forming colorful rosettes of toothed, strikingly-striped leaves about 6-12 in. long (15-30 cm). Dark green in their center, the leaves are adorned with a pale green midstripe and golden-yellow edges, which are lined with a row of dark reddish teeth.", "url": "/plant/Agave-univittata-Quadricolor", "img_src": "/rendition.grid_lg/uploads/plant/1484140804-7cb3b7fd802c009dd/Agave%20lophantha%20‘Quadricolor’.jpg", "img_nm": "AgaveunivittataQuadricolor.jpg"}, {"name": "Alcea rosea 'Spring Celebrities White' (Hollyhock)", "desc": "Noted for its shorter stature, Alcea rosea 'Spring Celebrities White' (Hollyhock) is a short-lived perennial which produces sturdy spikes of large, double, pristine white flowers. Blooming from mid to late summer, the striking flowers are arranged all round the spike and bloom from the bottom up. An old garden favorite, this hollyhock is perfect for the sunny border or containers. Great for small gardens too!", "url": "/plant/Alcea-rosea-Spring-Celebrities-White", "img_src": "/rendition.grid_lg/uploads/plant/1518193664-11278f915d776a27e/Alcea-Spring-Celebrities-White-FlowerOptimized.jpg", "img_nm": "AlcearoseaSpringCelebritiesWhiteHollyhock.jpg"}, {"name": "Alliums (Ornamental Onions)", "desc": "Alliums are plants of exquisite beauty that deserve a place in perennial gardens. Easy to grow and undemanding, these very ornamental bulbs distinguish themselves by their great diversity in color, inflorescence, flowering height and bloom times. Many species bloom in early summer - just after the spring-flowering period and just before the exuberant full bloom of summer.", "url": "/plant-variety/alliums", "img_src": "/rendition.grid_lg/uploads/plant_family/1506430772-cdfdc46deb9120e9b/44693Optimized.jpg", "img_nm": "AlliumsOrnamentalOnions.jpg"}, {"name": "Aloe vaombe (Malagasy Tree Aloe)", "desc": "One of the showiest of the tall Aloes, Aloe vaombe (Malagasy Tree Aloe) is a large evergreen succulent perennial forming a beautiful solitary rosette of curved, long, shiny, dark rich green leaves. The fleshy leaves are adorned with white teeth and turn vibrant deep red in winter or with bright exposure.", "url": "/plant/Aloe-vaombe-Malagasy-Tree-Aloe", "img_src": "/rendition.grid_lg/uploads/plant/1488148761-c25932ec3f06db395/Aloe%20vaombe2.jpg", "img_nm": "AloevaombeMalagasyTreeAloe.jpg"}, {"name": "Alstroemeria aurea (Peruvian Lily)", "desc": "One of the hardiest Peruvian Lilies, Alstroemeria aurea is a tuberous perennial with terminal clusters of small, brilliant orange or golden-yellow, orchid-like flowers, often adorned with spotting and streaking.", "url": "/plant/Alstroemeria-Aurea-Peruvian-Lily", "img_src": "/rendition.grid_lg/uploads/plant/1548338846-70209735885e28729/shutterstock_711549481%20Optimized.jpg", "img_nm": "AlstroemeriaaureaPeruvianLily.jpg"}, {"name": "Amaryllis 'Elvas' (Hippeastrum)", "desc": "Amaryllis, 'Elvas' (Hippeastrum) is a graceful beauty with its exquisite, pure white, double flowers, up to 5-6 in. across (12-15 cm), packed with up to 15 tepals adorned with a delicate, red picotee.", "url": "/plant/amaryllis-Elvas", "img_src": "/rendition.grid_lg/uploads/plant/1535349649-c810990a171aa9d60/TG100209%20Optimized.jpg", "img_nm": "AmaryllisElvasHippeastrum.jpg"}, {"name": "Amaryllis 'Quito' (Hippeastrum)", "desc": "Amaryllis 'Quito' is truly graceful and eye-catching with spidery, frilly edged, cherry-red upper petals contrasting with its pale green and vanilla lower petals. Floriferous, with tall, stout scapes and long-lasting blooms, up to 9 in. across (23 cm), it makes wonderful cut flowers.", "url": "/plant/amaryllis-Quito", "img_src": "/rendition.grid_lg/uploads/plant/1532951060-ac2ca429acd4104a9/100947268_s%20Optimized.jpg", "img_nm": "AmaryllisQuitoHippeastrum.jpg"}, {"name": "Amsonia tabernaemontana (Blue Star)", "desc": "Selected by the American Horticultural Society as one of the 75 Great Plants for American Gardens, Amsonia tabernaemontana (Blue Star) is an exceptional perennial with early-season blue flowers, attractive summer foliage, a sturdy habit and golden fall color.", "url": "/plant/amsonia-tabernaemontana-blue-star", "img_src": "/rendition.grid_lg/uploads/plant/1431462434-80ac6ac7e12bc4ad7/botanikfoto-460160-L.jpg", "img_nm": "AmsoniatabernaemontanaBlueStar.jpg"}, {"name": "Aquilegia Songbird 'BlueBird' (Columbine)", "desc": "Very eye-catching with its long-spurred, blue and white bicolor flowers, up to 3 in. long (7 cm), rising with natural grace above a lovely fern-like, gray-green foliage", "url": "/plant/aquilegia-songbird-bluebird-columbine", "img_src": "/rendition.grid_lg/uploads/plant/1430396842-4ac40b1f0d069f047/AQUSONBLBI.jpg", "img_nm": "AquilegiaSongbirdBlueBirdColumbine.jpg"}, {"name": "Asclepias fascicularis (Narrowleaf Milkweed)", "desc": "Asclepias fascicularis (Narrowleaf Milkweed) is a flowering perennial boasting attractive clusters, 4-5 in. across (10-12 cm), of lavender and white, starry flowers from early summer to fall. The flowers are a great source of nectar for butterflies, hummingbirds, bees, and other beneficial insects.", "url": "/plant/Asclepias-fascicularis", "img_src": "/rendition.grid_lg/uploads/plant/1545409692-5cc04b082b9f1a904/shutterstock_690317371Optimized.jpg", "img_nm": "AsclepiasfascicularisNarrowleafMilkweed.jpg"}, {"name": "Astilbe 'Granat' (Arendsii Hybrid)", "desc": "A very popular tall cultivar, Astilbe 'Granat' is an eye-catching cultivar that sizzles in the sun and glows in the shade.", "url": "/plant/astilbe-granat-arendsii-hybrid", "img_src": "/rendition.grid_lg/uploads/plant/1430241895-7f777d307da1ca9f2/botanikfoto-473322-L.jpg", "img_nm": "AstilbeGranatArendsiiHybrid.jpg"}, {"name": "Baptisia 'Lemon Meringue' (False Indigo)", "desc": "Very floriferous, Baptisia 'Lemon Meringue' (False Indigo) is an upright, densely branched perennial bearing sturdy spikes of pea-shaped, bright sunshine-yellow flowers in late spring to early summer. Lasting for three weeks, the floral display is quite impressive with the dark gray stems contrasting and accentuating the golden blossoms.", "url": "/plant/Baptisia-Lemon-Meringue-False-Indigo", "img_src": "/rendition.grid_lg/uploads/plant/1518631425-77690d34df9d4db75/Baptisia%20'Lemon%20Meringue'2Optimized.jpg", "img_nm": "BaptisiaLemonMeringueFalseIndigo.jpg"}, {"name": "Begonia 'Hanging Basket Salmon'", "desc": "Free-flowering, Begonia 'Hanging Basket Salmon' is a tuberous perennial boasting attractive cascades of extra-large, 2-5 in. across (5-12 cm), fully double, brilliant salmon-coral flowers. Blooming profusely from late spring to frost, they dangle with elegance from arching stems bearing green fleshy leaves adorned with serrated edges.", "url": "/plant/Begonia-Hanging-Basket-Salmon", "img_src": "/rendition.grid_lg/uploads/plant/1544262581-499a337d4be913d18/Begonia_Sun_Dancer_Salmon_Basket_24090%20Optimized.jpg", "img_nm": "BegoniaHangingBasketSalmon.jpg"}, {"name": "Begonia boliviensis 'Bonfire'", "desc": "A favorite of many for its spectacular display, award-winning Begonia 'Bonfire' (Begonia boliviensis) produces masses of vivid, reddish orange blossoms held on bright red stems amongst a delicately pink-edged green foliage. It is perfect for vertical gardens with its eye-catching and elegant cascades of fiery red, elongated flowers resembling fuchsias.", "url": "/plant/begonia-boliviensis-bonfire", "img_src": "/rendition.grid_lg/uploads/plant/1518122216-88ef561bf54fe2a10/206031Optimized.jpg", "img_nm": "BegoniaboliviensisBonfire.jpg"}, {"name": "Brugmansia 'Frosty Pink' (Angel's Trumpet)", "desc": "Brugmansia 'Frosty Pink' (Angel's Trumpet) is a tropical shrub or small tree laden with huge, pendulous, trumpet-shaped, salmon-pink flowers, 8-10 in. long (20-25 cm). Blooming from midsummer to fall, the blossoms actively open and close depending on the time of day.", "url": "/plant/Brugmansia-Frosty-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1545672509-26a4af96e375a36c3/shutterstock_273893021Optimized.jpg", "img_nm": "BrugmansiaFrostyPinkAngelsTrumpet.jpg"}, {"name": "Caladium 'Candidum' (Angel Wings)", "desc": "Prized for its highly decorative leaves, Caladium 'Candidum' (Angel Wings) is a tuberous perennial with lush, heart-shaped, white leaves adorned with striking dark green veins. Inconspicuous, calla-type flowers appear in summer, but they are usually hidden by the leaves. Glowing in full shade, this luminous foliage plant is terrific to add color and drama to shady borders and containers. It also makes an excellent houseplant.", "url": "/plant/Caladium-Candidum-Angel-Wings", "img_src": "/rendition.grid_lg/uploads/plant/1547996693-9284e97f98e291d39/shutterstock_42753058Optimized.jpg", "img_nm": "CaladiumCandidumAngelWings.jpg"}, {"name": "Camellia 'Polar Ice'", "desc": "Gracing the garden in fall and winter, Camellia 'Polar's Ice' is an eye-catching early season camellia from the U.S. National Arboretum Collection. Tough and reliable, this evergreen camellia can be successfully grown in regions as cold as USDA Zone 6b.", "url": "/plant/Camellia-Polar-Ice", "img_src": "/rendition.grid_lg/uploads/plant/1438256334-51a9b733308cbeeff/Polar-Ice.jpg", "img_nm": "CamelliaPolarIce.jpg"}, {"name": "Camellia japonica 'Desire'", "desc": "Vigorous and incredibly beautiful, Camellia japonica 'Desire' features large, 4 in. wide (10), formal double flowers, counting up to 60 petals. The pure white to pale blush pink petals are delicately edged with deeper pink.", "url": "/plant/Camellia-Japonica-Desire", "img_src": "/rendition.grid_lg/uploads/plant/1439409095-7a2ca093a2a12a437/Desire.jpg", "img_nm": "CamelliajaponicaDesire.jpg"}, {"name": "Camellia sasanqua 'Setsugekka'", "desc": "Vigorous and elegant, Camellia sasanqua 'Setsugekka' is beloved for its large, 4 in. wide (10 cm), sparkling white, semi-double flowers. The petals are strongly undulated and crimped. A boss of golden stamens crowns the heart of the flower.", "url": "/plant/Camellia-Sasanqua-Setsugekka", "img_src": "/rendition.grid_lg/uploads/plant/1480542844-0526e61ce257e7521/Setsugekka.jpg", "img_nm": "CamelliasasanquaSetsugekka.jpg"}, {"name": "Campsis radicans (Trumpet Vine)", "desc": "A vigorous North American native, Campsis radicans (Trumpet Vine) is a self-clinging woody climber with particularly showy trumpet-shaped flowers in bright shades of orange or red.", "url": "/plant/Campsis-Radicans-Trumpet-Vine", "img_src": "/rendition.grid_lg/uploads/plant/1464971189-d59e0acf50d467b94/17102895_m.jpg", "img_nm": "CampsisradicansTrumpetVine.jpg"}, {"name": "Canna 'Phasion' (Canna Lily)", "desc": "Noted for its outrageously colored foliage, award-winning Canna 'Phasion' produces large, vibrant orange flowers atop erect flowering stalks. They stand out against the dramatic foliage of large, lance-shaped, deep purple leaves, adorned with strawberry-pink veins and fading to orange.", "url": "/plant/canna-Phasion-canna-lily", "img_src": "/rendition.grid_lg/uploads/plant/1510145855-ea11c46e5c695d4c4/7664861676_077c9b0496_kOptimized.jpg", "img_nm": "CannaPhasionCannaLily.jpg"}, {"name": "Carex comans 'Frosted Curls' (New Zealand Hair Sedge)", "desc": "One of the most striking New Zealand Hairy Sedge, Carex comans 'Frosted Curls' is a very distinctive ornamental grass with pale silvery green grasslike leaves that curl gracefully towards the ground, delicately softening any landscape", "url": "/plant/carex-comans-frosted-curls-new-zealand-hair-sedge", "img_src": "/rendition.grid_lg/uploads/plant/1479829136-9f3586390a3b06c2d/carex-comans-frosted-curls-1.jpg", "img_nm": "CarexcomansFrostedCurlsNewZealandHairSedge.jpg"}, {"name": "Caryopteris x clandonensis 'Kew Blue' (Bluebeard)", "desc": "Caryopteris x clandonensis 'Kew Blue' (Bluebeard) is a compact, deciduous shrub of rounded habit with a profusion of dark blue flowers in late summer and early fall. Attractive to butterflies, bees and other beneficial insects, they contrast nicely with the dense foliage of small, narrowly oval, gray-green, aromatic leaves. Valued for its late season blossoms when few other shrubs are in bloom, this easy care shrub is a superb addition to any sunny garden.", "url": "/plant/Caryopteris-x-clandonensis-Kew-Blue", "img_src": "/rendition.grid_lg/uploads/plant/1538078977-b355023f1a88921f6/caryopteris-clandonensis-kew-blueOptimized.jpg", "img_nm": "CaryopterisxclandonensisKewBlueBluebeard.jpg"}, {"name": "Cedrus deodara 'Feelin’ Blue' (Deodar Cedar)", "desc": "Cedrus deodara 'Feelin' Blue' (Deodar Cedar) is a dwarf evergreen conifer of spreading habit adorned with arching branches covered with long, thick, bright blue-green needles. One of the lowest of the dwarf Cedars, it rarely develops a leader. A moderate grower, 6-8 in. per year (15-20 cm), this Deodar Cedar can be staked to form a small tree with gracefully arching branches or can be left to grow as a groundcover on banks and slopes or cascading off containers and retaining walls. A magnificent specimen for smaller spaces, rock gardens.", "url": "/plant/Cedrus-deodara-Feelin-Blue", "img_src": "/rendition.grid_lg/uploads/plant/1534857429-015f6cb7ad53da045/botanikfoto-471372-LOptimized.jpg", "img_nm": "CedrusdeodaraFeelinBlueDeodarCedar.jpg"}, {"name": "Chaenomeles speciosa 'Moerloosei' (Japanese Quince)", "desc": "Chaenomeles speciosa 'Moerloosei' (Japanese Quince) is a spreading medium-sized deciduous shrub with abundant clusters of apple blossom pink and white blooms, up to 1.5 in. across (3-4 cm). Borne on thorny, tangled branches before the glossy, dark green leaves appear, they bloom in profusion for a few weeks in early spring, creating a brilliant floral display", "url": "/plant/Chaenomeles-speciosa-Moerloosei-Japanese-Quince", "img_src": "/rendition.grid_lg/uploads/plant/1548017574-6d8ab3b826516268d/shutterstock_623014610Optimized.jpg", "img_nm": "ChaenomelesspeciosaMoerlooseiJapaneseQuince.jpg"}, {"name": "Chrysanthemum 'Overture'", "desc": "Adding brilliance in the late season garden, Chrysanthemum 'Overture' is a hardy garden mom featuring profuse sprays of rich russet red, daisy-like flowers, adorned with a bright golden center. The blossoms fade to terra cotta as the season progresses. Blooming from late summer to late fall, the multibranched stems are covered with flowers which stand out against the green foliage.", "url": "/plant/Chrysanthemum-Overture", "img_src": "/rendition.grid_lg/uploads/plant/1523040105-ec4c096d7e8bdde6a/Chrysanthemum%20'Overture'Optimized.jpg", "img_nm": "ChrysanthemumOverture.jpg"}, {"name": "Clematis 'Apple Blossom'", "desc": "One of the most popular evergreen clematis, award-winning Clematis 'Apple Blossom' is a very large climber with masses of delightful, almond-scented flowers, 2 in. across (5 cm), and a splendid foliage. Opening from nearly red buds, the single flowers gradually fade from pale pink to white as they mature.", "url": "/plant/Clematis-Apple-Blossom", "img_src": "/rendition.grid_lg/uploads/plant/1492806737-99608f6f5c74dddf5/36370cv.jpg", "img_nm": "ClematisAppleBlossom.jpg"}, {"name": "Clematis 'Fond Memories' (Late Large-Flowered Clematis)", "desc": "Very free-flowering, Clematis 'Fond Memories' produces an abundance of fabulously elegant flowers with pale creamy-white sepals delicately edged with a pencil line of deep rosy-lavender. Adorned with deep red-purple anthers, the huge flowers, up to 7 in. across (18 cm), have a charming satin sheen. The undersides of the unfurling sepals are a very deep rosy-lavender, providing additional complimentary details.", "url": "/plant/clematis-Fond-Memories", "img_src": "/rendition.grid_lg/uploads/plant/1492104825-349e36b26cb2c34de/30395.jpg", "img_nm": "ClematisFondMemoriesLateLargeFloweredClematis.jpg"}, {"name": "Clematis 'Madame Julia Correvon' (Viticella Group)", "desc": "Consistently holding its intense, bright red color, award-winning Clematis 'Madame Julia Correvon' produces masses of distinctive, wine red, star-shaped flowers, up to 5 in. wide (12 cm), adorned with a creamy-yellow boss of stamens. Opening from elegant slender buds, each flower bears 4 to 6 tepals which open flat, but gradually recurve or gracefully twist, giving a wonderful sense of motion and life to the floral display.", "url": "/plant/clematis-Madame-Julia-Correvon", "img_src": "/rendition.grid_lg/uploads/plant/1492441674-5ed05e547a1cd7da6/60127.jpg", "img_nm": "ClematisMadameJuliaCorrevonViticellaGroup.jpg"}, {"name": "Clematis 'Victoria' (Late Large-Flowered Clematis)", "desc": "A sterling performer, Clematis 'Victoria' is a strong-growing large-flowered hybrid, which produces a profusion of rosy lavender flowers, 6 in. across (15 cm), adorned with rose-pink centers and surrounding a central boss of white filaments, and pale purplish-brown anthers.", "url": "/plant/clematis-Victoria", "img_src": "/rendition.grid_lg/uploads/plant/1492189177-2131bea7be1bfd8c0/Clematis%20Victoria.jpg", "img_nm": "ClematisVictoriaLateLargeFloweredClematis.jpg"}, {"name": "Clematis paniculata (Sweet Autumn Clematis)", "desc": "Sweetly scented, Clematis paniculata (Sweet Autumn Clematis) is a very large deciduous climber with masses of starry creamy-white flowers, 1 in. across (2.5 cm), from late summer to fall. The blossoms are so profuse that they generally cover the leathery dark green leaves. Their delightful fragrance, a mixture of sugar, honey, and vanilla, fills the air as you pass by.", "url": "/plant/Clematis-paniculata", "img_src": "/rendition.grid_lg/uploads/plant/1517401190-365a0ab260bda5f3a/67978250_m%20Optimized.jpg", "img_nm": "ClematispaniculataSweetAutumnClematis.jpg"}, {"name": "Colocasia esculenta 'Illustris' (Taro)", "desc": "Primarily grown for its spectacular foliage, Colocasia esculenta 'Illustris' (Taro) is a tuberous, frost-tender  perennial with huge, long-stalked, heart-shaped, blackish purple leaves adorned with dramatic bright green veins. The giant leaves can measure up to 3 ft. long (90 cm).", "url": "/plant/Colocasia-esculenta-Illustris", "img_src": "/rendition.grid_lg/uploads/plant/1550597522-ba6132f6026f90b1d/Colocasia%20IllustrisOptimized.jpg", "img_nm": "ColocasiaesculentaIllustrisTaro.jpg"}, {"name": "Coreopsis 'Sienna Sunset' (Tickseed)", "desc": "Hardy and highly floriferous, Coreopsis 'Sienna Sunset' is a charming perennial forming a compact mound of finely divided, threadleaf-type, deep green foliage. Blooming profusely from early through late summer, it gets covered with large, daisy-like flowers in ravishing shades of warm apricot overlaid with burnt sienna. As they age, the flowers fade to rich salmon.", "url": "/plant/Coreopsis-Sienna-Sunset-Tickseed", "img_src": "/rendition.grid_lg/uploads/plant/1515782080-dda890ac00bcf9909/Coreopsis%20'Sienna%20Sunset'Optimized.jpg", "img_nm": "CoreopsisSiennaSunsetTickseed.jpg"}, {"name": "Cosmos bipinnatus 'Antiquity'", "desc": "Cosmos bipinnatus 'Antiquity' has been awarded the Fleuroselect Novelty Award for its early flowering and unique color", "url": "/plant/cosmos-bipinnatus-antiquity", "img_src": "/rendition.grid_lg/jardin/images/main_picture_52601110ec412.jpg", "img_nm": "CosmosbipinnatusAntiquity.jpg"}, {"name": "Crocosmia 'Bright Eyes'", "desc": "Free-flowering, Crocosmia 'Emberglow' features clumps of erect, bright green, sword-shaped leaves and vibrant sprays of star-like, upward-facing flowers of deep scarlet", "url": "/plant/crocosmia-Bright-Eyes", "img_src": "/rendition.grid_lg/uploads/plant/1454026578-ec974fd802e972b5e/Crocosmia%20'Bright%20Eyes'%203.jpg", "img_nm": "CrocosmiaBrightEyes.jpg"}, {"name": "Dahlia 'Alfred Grille'", "desc": "Such a fabulous cocktail of color! Dahlia 'Alfred Grille' makes quite an impression on onlookers with its profusion of spectacular salmon pink flowers blending to gold at their heart.", "url": "/plant/dahlia-alfred-grille", "img_src": "/rendition.grid_lg/uploads/plant/1426338493-66e1670033e02bf1a/77306.jpg", "img_nm": "DahliaAlfredGrille.jpg"}, {"name": "Dahlia 'Duet'", "desc": "Dahlia 'Duet' produces profuse and spectacular bicolor flowers, an elegant mix of dark wine toward their heart against crisp white at their tips. The fully double flowers, up to 6-8 in. wide (15-20 cm), are borne atop strong stems from summer to frost and provide an amazing focal point in the garden or in a vase. This dahlia grows up to 32-36 in. tall (80-90 cm) and is an excellent choice to create a lovely garden display or for showing.", "url": "/plant/dahlia-duet", "img_src": "/rendition.grid_lg/uploads/plant/1517874477-60b4d551ea504319e/Dahlia%20Duet%20HiOptimized.jpg", "img_nm": "DahliaDuet.jpg"}, {"name": "Dahlia 'Gerrie Hoek'", "desc": "Dahlia 'Gerrie Hoek's profusion of spectacular, soft pink flowers set against its dark green foliage will steal your heart!", "url": "/plant/dahlia-gerrie-hoek", "img_src": "/rendition.grid_lg/uploads/plant/1450630588-2fd1ebc36de284373/45359643_m.jpg", "img_nm": "DahliaGerrieHoek.jpg"}, {"name": "Dahlia 'Karma Bon Bini'", "desc": "Try tearing your eyes away from Dahlia Karma Bon Bini's profusion of spectacular, glowing orange-red flowers with a golden heart!", "url": "/plant/dahlia-karma-bon-bini", "img_src": "/rendition.grid_lg/uploads/plant/1426342706-ee4e6bb159b1f4fe2/77691.jpg", "img_nm": "DahliaKarmaBonBini.jpg"}, {"name": "Dahlia 'Melody Gipsy'", "desc": "Dahlia 'Melody Gipsy' is a magnificent member of the brilliant Melody collection with its masses of showy, semi-double, bright pink flowers delicately exhibiting their creamy-yellow centers.", "url": "/plant/dahlia-melody-gipsy", "img_src": "/rendition.grid_lg/uploads/plant/1427109973-78c51bd6eb012fc23/77571.jpg", "img_nm": "DahliaMelodyGipsy.jpg"}, {"name": "Dahlia 'Purple Gem'", "desc": "Dahlia 'Purple Gem' is a magnificent and eye-catching dahlia with rich-purple, cactus-shaped blossoms, adorned with elongated petals. When the light hits the blooms, they shimmer and it is bedazzling to behold. The flowers are quite spectacular, about 5 in. across (12 cm), and absolutely irresistible.", "url": "/plant/dahlia-Purple-Gem", "img_src": "/rendition.grid_lg/uploads/plant/1517949042-2a545e8dbb0f4af13/201395%20Dahlia%20Purple%20GemOptimized.jpg", "img_nm": "DahliaPurpleGem.jpg"}, {"name": "Delosperma 'Jewel of the Desert Garnet' (Ice Plant)", "desc": "Almost ever-blooming, Delosperma 'Jewel of Desert Garnet' (Ice Plant) is a vigorous, mat-forming, evergreen succulent with a profusion of brightly colored, daisy-like flowers, 2 in. wide (5 cm). Blooming from late spring to the first frost, the blossoms are an incredible mix of brilliant scarlet and lavender petals with a central white eye.", "url": "/plant/Delosperma-Jewel-of-the-Desert-Garnet-Ice-Plant", "img_src": "/rendition.grid_lg/uploads/plant/1511300170-2b33b638643958885/Delosperma%20Jewel%20of%20Desert%20-%20Garnet%20(5)Optimized.jpg", "img_nm": "DelospermaJeweloftheDesertGarnetIcePlant.jpg"}, {"name": "Dianthus 'Fizzy' (Pink)", "desc": "One of the earliest and longest flowering, Dianthus 'Fizzy' (Pink) is a charming evergreen perennial with masses of wonderfully scented, double, lavender flowers adorned with serrated edges and deep purple centers. Blooming in early to mid spring through late summer (with regular deadheading), the frilly blossoms rise on short, stout stems above a low cushion of grassy, blue-green leaves.", "url": "/plant/Dianthus-Fizzy-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1510784678-a525a8c8251843a20/Dianthus-EB-Fizzy-002Optimized.jpg", "img_nm": "DianthusFizzyPink.jpg"}, {"name": "Dianthus plumarius 'Laced Monach' (Pink)", "desc": "Blooms enthusiastically! Dianthus 'Laced Monarch' is a very charming modern Border Pink with double purple-pink blooms richly laced with burgundy.", "url": "/plant/dianthus-plumarius-laced-monach-pinks", "img_src": "/rendition.grid_lg/uploads/plant/1510854730-4e119e918fab0542f/Dianthus%20Laced%20Monarch%20Head%200911%20Jpeg%204.77MBOptimized.jpg", "img_nm": "DianthusplumariusLacedMonachPink.jpg"}, {"name": "Diospyros virginiana (American Persimmon)", "desc": "Diospyros virginiana (American Persimmon) is a deciduous tree with a spreading crown and pendulous branches clothed in glossy green, oval leaves, 6 in. long (15 cm). They turn yellow, pink or reddish-purple in the fall, creating a glorious display. In late spring to early summer, fragrant, bell-shaped, yellow flowers are hidden by the half-grown leaves.", "url": "/plant/Diospyros-virginiana", "img_src": "/rendition.grid_lg/uploads/plant/1553533604-90e5c30d55a0fbc66/shutterstock_731497825Optimized.jpg", "img_nm": "DiospyrosvirginianaAmericanPersimmon.jpg"}, {"name": "Echeveria harmsii (Red Echeveria)", "desc": "A particularly showy flowering species, Echeveria harmsii (Red Echeveria) is a succulent evergreen subshrub forming small rosettes of fleshy, narrow, dark green, velvet-plush leaves adorned with red edges. In spring, it sends up flowering stems bearing large, urn-shaped, bright orange flowers with golden throats which are highly attractive to hummingbirds.", "url": "/plant/Echeveria-harmsii-Red-Echeveria", "img_src": "/rendition.grid_lg/uploads/plant/1485295382-e979575d6f368e820/45214168_m.jpg", "img_nm": "EcheveriaharmsiiRedEcheveria.jpg"}, {"name": "Echinacea 'Secret Passion' (Coneflower)", "desc": "Passion is what you will feel when you will see the bright flamingo-pink double cones of Echinacea 'Secret Passion' which contrast with its lighter pink ray florets", "url": "/plant/echinacea-secret-passion-coneflower", "img_src": "/rendition.grid_lg/uploads/plant/1428324347-a8dcda102690aa7a9/Echinacea_Secret_Passion_2b.jpg", "img_nm": "EchinaceaSecretPassionConeflower.jpg"}, {"name": "Echinops bannaticus 'Star Frost' (Globe Thistle)", "desc": "Nicely branched, Echinops bannaticus 'Star Frost' (Globe Thistle) is a robust, upright, herbaceous perennial with a profusion of golf-ball sized, silvery-white flowers at the end of gracefully curving, silvery-white stems. Blooming from mid summer to early fall, they rise above a bushy mound of prickly deep green leaves, silvery-green on the underside. Though they look prickly, they are all show and not prickly at all.", "url": "/plant/echinops-bannaticus-star-frost", "img_src": "/rendition.grid_lg/uploads/plant/1549208479-8bc19a98276ca862d/Echinops%20bannaticus%20Star%20Frost%20Optimized.jpg", "img_nm": "EchinopsbannaticusStarFrostGlobeThistle.jpg"}, {"name": "Eryngium x zabelii 'Jos Eijking' (Sea Holly)", "desc": "Tall, with larger flowers than other varieties, Sea Holly 'Jos Eijking' is extraordinarily eye-catching with its multitude of intense, iridescent metallic blue flowers, tightly packed into egg-shaped heads", "url": "/plant/eryngium-x-zabelii-jos-eijking-sea-holly", "img_src": "/rendition.grid_lg/uploads/plant/1548435976-d448fea652238d059/DP7345%20Eryngium%20x%20zabelii%20Jos%20%20Eijking%20%20Optimized.jpg", "img_nm": "EryngiumxzabeliiJosEijkingSeaHolly.jpg"}, {"name": "Eucalyptus nicholii (Narrow-leaved Peppermint)", "desc": "Widely planted in California and Australia, Eucalyptus nicholii (Narrow-leaved Peppermint) is a vigorous evergreen tree adorned with a spreading crown, ascending branches and deeply furrowed, reddish-brown bark.", "url": "/plant/Eucalyptus-nicholii", "img_src": "/rendition.grid_lg/uploads/plant/1547502565-46353875e5ce709ef/shutterstock_1068322244Optimized.jpg", "img_nm": "EucalyptusnicholiiNarrowleavedPeppermint.jpg"}, {"name": "Euphorbia 'Blackbird' (Spurge)", "desc": "Noted for its exceptionally dark foliage which contrast brilliantly with the lime-green flowers, Euphorbia Blackbird' or 'Nothowlee' (Spurge) is a bushy, dwarf evergreen sub-shrub or great ornamental interest.", "url": "/plant/Euphorbia-Blackbird-Spurge", "img_src": "/rendition.grid_lg/uploads/plant/1469738798-2778e88a6020663bd/Euphorbia-Blackbird-005.jpg", "img_nm": "EuphorbiaBlackbirdSpurge.jpg"}, {"name": "Ficus carica 'Chicago Hardy' (Fig)", "desc": "Noted for its cold-hardiness, Ficus carica 'Chicago Hardy' (Fig) is a large deciduous shrub or small tree with a spreading crown clothed in large, leathery, deeply lobed leaves. Insignificant flowers form inside a hollow receptacle in spring that, when mature, enlarges and becomes fleshy. It becomes an edible, medium-sized fruit, at first green, but deep purple when ripe.", "url": "/plant/Ficus-carica-Chicago-Hardy", "img_src": "/rendition.grid_lg/uploads/plant/1553600710-0f7182c7a0c2e6626/shutterstock_609539165Optimized.jpg", "img_nm": "FicuscaricaChicagoHardyFig.jpg"}, {"name": "Fuchsia 'Checkerboard'", "desc": "Very free-flowering, Fuchsia 'Checkerboard' is an excellent upright Fuchsia cultivar with medium-sized long single flowers with red tubes, red sepals turning white and violet-red corollas. Blooming non-stop from late spring to fall, the flowers stand out and sparkle against the mid-green serrated foliage.", "url": "/plant/Fuchsia-Checkerboard", "img_src": "/rendition.grid_lg/uploads/plant/1507660791-990dadc09037eaf72/botanikfoto-417024-LOptimized.jpg", "img_nm": "FuchsiaCheckerboard.jpg"}, {"name": "Fuchsia 'Southgate'", "desc": "A delightful Fuchsia with a lax, semi trailing habit, 'Southgate' is a bushy deciduous shrub with incredibly pretty, medium-sized, double flowersÂ adorned with blush pink sepals and fluffy corollas exquisitely marked with pink veining. Blooming non-stop from early summer to fall, the flowers stand out against the mid-green foliage.", "url": "/plant/Fuchsia-Southgate", "img_src": "/rendition.grid_lg/uploads/plant/1508176662-de103120438b38125/Fuchsia%20Southgate%20051964C68%20Optimized.jpg", "img_nm": "FuchsiaSouthgate.jpg"}, {"name": "Gaillardia x grandiflora 'Mesa Peach' (Blanket Flower)", "desc": "Gaillardia x grandiflora 'Mesa Peach' (Blanket Flower) is a bushy, often short-lived herbaceous perennial with profuse, peach flowers adorned with a bright yellow band. Blooming from early to late summer, about 2-3 weeks earlier than comparative varieties, the daisy-like flowers retain their vibrant color all season and do not fade. Rich of nectar, the flowers are real magnets for butterflies. This popular Blanket Flower forms a very uniform, compact, well-branched plant with a strong, upright habit.", "url": "/plant/gaillardia-grandiflora-Mesa-Peach", "img_src": "/rendition.grid_lg/uploads/plant/1528107561-9453d48a9d404b6df/Gaillardia_Mesa_Peach_Bloom_3649.jpg", "img_nm": "GaillardiaxgrandifloraMesaPeachBlanketFlower.jpg"}, {"name": "Gardenia jasminoides 'Heaven Scent' (Cape Jasmine)", "desc": "Noted for its cold hardiness and colorful seed pods, Gardenia jasminoides 'Heaven Scent' (Cape Jasmine) is a medium-sized evergreen shrub with thick, lustrous, lance-shaped, dark green leaves and intensely fragrant, single white flowers. Blooming from late spring through summer, the wonderful blossoms give way to showy, red, orange and yellow seed pods in fall.", "url": "/plant/Gardenia-jasminoides-Heaven-Scent", "img_src": "/rendition.grid_lg/uploads/plant/1502825849-b836e6157e811816b/Heaven%20Scent%20Gardenia_blooms.jpg", "img_nm": "GardeniajasminoidesHeavenScentCapeJasmine.jpg"}, {"name": "Geranium (Cinereum Group) 'Ballerina' (Ashy Cranesbill)", "desc": "Noted for its long flowering season, award-winning Geranium (Cinereum Group) 'Ballerina' (Cranesbill) is an herbaceous perennial which produces a profusion of slightly cupped, pale pink flowers, adorned with deep purple veins and a dark blotch at the base of each petal.", "url": "/plant/geranium-cinereum-Ballerina", "img_src": "/rendition.grid_lg/uploads/plant/1499083819-6b24631fc25e68047/botanikfoto-460128-L.jpg", "img_nm": "GeraniumCinereumGroupBallerinaAshyCranesbill.jpg"}, {"name": "Geum 'Totally Tangerine' (Avens)", "desc": "Noted for its long blooming season, Geum 'Totally Tangerine' is a clump-forming, herbaceous perennial boasting an abundance of upward and outward facing, peachy-orange flowers from late spring to fall. Borne in branched sprays, they rise well above the lush mound foliage of deep green, fuzzy leaves.", "url": "/plant/Geum-Totally-Tangerine", "img_src": "/rendition.grid_lg/uploads/plant/1555605040-ae69cb4d4be038e26/shutterstock_638745088%20Optimized.jpg", "img_nm": "GeumTotallyTangerineAvens.jpg"}, {"name": "Gladiolus 'Espresso' (Sword-Lily)", "desc": "Incredibly showy, Gladiolus 'Espresso' (Sword-Lily) features large, velvety, darkest crimson flowers adorned with sparkling white stamens. The blossoms are arranged closely and symmetrically on strong and erect spikes rising above pointed sword-like leaves. Each flower spike may count at least 12 buds.", "url": "/plant/gladiolus-Espresso", "img_src": "/rendition.grid_lg/uploads/plant/1542647140-ba9b8d59d98b95ff3/201456%20Gladiolus%20EspressoOptimized.jpg", "img_nm": "GladiolusEspressoSwordLily.jpg"}, {"name": "Gladiolus (Sword-Lilies)", "desc": "Real eye-catchers in the garden, Gladiolus, also known as sword lilies, are cormous perennials boasting incredibly spectacular spikes of funnel-shaped flowers in summer in a surprisingly wide range of colors. Borne atop attractive fans of sword-shaped or linear leaves, they always provide a dramatic effect with their rich and cheerful colors and their breathtaking vertical lines.", "url": "/plant-variety/gladioli-sword-lilies", "img_src": "/rendition.grid_lg/uploads/plant_family/1542824647-9fc9bf0a8be354f71/6580Optimized.jpg", "img_nm": "GladiolusSwordLilies.jpg"}, {"name": "Hakonechloa macra (Hakone Grass)", "desc": "Hakonechloa macra is more sun tolerant, drought tolerant, cold-hardy, faster growing and easier to propagate than 'Aureola'.", "url": "/plant/hakonechloa-macra-hakone-grass", "img_src": "/rendition.grid_lg/uploads/plant/1506194943-82f2e9f23c45c8325/hakonechloa-macra.jpg", "img_nm": "HakonechloamacraHakoneGrass.jpg"}, {"name": "Helianthus annuus 'Giant Sungold' (Common Sunflower)", "desc": "Making a bold statement in the garden, Helianthus annuus 'Giant Sungold' (Common Sunflower) is a fast-growing, well-branched annual with oblong to lanceolate leaves and striking brilliant flowers. In summer, it produces huge, fluffy, fully-double flowers, up to 6-10 in. across (15-25 cm), resembling golden-yellow pompoms. The flower heads are attractive to bees, butterflies and birds.", "url": "/plant/Helianthus-annuus-Giant-Sungold", "img_src": "/rendition.grid_lg/uploads/plant/1523664879-077011dfd67fce557/32500902_sOptimized.jpg", "img_nm": "HelianthusannuusGiantSungoldCommonSunflower.jpg"}, {"name": "Helichrysum petiolare (Licorice Plant)", "desc": "Bred for hot, sunny environments, Licorice Plant (Helichrysum petiolare) will blow you away with its amazingly soft, densely-felted foliage which brings interest to the border as well as a slight licorice fragrance!", "url": "/plant/helichrysum-petiolare-licorice-plant", "img_src": "/rendition.grid_lg/uploads/plant/1544464518-6c8f590934f368897/shutterstock_473168539%20Optimized.jpg", "img_nm": "HelichrysumpetiolareLicoricePlant.jpg"}, {"name": "Helleborus x hybridus 'Party Dress Pink' (Party Dress Group)", "desc": "Exceptionally pretty, Helleborus x hybridus 'Party Dress Pink' (Hellebore) features large (2-3 in. wide, 5-8 cm), fully double, ruffled and frilled, pink blossoms that resemble a girl's fancy dress.", "url": "/plant/Helleborus-Hybridus-Party-Dress-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1466359644-b014ddb99609487cb/Hellebore-39958.jpg", "img_nm": "HelleborusxhybridusPartyDressPinkPartyDressGroup.jpg"}, {"name": "Hemerocallis 'Bonanza' (Reblooming Daylily)", "desc": "A stunning Heirloom selection, Hemerocallis 'Bonanza' is an indefatigable midseason Daylily which produces an abundance of fragrant, rich golden-yellow flowers with a contrasting deep purple eye.", "url": "/plant/hemerocallis-Bonanza-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452616114-9005e48abb0029ab0/42585953_m.jpg", "img_nm": "HemerocallisBonanzaRebloomingDaylily.jpg"}, {"name": "Hemerocallis 'Gordon Biggs' (Daylily)", "desc": "Hemerocallis 'Gordon Biggs' is a charming early season Daylily which produces an abundance of small, raspberry red flowers, 3-5 in. wide (9 cm), with a bright red eyezone and a contrasting lime-green throat.", "url": "/plant/hemerocallis-Gordon Biggs-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452722035-bcd5ea9fd1383d5dd/Hemerocallis-Gordon-Biggs-2469.jpg", "img_nm": "HemerocallisGordonBiggsDaylily.jpg"}, {"name": "Hemerocallis 'Moonlit Masquerade' (Reblooming Daylily)", "desc": "Hemerocallis 'Moonlit Masquerade' is a gorgeous early midseason Daylily which produces an abundance of large, 5.5 in. wide (14 cm), cream blooms with a bright purple eyezone and rich purple picotee above their green throat.", "url": "/plant/hemerocallis-Moonlit-Masquerade-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452197567-c7505f6335ae58743/Hemerocallis-Moonlit-Masquerade-4573.jpg", "img_nm": "HemerocallisMoonlitMasqueradeRebloomingDaylily.jpg"}, {"name": "Hemerocallis 'Romantic Returns' (Reblooming Daylily)", "desc": "Fragrant, Hemerocallis 'Romantic Returns' is an early midseason Daylily with masses of large, deep rose pink flowers adorned with a lighter watermark above the light green throat.", "url": "/plant/hemerocallis-Romantic-Returns", "img_src": "/rendition.grid_lg/uploads/plant/1518802937-6602f05ad9d3d20c7/Hemerocallis%20'Romantic%20Returns'Optimized.jpg", "img_nm": "HemerocallisRomanticReturnsRebloomingDaylily.jpg"}, {"name": "Heuchera 'Amethyst Myst' (Coral Bells)", "desc": "Heat and humidity tolerant, Heuchera 'Amethyst Myst' features glossy, plum-burgundy leaves adorned with a silvery-blue overlay and extensive black veining. It is named after the light silver dusting that seems to glow. All leaves have rich royal purple undersides.", "url": "/plant/heuchera-Amethyst Myst-coral-bells", "img_src": "/rendition.grid_lg/uploads/plant/1516298744-a774efa5338b2f051/Heuchera%20'Amethyst%20Myst'Optimized.jpg", "img_nm": "HeucheraAmethystMystCoralBells.jpg"}, {"name": "Heuchera 'Lime Rickey' (Coral Bells)", "desc": "Very refreshing, Heuchera 'Lime Rickey' features gently ruffled and frilled, lime green leaves that retain their luminous color throughout the growing season. In late spring to early summer, panicles of small, bell-shaped, pure white flowers bloom on slender stems rising up to 18 in. (45 cm), above the semi-evergreen foliage. A terrific choice for adding a touch of color in the rock garden, perennial border, along paths or in containers.", "url": "/plant/heuchera-Lime-Rickey", "img_src": "/rendition.grid_lg/uploads/plant/1530171263-1de51465d77b4ddcf/Heuchera-Lime-Rickey-4%20Optimized.jpg", "img_nm": "HeucheraLimeRickeyCoralBells.jpg"}, {"name": "Hibiscus 'Mars Madness' (Rose Mallow)", "desc": "Hibiscus 'Mars Madness' (Rose Mallow) is a well-branched, deciduous shrub with large, magenta-red flowers, up to 8 in. across (20 cm), adorned with a small darker red lustrous halo. Their overlapping petals, with deeply impressed veins, unfurl as the countless buds open to become wide and flat.", "url": "/plant/Hibiscus-Mars-Madness-Rose-Mallow", "img_src": "/rendition.grid_lg/uploads/plant/1516973205-b46790e512f3fbd4c/Hibiscus%20'Mars%20Madness'2%20Optimized.jpg", "img_nm": "HibiscusMarsMadnessRoseMallow.jpg"}, {"name": "Hibiscus syriacus 'Orchid Satin' (Rose of Sharon)", "desc": "Hibiscus syriacus 'Orchid Satin' (Rose of Sharon) is a bushy deciduous shrub of graceful habit, noted for its exceptionally large, orchid-pink, single flowers adorned with a prominent red eye. Blooming continuously from midsummer to fall, each flower lasts about one day and stands out against the green foliage of broadly ovate leaves. A very useful, structural shrub for the back of the border.", "url": "/plant/Hibiscus-syriacus-Orchid-Satin", "img_src": "/rendition.grid_lg/uploads/plant/1530010968-24912836c08f6c001/orchid_satin_hibiscus-1%20Optimized.jpg", "img_nm": "HibiscussyriacusOrchidSatinRoseofSharon.jpg"}, {"name": "Hosta 'Frances Williams' (Plantain Lily)", "desc": "Among the most popular hostas ever introduced, Hosta sieboldiana 'Frances Williams' is a large variegated hosta with thick, puckered, strongly veined, broadly heart-shaped, blue-green leaves, 12 in. long (30 cm), widely and irregularly margined greenish-yellow, gradually maturing to creamy-beige.", "url": "/plant/hosta-Frances-Williams-plantain-lily", "img_src": "/rendition.grid_lg/uploads/plant/1461012543-ba77388d0b3dca2ad/Hosta%20Frances%20Williams.jpg", "img_nm": "HostaFrancesWilliamsPlantainLily.jpg"}, {"name": "Hosta 'Wide Brim' (Plantain Lily)", "desc": "Among the most popular variegated hostas ever introduced, Plantain Lily 'Wide Brim' (Hosta) cheerfully brings some color to shady areas! It forms an attractive, dome-shaped mound of broadly heart-shaped, puckered dark green leaves with a blue cast, widely and irregularly margined buttery yellow.", "url": "/plant/hosta-Wide-Brim-plantain-lily", "img_src": "/rendition.grid_lg/uploads/plant/1511998707-d8c154e4c711c467e/PER0288Optimized.jpg", "img_nm": "HostaWideBrimPlantainLily.jpg"}, {"name": "Hydrangea macrophylla 'Emotion'", "desc": "Hydrangea macrophylla 'Emotion' features huge, starry, double pink flowers. When an individual flower first opens, it resembles a lacecap hydrangea with large sterile flowers radiating on the edge. However, unlike the lacecap hydrangea, the inflorescence eventually fills out completely creating both a particularly pretty mophead effect with double flowers.", "url": "/plant/hydrangea-macrophylla-Emotion", "img_src": "/rendition.grid_lg/uploads/plant/1513686888-31c06fd5101956ae5/Hydrangea-You-Me-Emotion-001Optimized.jpg", "img_nm": "HydrangeamacrophyllaEmotion.jpg"}, {"name": "Hydrangea serrata 'Bluebird'", "desc": "One of the few hydrangeas with pretty fall color, Hydrangea serrata 'Bluebird' is a compact and tidy deciduous shrub laden with delicate lacecap flowers, up to 8 in. across (20 cm), in early summer. The flower heads are composed of large, showy sterile sepals radiating around a central cluster of tiny fertile rich blue florets.", "url": "/plant/hydrangea-serrata-Bluebird", "img_src": "/rendition.grid_lg/uploads/plant/1515589849-3dc01402d06c2b05a/60439469_mOptimized.jpg", "img_nm": "HydrangeaserrataBluebird.jpg"}, {"name": "Ilex verticillata 'Little Goblin Red' (Winterberry)", "desc": "Perfect for small spaces, Ilex verticillata 'Little Goblin Red' (Winterberry) is a dwarf shrub with excellent year round interest. This deciduous holly produces abundant small greenish-white flowers in late spring that are followed by a profusion of bright, extra-large red berries in fall and winter. Particularly attractive, they enliven the winter landscape and often persist into early spring unless eaten by birds. The foliage consists in elliptic, toothed, glossy, dark green leaves. 'Little Goblin Red' is a female plant and needs a male pollinator, such as 'Little Goblin Guy' to produce the attractive red berries.", "url": "/plant/Ilex-Verticillata-Little-Goblin-Red", "img_src": "/rendition.grid_lg/uploads/plant/1530635838-d6c67768cbc2c8312/little_goblin_ilex-4035Optimized.jpg", "img_nm": "IlexverticillataLittleGoblinRedWinterberry.jpg"}, {"name": "Iris 'Absolute Treasure' (Bearded Iris)", "desc": "Noted for its tall stature and sweet fragrance, award-winner Iris 'Absolute Treasure' is a very impressive bearded iris with heavily ruffled sky blue standards floating above slightly paler falls and pleasantly contrasting with the white beard white, tipped gold. A definite diva in the spring garden. 42 inches tall (105 cm).", "url": "/plant/iris-Absolute-Treasure-bearded-iris-1-1", "img_src": "/rendition.grid_lg/uploads/plant/1446828310-f2f76536138ecea48/absolutetreasure_web1.jpg", "img_nm": "IrisAbsoluteTreasureBeardedIris.jpg"}, {"name": "Iris 'Conjuration' (Bearded Iris)", "desc": "Regarded as an outstanding Iris by most Iris experts, multiple award-winning Iris 'Conjuration' is exquisitely beautiful, with its pristine white standards tipped with soft blue-violet, elegantly sitting atop white falls, boldly edged with a deep amethyst ribbon and conspicuous tangerine beards.", "url": "/plant/iris-Conjuration-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1446934552-36ef657707c30e49f/19834984_m.jpg", "img_nm": "IrisConjurationBeardedIris.jpg"}, {"name": "Iris 'Jesse's Song' (Reblooming Bearded Iris)", "desc": "Putting on two fabulous shows in spring and early fall, Iris 'Jesse's Song' is an incredibly beautiful Tall Bearded Iris consistently ranked among the top favorite irises worldwide.", "url": "/plant/iris-Jesses-Song-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1447528053-aed71422d6da2e69b/DSC_0074.jpg", "img_nm": "IrisJessesSongRebloomingBeardedIris.jpg"}, {"name": "Iris 'Red Rider' (Bearded Iris)", "desc": "Sweetly fragrant, award-winning Iris 'Red Rider' is a standout Tall Bearded Iris with arresting satiny flowers, a mix of light plum standards with purple midribs, reddish plum falls and conspicuous mustard yellow beards.", "url": "/plant/iris-Red Rider-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1447350586-7f9508749134f081d/Iris-hybrid-Red-Rider-9163.jpg", "img_nm": "IrisRedRiderBeardedIris.jpg"}, {"name": "Iris 'Winesap' (Reblooming Bearded Iris)", "desc": "Putting on two fabulous shows in spring and early fall, Iris 'Winesap' is a distinctive iris with deep wine-red standards sitting atop darker wine-black falls with matching dark red beards.", "url": "/plant/iris-Winesap-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1447364329-da067004c07eae2c6/Iris-hybrid-Winesap-9219.jpg", "img_nm": "IrisWinesapRebloomingBeardedIris.jpg"}, {"name": "Iris hollandica (Dutch Iris)", "desc": "While called 'Dutch Iris', this iris never grew wild in the Netherlands. Instead, it is the product of hybridizations carried out by Dutch growers. Tall and slender, it features flowers that are 4 in. wide (10 cm) with flower stalks, surrounded by gray reed-like leaves, that are very sturdy - a quality which makes them quite suitable for use as cut flowers.", "url": "/plant-variety/iris-hollandica-dutch-iris", "img_src": "/rendition.grid_lg/uploads/plant_family/1431436771-974d9b5d8138825e4/9159.jpg", "img_nm": "IrishollandicaDutchIris.jpg"}, {"name": "Juniperus communis 'Repanda' (Common Juniper)", "desc": "Juniperus communis 'Repanda' (Common Juniper) is a dense, prostrate, evergreen shrub forming a lovely, uniform carpet. The foliage has a different texture than other junipers giving it a unique look. The branches are thin, nodding at their tips, densely arranged and covered with soft, narrow, dark green needles adorned with white bands. The foliage turns a bronze color in winter. It produces green berries that turn blue or black at maturity.", "url": "/plant/Juniperus-communis-Repanda", "img_src": "/rendition.grid_lg/uploads/plant/1523878737-56798cc59f5912672/botanikfoto-526108-LOptimized.jpg", "img_nm": "JuniperuscommunisRepandaCommonJuniper.jpg"}, {"name": "Kniphofia 'Percy's Pride' (Red Hot Poker)", "desc": "Elegant, Kniphofia 'Percy's Pride' features large, densely packed spikes of creamy primrose flowers opening from pale green buds from mid summer to fall.", "url": "/plant/kniphofia-percy-pride-red-hot-poker", "img_src": "/rendition.grid_lg/uploads/plant/1493062517-6c1b73feb23506187/wbwat0906-085.jpg", "img_nm": "KniphofiaPercysPrideRedHotPoker.jpg"}, {"name": "Lagerstroemia 'Purple Magic' (Crape Myrtle)", "desc": "Lagerstroemia 'Purple Magic' (Crape Myrtle) is a compact, deciduous shrub with abundant clusters of crinkly, vivid purple flowers at its branch tips in early summer. They emerge amidst the spring foliage of bold, red tinted new leaves, creating a brilliant display. specimen plant or flowering hedge, thanks to the sheer intensity of its purple blossoms.", "url": "/plant/Lagerstroemia-Purple-Magic", "img_src": "/rendition.grid_lg/uploads/plant/1542467255-013d590242ba5207f/10205_2Optimized.jpg", "img_nm": "LagerstroemiaPurpleMagicCrapeMyrtle.jpg"}, {"name": "Lathyrus odoratus 'Lady Grisel Hamilton' (Sweet Pea)", "desc": "Strongly scented, Lathyrus odoratus 'Lady Grisel Hamilton' is an elegant climbing annual with usually 3-4 lavender flowers per stem. A very desirable variety, each blossom is adorned with a hooded standard. This Grandiflora Sweet Pea is a lovely addition to the garden and perfect for containers where its rich perfume can be enjoyed.", "url": "/plant/Lathyrus-Odoratus-Lady-Grisel-Hamilton", "img_src": "/rendition.grid_lg/uploads/plant/1537644465-c0fdfb4729a92390e/80712Optimized.jpg", "img_nm": "LathyrusodoratusLadyGriselHamiltonSweetPea.jpg"}, {"name": "Lavandula angustifolia 'Thumbelina Leigh' (Lavender)", "desc": "A favorite of many gardeners: very small with a compact, rounded habit, two-tone flowers and a long blooming season!", "url": "/plant/lavandula-angustifolia-thumbelina-leigh-lavender", "img_src": "/rendition.grid_lg/uploads/plant/1462531678-3839fe2e5eb788cc0/_G013779.jpg", "img_nm": "LavandulaangustifoliaThumbelinaLeighLavender.jpg"}, {"name": "Leucospermum 'Scarlet Ribbon' (Pincushion)", "desc": "Incredibly beautiful, Leucospermum 'Scarlet Ribbon' (Pincushion) is a compact, rounded, evergreen shrub with large, salmon pink flower clusters resembling pincushions and purplish-red stripings resembling bright red ribbons. Born at the end of each branch, they are produced in such abundance that they cover the plant from late winter to mid spring.", "url": "/plant/Leucospermum-Scarlet-Ribbon-Pincushion", "img_src": "/rendition.grid_lg/uploads/plant/1485467080-bb795229c666b36b3/Leucospermum%20'scarlet%20ribbons'.jpg", "img_nm": "LeucospermumScarletRibbonPincushion.jpg"}, {"name": "Lilium 'Souvenir' (Oriental Lily)", "desc": "Delightfully fragrant, lovely with its slightly recurved creamy petals flushed with deep purplish pink, Lilium 'Souvenir' is a classic beauty.", "url": "/plant/lilium-souvenir-lily", "img_src": "/rendition.grid_lg/uploads/plant/1426687973-441f37d78eda77908/Lilium%20Souvenir.jpg", "img_nm": "LiliumSouvenirOrientalLily.jpg"}, {"name": "Lonicera 'Mandarin' (Honeysuckle)", "desc": "Lonicera 'Mandarin' (Honeysuckle) is a twining deciduous vine with large whorls of brilliant flowers, bright mandarin orange on the outside and yellow-orange inside. Produced profusely in early summer, they continue blooming intermittently until fall.", "url": "/plant/Lonicera-Mandarin", "img_src": "/rendition.grid_lg/uploads/plant/1543173865-882bcf339fecdeb19/shutterstock_305375525Optimized.jpg", "img_nm": "LoniceraMandarinHoneysuckle.jpg"}, {"name": "Lunaria annua (Honesty)", "desc": "Fast growing, Honesty (Lunaria annua) or Silver Dollar or Money Plant is a very interesting biennial with its heads of 4-petaled flowers, deep purple to white, blooming in mid-late spring to early summer", "url": "/plant/lunaria-annua-honesty", "img_src": "/rendition.grid_lg/uploads/plant/1547564593-7db22167701c93994/shutterstock_1094606888Optimized.jpg", "img_nm": "LunariaannuaHonesty.jpg"}, {"name": "Magnolia denudata 'Yellow River' (Yulan Magnolia)", "desc": "A new variety from China, Magnolia denudata 'Yellow River' also known as 'Fei Huang', is a small deciduous tree with exquisite, sweetly fragrant, buttery-yellow flowers. Upright and goblet-shaped when borne, the large flowers, 6 in. long (15 cm), gracefully open their tepals as they mature, resembling lilies.", "url": "/plant/Magnolia-denudata-Yellow-River-Yulan-Magnolia", "img_src": "/rendition.grid_lg/uploads/plant/1477955109-75ab32485a8a11f21/magnoliadenudatayellowriveroufeihuangmtb039mpmtw15776.jpg", "img_nm": "MagnoliadenudataYellowRiverYulanMagnolia.jpg"}, {"name": "Mimulus aurantiacus (Bush Monkey Flower)", "desc": "A colorful California native, award-winning Mimulus aurantiacus (Bush Monkey Flower) is a bushy evergreen shrub with narrow, lanceolate, dark-green leaves typically 2-3 in. long (5-7 cm) on very sticky stems, and flowering stems that grow vertically. Trumpet-shaped, the exuberant flowers, 1.2 in long (3 cm), are tubular at the base with five broad lobes.", "url": "/plant/Mimulus aurantiacus-monkey-flower", "img_src": "/rendition.grid_lg/uploads/plant/1484936526-b7f3c479369536b9d/CFGh792.jpg", "img_nm": "MimulusaurantiacusBushMonkeyFlower.jpg"}, {"name": "Monarda 'Gardenview Scarlet' (Bee Balm)", "desc": "Vigorous, award-winning Monarda 'Gardenview Scarlet' (Bee Balm) is a clump-forming perennial boasting masses of vibrant red flowers, borne in dense, globular terminal heads. Blooming for weeks from mid summer to early fall, they rest upon a whorl of decorative pink-tipped, pale green bracts that mature to bronze.", "url": "/plant/monarda-Gardenview-Scarlet-beebalm", "img_src": "/rendition.grid_lg/uploads/plant/1470092589-b5a3d93e090336d42/Monarda%20Gardenview%20Scarlet.jpg", "img_nm": "MonardaGardenviewScarletBeeBalm.jpg"}, {"name": "Narcissus 'Actaea' (poeticus Daffodil)", "desc": "Fragrant, multiple award-winner Narcissus 'Actaea' displays elegant, pure white flowers, up to 3 in. wide (8 cm), adorned with six wide petals and tiny, red-rimmed, golden-yellow cups. Blooming in mid to late spring, one flower per stem, the blossoms rise atop a clump of narrow, strap-shaped leaves. Great in the sunny border, this daffodil performs better in wet, poorly drained areas than most daffodils. Because of its sweet scent, it makes excellent cut flowers.", "url": "/plant/narcissus-actaea-poeticus-daffodil", "img_src": "/rendition.grid_lg/uploads/plant/1536866608-a05d55aa3cf554bb8/botanikfoto-471195-LOptimized.jpg", "img_nm": "NarcissusActaeapoeticusDaffodil.jpg"}, {"name": "Narcissus 'Inbal' (Tazetta Daffodil)", "desc": "Narcissus 'Inbal' (Tazetta Daffodil) is a delicately scented Paperwhite daffodil with large clusters of pure white flowers adorned with a flat cup. It is reported to boast better fragrance and stronger stems than the other modern paperwhite varieties. It is not winter hardy, but is perfect for producing flowers in a short period of time when grown indoors", "url": "/plant/Narcissus-Inbal", "img_src": "/rendition.grid_lg/uploads/plant/1536069342-060632939400538ff/10809633_s%20Optimized.jpg", "img_nm": "NarcissusInbalTazettaDaffodil.jpg"}, {"name": "Narcissus bulbocodium 'Golden Bells' (Hoop Petticoat Daffodil)", "desc": "Floriferous, Narcissus bulbocodium 'Golden Bells' (Hoop Petticoat Daffodil) is a charming, dwarf, bulbous perennial boasting upward-facing, bell-shaped, rich golden-yellow flowers adorned with very short, star-like petals. Blooming in early to mid spring, they rise atop narrow, bright green leaves. Each bulb sends up 5 to 15 vibrant blossoms. Perfect for naturalizing and weather resistant, this vigorous grower stands out anywhere thanks to its bright color.", "url": "/plant/Narcissus-bulbocodium-Golden-Bells", "img_src": "/rendition.grid_lg/uploads/plant/1536048038-d628c0ed562ac6148/Narcissus%20bulbocodium%20conspicuus%20Optimized.jpg", "img_nm": "NarcissusbulbocodiumGoldenBellsHoopPetticoatDaffodil.jpg"}, {"name": "Olearia x scilloniensis (Daisy Bush)", "desc": "Particularly suitable for coastal gardens, Olearia x scilloniensis (Daisy Bush) is a compact rounded evergreen shrub with small, wavy-edged, gray-green leaves. In late spring or early summer, every shoot becomes so smothered with clusters of white, daisy-like flowers with yellow centers, that the leaf almost disappears.", "url": "/plant/Olearia x scilloniensis-Daisy Bush", "img_src": "/rendition.grid_lg/uploads/plant/1498071958-4be20a8e77cd07003/35704.jpg", "img_nm": "OleariaxscilloniensisDaisyBush.jpg"}, {"name": "Osmanthus heterophyllus 'Goshiki' (Holly Osmanthus)", "desc": "Slow-growing and compact, Osmanthus heterophyllus 'Goshiki' (Holly Osmanthus) is a bushy evergreen shrub prized for its variegated and colorful holly-like foliage. Goshiki means 5 colors in Japanese. Emerging pink, the leathery leaves unfold as creamy, white, gold and bronze variegated, dark green spiny leaves.", "url": "/plant/Osmanthus-heterophyllus-Goshiki", "img_src": "/rendition.grid_lg/uploads/plant/1555076535-c712d5a26ffa5bf5f/shutterstock_438871582Optimized.jpg", "img_nm": "OsmanthusheterophyllusGoshikiHollyOsmanthus.jpg"}, {"name": "Papaver orientale 'Tiffany' (Oriental Poppy)", "desc": "Providing a sumptuous display, Oriental Poppy 'Tiffany' (Papaver orientale) features large, crepe papery, cup-shaped, magenta-pink flowers with white picotee edges and black splotches at the base of its petals.", "url": "/plant/papaver-orientale-Tiffany-oriental-poppy", "img_src": "/rendition.grid_lg/uploads/plant/1457899097-3deb04977e2462068/Papaver%20orientale%20Tiffany%20dp7349.jpg", "img_nm": "PapaverorientaleTiffanyOrientalPoppy.jpg"}, {"name": "Pelargonium 'Americana Red' (Zonal Geranium)", "desc": "Pelargonium 'Americana Red' (Zonal Geranium) is a bushy, evergreen, tender perennial with huge clusters of bright scarlet-red, semi-double flowers, up to 4-5 in. across (10-12 cm). Blooming continuously (if deadheaded), the luminous blossoms are reported to withstand wind, rain and heat better than most.", "url": "/plant/Pelargonium-Americana-Red", "img_src": "/rendition.grid_lg/uploads/plant/1523462802-fdf4ddee69f62f9c2/Zonal_Geranium_Americana_Red_Bloom_13697Optimized.jpg", "img_nm": "PelargoniumAmericanaRedZonalGeranium.jpg"}, {"name": "Pennisetum thunbergii 'Red Buttons' (Fountain Grass)", "desc": "Noted for its elegant, rosy-red feathery flowers, Pennisetum thunbergii 'Red Buttons' (Fountain Grass) is a graceful, deciduous grass that forms a compact, upright clump of narrow grassy leaves. In late summer, showy, elongated, red flower plumes are produced at the tips of long graceful stems. They rise high above the foliage, arching upward or outward, and gradually fade to buff as they mature.", "url": "/plant/pennisetum-thunbergii-Red-Buttons-fountain-grass", "img_src": "/rendition.grid_lg/uploads/plant/1497730383-695b4a7c625e11b07/56024-2.jpg", "img_nm": "PennisetumthunbergiiRedButtonsFountainGrass.jpg"}, {"name": "Petunia 'Easy Wave Red Velour'", "desc": "Petunia 'Easy Wave Red Velour' is a mound forming, spreading annual or perennial boasting masses of velvety deep red flowers from late spring to the first frosts. Fast-growing and blooming freely all season, this Petunia is dense and full, making it perfect to quickly cover a large area in the garden, or to gracefully cascade from baskets and containers.", "url": "/plant/Petunia-Easy-Wave-Red-Velour", "img_src": "/rendition.grid_lg/uploads/plant/1556094538-9729f2da0159fad44/Spreading_Petunia_Easy_Wave_Red_Velour_Landscape_22871%20Optimized.jpg", "img_nm": "PetuniaEasyWaveRedVelour.jpg"}, {"name": "Petunia 'Supertunia Mulberry Charm'", "desc": "Petunia 'Supertunia Mulberry Charm' is a mounding trailing annual or perennial boasting masses of pale pink flowers adorned with deep purple veins from late spring to the first frosts. Vigorous and blooming freely all season, this Petunia is perfect for the front of flower beds. It is terrific in containers or hanging baskets, where it can function as a filler or trail gracefully over the edges.", "url": "/plant/Petunia-Supertunia-Mulberry-Charm", "img_src": "/rendition.grid_lg/uploads/plant/1556294739-33408f34d65784fe1/supertunia_mulberry_charm_tag%20Optimized.jpg", "img_nm": "PetuniaSupertuniaMulberryCharm.jpg"}, {"name": "Phlox paniculata 'Younique Mauve' (Garden Phlox)", "desc": "A dwarf and compact garden phlox, Phlox paniculata Younique Mauve' is an herbaceous perennial with large clusters of soft mauve flowers adorned with white centers. Blooming for weeks from mid summer to early fall, the fragrant flowers are rich of nectar and visited by hummingbirds and butterflies.", "url": "/plant/phlox-paniculata-Younique-Mauve-garden-phlox", "img_src": "/rendition.grid_lg/uploads/plant/1512764474-1a5fd6d4e3b326486/PHL13-15766Optimized.jpg", "img_nm": "PhloxpaniculataYouniqueMauveGardenPhlox.jpg"}, {"name": "Pinus parviflora 'Hagoromo Seedling' (Japanese White Pine)", "desc": "Pinus parviflora 'Hagoromo Seedling' (Japanese White Pine) is a dwarf evergreen coniferous shrub of dense, globose habit with a particularly attractive foliage of blue-green needles. A slow grower, 1 in. per year (2.5 cm), this very distinctive Japanese White Pine makes a terrific bonsai plant and is perfect for the rock garden.", "url": "/plant/Pinus-parviflora-Hagoromo", "img_src": "/rendition.grid_lg/uploads/plant/1534269060-9d3c2de17cedff3b2/Pinus%20parviflora%20'Hagoromo'Optimized.jpg", "img_nm": "PinusparvifloraHagoromoSeedlingJapaneseWhitePine.jpg"}, {"name": "Prunus cerasifera 'Nigra' (Black Cherry Plum)", "desc": "Adding drama to the garden, Prunus cerasifera 'Nigra' (Black Cherry Plum) is a medium-sized, round-headed deciduous tree with a striking presence in the landscape, whether in bloom or not. This plum tree boasts some of the darkest purple leaves and twigs.", "url": "/plant/Prunus-cerasifera-Nigra-Black-Cherry-Plum", "img_src": "/rendition.grid_lg/uploads/plant/1547562122-884b81c37b17fac11/shutterstock_509805094Optimized.jpg", "img_nm": "PrunuscerasiferaNigraBlackCherryPlum.jpg"}, {"name": "Puschkinia scilloides (Striped Squill)", "desc": "Realize an impressive display with this lovely bulb, Striped Squill (Puschkinia libanotica or Puschkinia scilloides). A great naturalizer, it will come back year after year and even multiply from seed under favorable conditions of light shade and moisture-retentive soil.", "url": "/plant/puschkinia-scilloides-striped-squill", "img_src": "/rendition.grid_lg/uploads/plant/1535725721-f9ab9950ad5a6c303/217137%20Optimized.jpg", "img_nm": "PuschkiniascilloidesStripedSquill.jpg"}, {"name": "Ranunculus asiaticus 'Elegance Red' (Persian Buttercup)", "desc": "Ranunculus asiaticus 'Elegance Red' (Persian Buttercup) is a tuberous-rooted plant boasting large flowers adorned with layers upon layers of beautifully structured, silky ruby-red petals. Reminiscent of garden roses or peonies, the flowers are borne atop thick and sturdy stems.", "url": "/plant/Ranunculus-asiaticus-Elegance-Red", "img_src": "/rendition.grid_lg/uploads/plant/1548235082-0892e7446710bb0bd/219495%20Optimized.jpg", "img_nm": "RanunculusasiaticusEleganceRedPersianButtercup.jpg"}, {"name": "Rhododendron 'Autumn Sunset' (Encore Azalea Series)", "desc": "Noted for its multi-season flowers, Rhododendron 'Autumn Sunset' is a compact evergreen re-blooming Azalea of upright, dense, rounded habit. Blooming in spring for a couple of weeks, then sporadically from midsummer to frost, 'Autumn Sunset' produces single and semi-double, glowing red-orange flowers, 2.5 in. across (7 cm).", "url": "/plant/Rhododendron-Autumn-Sunset", "img_src": "/rendition.grid_lg/uploads/plant/1517670359-59a63f71b40815556/autumn_sunset%20Optimized.jpg", "img_nm": "RhododendronAutumnSunsetEncoreAzaleaSeries.jpg"}, {"name": "Romneya coulteri (Matilija Poppy)", "desc": "Vigorous and bushy, Romneya coulteri (Californian Tree Poppy) is a spectacular shrub-like perennial that gets covered with apricot scented, large flowers, measuring up to 9 in. across (22 cm). Each flower features 5-6 crepe paper, crinkled, pure white petals surrounding a glowing ball of golden stamens.", "url": "/plant/Romneya-Coulteri-Matilija-Poppy", "img_src": "/rendition.grid_lg/uploads/plant/1488385739-7a81f8ecdde0ccee9/110612_romneya_coulteri_13%20Romneya%20coulteri,%20or%20Matilija%20poppy—another%20greenbelt%20dweller.jpg", "img_nm": "RomneyacoulteriMatilijaPoppy.jpg"}, {"name": "Rosa 'Buff Beauty' (Hybrid Musk Rose)", "desc": "Regarded as one of the best Musk roses, award-winning Rosa 'Buff Beauty' is a vigorous, spreading medium-sized shrub with large clusters of deliciously scented, very full (over 41 petals), semi-double flowers in the most attractive shades of buff-yellow to apricot and paling to primrose. Rich of a strong tea fragrance, the pretty blooms stand out against the lustrous foliage of dark green leaves.", "url": "/plant/rose-Buff-Beauty", "img_src": "/rendition.grid_lg/uploads/plant/1542158797-af679e8e6631075ec/12925144_mOptimized.jpg", "img_nm": "RosaBuffBeautyHybridMuskRose.jpg"}, {"name": "Rosa 'Dick Clark' (Grandiflora Rose)", "desc": "Rosa 'Dick Clark' is an exquisite Grandiflora rose with large, 3.5 in. across (9 cm), very double (29 petals), classically-formed, cream flowers adorned with cherry-pink edges, gradually changing to burgundy-red. Opening from long, pointed buds, the blossoms enjoy a moderate, cinnamon spice fragrance.", "url": "/plant/Rosa-Dick-Clark", "img_src": "/rendition.grid_lg/uploads/plant/1542038429-20913c16e28d9419f/DickClarkOptimized.jpg", "img_nm": "RosaDickClarkGrandifloraRose.jpg"}, {"name": "Rosa 'Fragrant Cloud' (Hybrid Tea Rose)", "desc": "Noted for its incredibly powerful perfume, Rosa 'Fragrant Cloud' is a lovely Hybrid Tea rose with very large, 5 in. across (12 cm), full, high-centered, bright coral-red flowers (27-35 petals). The eye-catching blossoms are strongly scented, a delightful mix of citrus, damask, fruity, spice fragrance. Prolific, they bloom in flushes from spring to fall.", "url": "/plant/Rosa-Fragrant-Cloud", "img_src": "/rendition.grid_lg/uploads/plant/1541631685-1df83129e0cf59cb8/shutterstock_431005666Optimized.jpg", "img_nm": "RosaFragrantCloudHybridTeaRose.jpg"}, {"name": "Rosa 'Jubilee Celebration' (English Rose)", "desc": "One of the most fragrant English roses!", "url": "/plant/rose-jubilee-celebration-aushunter", "img_src": "/rendition.grid_lg/uploads/plant/1542318033-3570268d4799d9ee2/David_Austin_English_Rose_Jubilee_Celebration1Optimized.jpg", "img_nm": "RosaJubileeCelebrationEnglishRose.jpg"}, {"name": "Rosa 'Molineux' (English Rose)", "desc": "xceptionally healthy, award-winner David Austin Rose 'Molineux' enjoys abundant, incredibly beautiful, fully double blooms of a rich canary yellow color throughout the season. Each bloom is packed with many petals (120 petals) and opens gradually from rounded buds to exquisite, rosette-shaped flowers with a very pleasant scent of Tea Rose.", "url": "/plant/rose-molineux-ausmol", "img_src": "/rendition.grid_lg/uploads/plant/1542326365-fad15c565490c96b8/David_Austin_English_Rose_MolineuxOptimized.jpg", "img_nm": "RosaMolineuxEnglishRose.jpg"}, {"name": "Rosa 'Princess Alexandra of Kent' (English Rose)", "desc": "Repeat-flowering, Rosa 'Princess Alexandra of Kent' is an irresistible English Old Rose Hybrid with unusually large, fully petalled (about 130 petals) and deeply cupped flowers of a warm, glowing pink. The ring of soft pink outer petals, enclosing the warm pink inner petals, creates a most pleasing effect.", "url": "/plant/rose-princess-alexandra-of-kent-ausmerchant", "img_src": "/rendition.grid_lg/uploads/plant/1542327611-25cf2d70c823e85c1/Princess%20Alexandra%20of%20Kent%20(Ausmerchant)Optimized.jpg", "img_nm": "RosaPrincessAlexandraofKentEnglishRose.jpg"}, {"name": "Rosa 'Strawberry Hill' (English Rose)", "desc": "Awarded the Prix d'Honneur for fragrance from Nantes in 2007, 'Strawberry Hill' is an English Rose that is simply irresistible", "url": "/plant/rose-strawberry-hill-ausrimini", "img_src": "/rendition.grid_lg/uploads/plant/1542372810-d9b47e2efc7e6f1bf/Strawberry%20Hill%20(Ausrimini)%20COptimized.jpg", "img_nm": "RosaStrawberryHillEnglishRose.jpg"}, {"name": "Rosa 'Westerland' (Shrub Rose)", "desc": "Extremely hardy, award-winning Rosa 'Westerland' is a vigorous shrub of upright habit with small clusters of deliciously scented, cupped, ruffled, double flowers (30 petals) in the most attractive shades of bright copper-orange and apricot. Rich of a strong spicy fragrance, the large and showy blooms, 5 in. across (12 cm), stand out against the shiny foliage of dark green leaves.", "url": "/plant/rose-Westerland", "img_src": "/rendition.grid_lg/uploads/plant/1541864874-630d65794f629584e/rosa-westerlandOptimized.jpg", "img_nm": "RosaWesterlandShrubRose.jpg"}, {"name": "Rubus idaeus 'Anne' (Everbearing Raspberry)", "desc": "Regarded as one of the best-flavored yellow raspberries, Rubus idaeus 'Anne' (Everbearing Raspberry) is an upright, self-fruitful, sparsely thorned shrub which produces 2 crops on each cane: a moderate crop in early summer followed by a heavy crop in late summer to fall. Clusters of white, rose-like flowers give way to large, firm, sweet, juicy, almost translucent golden raspberries, which are great for fresh eating as well as preserves.", "url": "/plant/Rubus-idaeus-Anne", "img_src": "/rendition.grid_lg/uploads/plant/1552937560-2f445ca51d00fd14e/shutterstock_400831024Optimized.jpg", "img_nm": "RubusidaeusAnneEverbearingRaspberry.jpg"}, {"name": "Salix alba var. vitellina 'Golden Ness' (Golden Willow)", "desc": "Noted for its colorful stems and stunning winter display, Salix alba var. vitellina 'Golden Ness' (Golden Willow) is a medium-sized deciduous tree, often grown as a multi-stemmed shrub. It sports bright, golden-yellow new stems that glow throughout winter, and make a great splash of excitement in the landscape. In spring and summer, it bears narrow, lanceolate, finely-toothed leaves that usually turn yellow in the fall, before falling to the ground and revealing the spectacular stems. A great addition to the winter garden.", "url": "/plant/Salix-alba-var-vitellina-Golden-Ness-Willow", "img_src": "/rendition.grid_lg/uploads/plant/1473359193-57db3af3056cd7e03/Salix%20alba%20Golden%20Ness.jpg", "img_nm": "SalixalbavarvitellinaGoldenNessGoldenWillow.jpg"}, {"name": "Salvia nemorosa 'Amethyst' (Sage)", "desc": "Ready to please the gardener, award-winner Sage 'Amethyst' (Salvia Nemorosa) is a favorite of many for its unique, glowing purple stems and stunning spikes of rich, lavender-pink flowers, appearing in early summer and lasting throughout the summer. Raised by world-acclaimed designer Piet Oudolf, Salvia 'Amethyst' is considered the best pink flowered variety of Salvia.", "url": "/plant/salvia-nemorosa-amethyst-sage", "img_src": "/rendition.grid_lg/uploads/plant/1522865090-7bc709791b975b787/botanikfoto-472435-LOptimized.jpg", "img_nm": "SalvianemorosaAmethystSage.jpg"}, {"name": "Scabiosa 'Pink Mist' (Pincushion Flower)", "desc": "Noted for its very long blooming season, Scabiosa 'Pink Mist' (Pincushion Flower) is a compact, clump-forming perennial forming a short mound of ferny foliage. Blooming for months from early summer until fall, it rewards the gardeners with a profusion of lilac-pink pincushion-like flowers, 2 in. across (5 cm), atop wiry stems, which hover over the foliage mound of lobed, gray-green leaves. Trouble-free, easy-to-grow, this eye-catching beauty is excellent for grouping or massing in borders and rock gardens. The finely divided foliage stays low and compact, making this pretty perennial suitable for edging borders and paths.", "url": "/plant/Scabiosa-Pink-Mist", "img_src": "/rendition.grid_lg/uploads/plant/1527863969-d784440eb36275375/scabiosa%20Pink%20MistOptimized.jpg", "img_nm": "ScabiosaPinkMistPincushionFlower.jpg"}, {"name": "Sedum reflexum (Blue Spruce Stonecrop)", "desc": "Deservedly popular, Sedum reflexum (Blue Spruce Stonecrop) is a low growing, mat-forming, evergreen perennial adorned with blue-green needle-like leaves, arranged around the lax stems like spruce needles. Clusters of bright yellow, star-shaped flowers create a smashing floral display in summer.", "url": "/plant/Sedum-reflexum", "img_src": "/rendition.grid_lg/uploads/plant/1555348548-0d83c0fc607e8b5d7/shutterstock_129172175Optimized.jpg", "img_nm": "SedumreflexumBlueSpruceStonecrop.jpg"}, {"name": "Solidago 'Goldenmosa' (Goldenrod)", "desc": "Blooming for many weeks from late summer to early fall, this eye-catching beauty is regarded as one of the best Goldenrods.", "url": "/plant/solidago-Goldenmosa-goldenrod", "img_src": "/rendition.grid_lg/uploads/plant/1547500185-40156f3465c49457f/shutterstock_701252101Optimized.jpg", "img_nm": "SolidagoGoldenmosaGoldenrod.jpg"}, {"name": "Tall Alliums for your Garden Borders", "desc": "The tall Alliums in particular are very impressive when towering up above lower-growing plants or ground covers. They are definitely displayed at their loveliest when placed among perennial plants in the border. Their leaves, which are usually not very attractive and which also wither back quickly after flowering, will then be hidden beneath the leaves of the perennial plants.", "url": "/plant-variety/Tall-Alliums-for-your-Garden-Borders", "img_src": "/rendition.grid_lg/uploads/plant_family/1506456696-e4b2432fe0be87bb6/44931203_mOptimized.jpg", "img_nm": "TallAlliumsforyourGardenBorders.jpg"}, {"name": "Trillium chloropetalum (Giant Wake Robin)", "desc": "Rich of a rose fragrance, Trillium chloropetalum (Giant Wake Robin) is an incredible beauty with a great garden presence. Poking from the soil in winter, large buds send up stems topped with egg-shaped leaves, slightly mottled with chocolate brown", "url": "/plant/Trillium-Chloropetalum-Giant-Wake-Robin", "img_src": "/rendition.grid_lg/uploads/plant/1469562431-21e286d9841c03f0c/botanikfoto-519185-L.jpg", "img_nm": "TrilliumchloropetalumGiantWakeRobin.jpg"}, {"name": "Verbena 'Superbena Sparkling Ruby'", "desc": "Noted for its vigor, heat, drought and mildew tolerance, Verbena 'Superbena Sparkling Ruby' is a mounding trailing Verbena with profuse clusters of red flowers splashed with pink and white. Blooming continuously from summer to frost, the blossoms are so profuse that they literally smother the foliage of oval, toothed, mint-like leaves, creating a terrific floral display.", "url": "/plant/verbena-Superbena-Sparkling-Ruby", "img_src": "/rendition.grid_lg/uploads/plant/1522953141-c5cf4321c3caad7d9/Verbena%20Superbena%20Sparkling%20RubyOptimized.jpg", "img_nm": "VerbenaSuperbenaSparklingRuby.jpg"}, {"name": "Viola 'Sorbet Carmine Rose'", "desc": "Free-flowering and heat tolerant, Viola 'Sorbet Carmine Rose' is a compact, semi-evergreen perennial prized for its abundance of small carmine flowers, 1 in. across (2.5 cm), adorned with yellow centers and pretty whiskers. Flowering is so prolific that it obscures the foliage when the plant is in full bloom. Being small, the flowers hold up to rainy winter weather much better than large pansies. Produced from early spring to late fall, the blossoms arise from a low, bushy mound of crinkled, rounded, green leaves, which spreads to form an elegant ground cover.", "url": "/plant/Viola-Sorbet-Carmine-Rose", "img_src": "/rendition.grid_lg/uploads/plant/1531593823-e95703f59f2527bc4/Viola_Sorbet_Carmine_Rose_Bloom_9101Optimized.jpg", "img_nm": "ViolaSorbetCarmineRose.jpg"}, {"name": "Wisteria brachybotrys 'Shiro-Kapitan' (Silky Wisteria)", "desc": "Highly scented, award-winning Wisteria brachybotrys 'Shiro-Kapitan' is a gorgeous climber with flowers of great beauty. It produces masses of hanging sprays, up to 6 in. long (15 cm), of fragrant, pea-like, snow-white flowers with a conspicuous yellow spot.", "url": "/plant/Wisteria-Brachybotrys-Shiro-Kapitan-Silky-Wisteria", "img_src": "/rendition.grid_lg/uploads/plant/1466182202-7f42ac78feb33492d/54495693_m.jpg", "img_nm": "WisteriabrachybotrysShiroKapitanSilkyWisteria.jpg"}, {"name": "Zantedeschia 'Captain Chelsea' (Calla Lily)", "desc": "Noted for its breathtaking blooms, Calla Lily 'Captain Chelsea' (Zantedeschia) boasts brilliant yellow, chalice-shaped flowers (spathes), adorned with a rich purple-burgundy throat. Every single flower is surrounded by elegant, lustrous, dark green leaves sometimes speckled with white. On display for weeks from summer to fall.", "url": "/plant/zantedeschia-captain-Chelsea", "img_src": "/rendition.grid_lg/uploads/plant/1551186942-cb626813df83bf7e4/88240Optimized.jpg", "img_nm": "ZantedeschiaCaptainChelseaCallaLily.jpg"}, {"name": "Zantedeschia 'Rubylite Rose' (Calla Lily)", "desc": "Lush and exotic looking, Calla Lily 'Rubylite Rose' (Zantedeschia) enjoys stunning, rich, deep pink, trumpet-shaped flowers (spathes) atop elegant, dark green, arrow-shaped, white-spotted leaves.", "url": "/plant/zantedeschia-rubylite-rose-calla-lily", "img_src": "/rendition.grid_lg/uploads/plant/1504707434-d8950290ad0b9446b/Zantedeschia%20Rubylite%20Rose.jpg", "img_nm": "ZantedeschiaRubyliteRoseCallaLily.jpg"}, {"name": "Zinnia 'Will Rogers'", "desc": "Introduced in the 1940s, Zinnia 'Will Rogers' boasts rounded, fully double flowers packed with brilliant red petals. As the flower matures, a circle of small golden stars surrounds its center disk. Resembling dahlias, the bold, large blossoms are borne on very long, sturdy stems and make a big statement in the landscape.", "url": "/plant/zinnia-Will-Rogers", "img_src": "/rendition.grid_lg/uploads/plant/1552938761-b57e18a05e9435fde/shutterstock_525453826Optimized.jpg", "img_nm": "ZinniaWillRogers.jpg"}, {"name": "Zinnia marylandica 'Zahara Starlight Rose'", "desc": "Zinnia marylandica 'Zahara Starlight Rose' features beautiful, large, white flowers, 2.5 in. across (6 cm), adorned with rose stripes. As the flower matures, a circle of small golden stars surrounds its center disk. Borne atop sturdy stems, the eye-catching blossoms float above the fresh green foliage and make a bold statement in the landscape.", "url": "/plant/zinnia-marylandica-Zahara-Starlight-Rose", "img_src": "/rendition.grid_lg/uploads/plant/1550777814-b70d03161b7c6b53b/F_Zinnia_ZaharaStarlightRoseOptimized.jpg", "img_nm": "ZinniamarylandicaZaharaStarlightRose.jpg"}]