[{"name": "Abies balsamea (Hudsonia Group) 'Nana' (Balsam Fir)", "desc": "Highly popular, Abies balsamea ‘Nana’ is a dwarf, aromatic, evergreen conifer of globose habit forming a broad mound with numerous short branches, adorned with a lush foliage of dark green needles radially arranged around the stems. Slow-growing, 2-3 in. per year (5-7 cm), this Balsam Fir is a great choice for small gardens or rockeries. Perfect for adding year-round color to the garden.", "url": "https://www.gardenia.net/plant/Abies-balsamea-Hudsonia-Group-Nana", "img_src": "/rendition.grid_lg/uploads/plant/1534945169-5498fa01cc3f0709f/PM130334Optimized.jpg"}, {"name": "Achillea millefolium 'Pomegranate' (Yarrow)", "desc": "Good-looking, compact, bushy and heat loving, Achillea millefolium 'Pomegranate' is a stunning Yarrow with its masses of long-lasting clusters of rich velvety red flowers which immediately catch the eye. Its pleasantly aromatic, semi-evergreen, green fern-like foliage is disease resistant and nicely compliments the cheerful flat umbel flowers.", "url": "https://www.gardenia.net/plant/achillea-millefolium-pomegranate-yarrow", "img_src": "/rendition.grid_lg/jardin/images/main_picture_532ca1180577f.jpg"}, {"name": "Ajuga reptans 'Black Scallop' (Carpet Bugle)", "desc": "Ajuga reptans 'Black Scallop' (Carpet Bugle) is a creeping perennial prized for its short spikes of fragrant, deep blue flowers and very glossy, near-black, scalloped leaves. Blooming in late spring to early summer, the flowers rise above the contrasting, spreading rosettes formed by the leaves, putting on an eye-catching display.", "url": "https://www.gardenia.net/plant/Ajuga-Reptans-Black-Scallop-Carpet-Bugle", "img_src": "/rendition.grid_lg/uploads/plant/1501101948-e07640daec604979a/ajuga%20reptans%20black%20Scallop.jpg"}, {"name": "Allium caeruleum (Ornamental Onion)", "desc": "Spectacular and refreshing! Prized for its true blue color, Allium caeruleum provides interesting ornamental value in the garden in late spring to early summer.", "url": "https://www.gardenia.net/plant/allium-caeruleum-ornamental-onion", "img_src": "/rendition.grid_lg/uploads/plant/1505249668-11a0fef5eaae6aecf/83082173_m.jpg"}, {"name": "Amaryllis 'Charisma' (Hippeastrum)", "desc": "Award-winning Amaryllis 'Charisma' (Hippeastrum), is a real knockout with its large, white flowers, up to 6 in. across (16 cm), delicately brushed with scarlet, and adorned with a red ribbon around the edges. Contrasting the upper petals, the lower petals are mostly white with red freckles.", "url": "https://www.gardenia.net/plant/amaryllis-Charisma", "img_src": "/rendition.grid_lg/uploads/plant/1532796706-d12ab2d56c03647d3/Hippeastrum%20Charisma%20Optimized.jpg"}, {"name": "Amaryllis 'Matterhorn' (Hippeastrum)", "desc": "Brightening up any home during winter, Amaryllis 'Matterhorn' is a stunning beauty with extra large, slightly ruffled, snow-white flowers, up to 7 in. across (17 cm), adorned with a lime-green throat.", "url": "https://www.gardenia.net/plant/amaryllis-Matterhorn", "img_src": "/rendition.grid_lg/uploads/plant/1532872577-2fa8fe22703b60e12/Hippeastrum%20Matterhorn%20Optimized.jpg"}, {"name": "Amaryllis 'Sweet Lilian' (Hippeastrum)", "desc": "Amaryllis 'Sweet Lillian' (Hippeastrum) is very pretty with its star-shaped, rosy-pink flowers, up to 6 in. across (15 cm), delicately fading to white towards their tips and adorned with white center stripes and an apple-green throat.", "url": "https://www.gardenia.net/plant/Amaryllis-Sweet-Lilian", "img_src": "/rendition.grid_lg/uploads/plant/1535384991-94b9be3ba3f3be41c/PL171054%20Optimized.jpg"}, {"name": "Anemone x hybrida 'Elegans' (Japanese Anemone)", "desc": "A must have in the late season garden! Award-winner Anemone x hybrida 'Elegans' is a lovely, Japanese Anemone hybrid cultivar exhibiting bowl-shaped, semi-double, light pink flowers, 3 in. wide (7 cm), with 10 to 15 narrow, overlapping tepals surrounding a yellow center of anthers.", "url": "https://www.gardenia.net/plant/anemone-x-hybrida-Elegans-japanese-anemone", "img_src": "/rendition.grid_lg/uploads/plant/1505749400-ec884668f1a9ddd50/26948849_m.jpg"}, {"name": "Aquilegia vulgaris 'Winky Double Red-White' (Columbine)", "desc": "Very floriferous, with unique double, upward-facing flowers in shades of deep red and white, Aquilegia vulgaris 'Winky Double Red-White' is a fabulous variety of Columbine for both the landscape and containers.", "url": "https://www.gardenia.net/plant/aquilegia-vulgaris-winky-double-red-white-columbine", "img_src": "/rendition.grid_lg/jardin/images/main_picture_53f39ca4f3865.jpg"}, {"name": "Asclepias incarnata 'Cinderella' (Swamp Milkweed)", "desc": "Asclepias incarnata 'Cinderella' (Swamp Milkweed) is an erect, clump-forming perennial prized for its brilliant clusters of vanilla scented, rose-pink flowers, which bloom continuously for weeks from midsummer to early fall. The flowers are a great source of nectar for butterflies, hummingbirds, bees, and other beneficial insects. Sitting atop upright branching stems, clad with stiff, lance-shaped, taper-pointed leaves, the colorful umbels give way to attractive seed pods in the fall, which persist into winter.", "url": "https://www.gardenia.net/plant/Asclepias-incarnata-Cinderella", "img_src": "/rendition.grid_lg/uploads/plant/1537997780-2b9a6eb341673d10c/Asclepias%20incarnata%20'Cinderella'%200000%20high%20resOptimized.jpg"}, {"name": "Aster novae-angliae (New England Asters)", "desc": "One of the tallest and most spectacular of the Asters!", "url": "/plant-variety/aster-novae-angliae-new-england-asters", "img_src": "/rendition.grid_lg/uploads/plant_family/1429547875-fe3bb0d6fb391a7ae/11192633456_9598db7aff_z.jpg"}, {"name": "Astilbe 'Jump and Jive'", "desc": "Free-flowering, Astilbe 'Jump and Jive' features luminous, dense, magenta-pink flower plumes which stand out and brighten up a shady spot in the garden.", "url": "https://www.gardenia.net/plant/astilbe-jump-and-jive", "img_src": "/rendition.grid_lg/jardin/images/main_picture_546f70746acb9.jpg"}, {"name": "Athyrium filix-femina (Lady Fern)", "desc": "Noted for its vigor and superb elegance, Athyrium filix-femina (Lady Fern) is a lovely deciduous fern forming a large rosette of upright to arching, lacy, lance-shaped, fresh-green fronds. The stems are generally green, but sometimes display a very interesting red hue.", "url": "https://www.gardenia.net/plant/Athyrium-Filix-Femina-Lady-Fern", "img_src": "/rendition.grid_lg/uploads/plant/1460233408-043508da07eb0f32b/botanikfoto-547070-L.jpg"}, {"name": "Baptisia x variicolor 'Twilite' (False Indigo)", "desc": "Unusually quick to mature for a Baptisia, three-year-old plants produce upward of 100 flowering racemes.", "url": "https://www.gardenia.net/plant/Baptisia-Twilite-False-Indigo", "img_src": "/rendition.grid_lg/uploads/plant/1461255350-bc2f643d28662935b/Baptisia%20Twilight-%20Chicolandgrows.jpg"}, {"name": "Betula platyphylla (Japanese White Birch)", "desc": "Betula platyphylla, commonly called Japanese white birch, is a medium to large sized tree noted for its white bark, thin spreading branches and slightly pendent branchlets.", "url": "https://www.gardenia.net/plant/Betula-platyphylla-Japanese-White-Birch", "img_src": "/rendition.grid_lg/uploads/plant/1471104984-f4021af3520ab801c/43805494_m.jpg"}, {"name": "Camassia leichtlinii 'Alba' (Camas)", "desc": "Camassia leichtlinii 'Alba' (Camas) is a bulbous perennial with tall spires packed with dozens of star-shaped, creamy-white flowers. Each flower has 6 showy tepals, a green center and attractive purple stamens. Borne on stout, willowy stems, they open sequentially from bottom to top for a long lasting display.", "url": "https://www.gardenia.net/plant/Camassia-Leichtlinii-Alba", "img_src": "/rendition.grid_lg/uploads/plant/1535814942-ec46ffb353403a1f3/botanikfoto-533544-L%20Optimized.jpg"}, {"name": "Campanula poscharskyana (Serbian Bellflower)", "desc": "Campanula portenschlagiana (Serbian Bellflower) is a low-growing, sprawling perennial forming mounds of flaring, star-shaped, pale violet-blue flowers, 1 in. across (2 cm). Blooming freely from late spring to early summer, masses of flowers are borne on spreading stems above a foliage of rounded, mid-green leaves. Semi-evergreen to evergreen in warm winter climates", "url": "https://www.gardenia.net/plant/Campanula-poscharskyana-Serbian-Bellflower", "img_src": "/rendition.grid_lg/uploads/plant/1508937641-276813c9cbe5e989c/PM121414%20Optimized.jpg"}, {"name": "Chamaecyparis pisifera 'Filifera Aurea' (Sawara Cypress)", "desc": "A very popular evergreen shrub noted for its gracefully weeping golden foliage, Chamaecyparis pisifera 'Filifera Aurea' (Sawara Cypress) is a dense, semi-dwarf conifer that slowly grows into a broad cone of open habit.", "url": "https://www.gardenia.net/plant/Chamaecyparis-Pisifera-Filifera-Aurea-Sawara-Cypress", "img_src": "/rendition.grid_lg/uploads/plant/1432216930-f64fa914263bb66a3/32931551_m.jpg"}, {"name": "Clematis 'Bill MacKenzie' (Tangutica Group)", "desc": "Regarded as the best Tangutica cultivar, award-winning Clematis 'Bill MacKenzie' is a large, vigorous deciduous climber with masses of small, nodding, lantern-shaped flowers, 2-3 in. across (6-7 cm). Each bloom boasts four slightly glossy, bright yellow tepals which gradually open out wide, revealing a contrasting boss of dark stamens.", "url": "https://www.gardenia.net/plant/clematis-Bill-MacKenzie", "img_src": "/rendition.grid_lg/uploads/plant/1493158597-2683dcadca2495730/rosem0906-005.jpg"}, {"name": "Clematis 'Giselle' (Large-Flowered Clematis)", "desc": "Incredibly beautiful, Clematis 'Giselle' is a compact, deciduous climber which produces masses of large, star-shaped, rosy-pink flowers, up to 5 in. wide (12 cm), with dark contrasting stamens. Blooming from late spring until fall, this large-flowered clematis is perfect for containers, small trellises or obelisks.", "url": "https://www.gardenia.net/plant/clematis-Giselle", "img_src": "/rendition.grid_lg/uploads/plant/1517236675-5fd51f92ee3cb3dd7/PM131738%20Optimized.jpg"}, {"name": "Clematis 'Perle d'Azur' (Late Large-Flowered Clematis)", "desc": "Vigorous and extremely floriferous! Clematis 'Perle d'Azur' is one of the best blue clematis with its large, sky blue flowers, about 4\" wide (10 cm), flushed purple with a touch of pink near the base of each petal and light green stamens.", "url": "https://www.gardenia.net/plant/clematis-perle-dazur", "img_src": "/rendition.grid_lg/uploads/plant/1492100718-1cad945a8d4cb9860/_JWW1600.jpg"}, {"name": "Clematis - Atragene Group", "desc": "The Atragene group of clematis includes early and small-flowering clematis, which are extremely hardy, undemanding and among the easiest to grow.", "url": "/plant-variety/clematis-Atragene-group", "img_src": "/rendition.grid_lg/uploads/plant_family/1492612203-e2e70362434b6e90e/45008229_m.jpg"}, {"name": "Coneflowers (Echinacea): Gems in the Garden", "desc": "Tough as nails, Coneflowers (Echinacea) are wonderful additions to the landscape with their brightly colored blossoms to be enjoyed over a long flowering season. Simple to grow, trouble-free, thriving on neglect, they are reliable performers that are tole", "url": "/plant-variety/coneflowers-echinacea-gems-in-the-garden", "img_src": "/rendition.grid_lg/uploads/plant_family/1428335473-6f9330239aa476c2a/botanikfoto-474463-L.jpg"}, {"name": "Cornus sericea subsp. Occidentalis 'Sunshine' (Dogwood)", "desc": "Noted for its dazzling golden foliage and outstanding bright red winter stems, Cornus sericea subsp. occidentalis 'Sunshine' (Dogwood) is a multi-stemmed, suckering, deciduous shrub of great ornamental value in the landscape.", "url": "https://www.gardenia.net/plant/Cornus-Sericea-subsp-Occidentalis-Sunshine-Dogwood", "img_src": "/rendition.grid_lg/uploads/plant/1469728195-7725d2de9242d4cac/Cornus%20sericea%20subsp%20orientalis%20Sunshine.jpg"}, {"name": "Crocus chrysanthus 'Goldilocks' (Snow Crocus)", "desc": "As suggested by its name, Crocus chrysanthus 'Goldilocks' is a very showy Snow Crocus with intense, golden yellow flowers, adorned with dark purplish-brown feathering on their outer tepals. Its grass-like foliage features narrow, dark green leaves with a very thin central silver stripe. Introduced in 1950, this crocus is slightly scented and will lift the spirits of winter-weary gardeners.", "url": "https://www.gardenia.net/plant/crocus-chrysanthus-Goldilocks-bronze", "img_src": "/rendition.grid_lg/uploads/plant/1506622910-2a62a66e24e7b762a/77414273_mOptimized.jpg"}, {"name": "Cyclamen coum 'Tilebarn Elizabeth' (Persian Violet)", "desc": "One of the brightest jewels of the winter border, Cyclamen coum 'Tilebarn Elizabeth' is a vigorous and delightful tuberous perennial with lovely rounded pewter leaves and small but showy bicolor flowers. Pale pink verging toward white, the luminous blooms are delicately edged in rich rose-red and adorned with a dark blotch at the bottom of each petal.", "url": "https://www.gardenia.net/plant/Cyclamen-coum-Tilebarn-Elizabeth", "img_src": "/rendition.grid_lg/uploads/plant/1469644153-2997236320420845a/Cyclamen-23854-Lo-Res.jpg"}, {"name": "Dianthus 'Coconut Punch' (Pink)", "desc": "Very compact and free flowering, Dianthus 'Coconut Punch' (Pink) is an eye-catching evergreen perennial with masses of fragrant, fully double, deep red flowers, up to 2 in. across (5 cm), adorned with white markings in the center of each petal. As the flowers mature, the white markings expand and the red color lightens, leaving a wine colored ring around each petal.", "url": "https://www.gardenia.net/plant/Dianthus-Coconut-Punch", "img_src": "/rendition.grid_lg/uploads/plant/1523294226-ea72cabfb72466679/dianthus_coconut_punch_1Optimized.jpg"}, {"name": "Diospyros virginiana (American Persimmon)", "desc": "Diospyros virginiana (American Persimmon) is a deciduous tree with a spreading crown and pendulous branches clothed in glossy green, oval leaves, 6 in. long (15 cm). They turn yellow, pink or reddish-purple in the fall, creating a glorious display. In late spring to early summer, fragrant, bell-shaped, yellow flowers are hidden by the half-grown leaves.", "url": "https://www.gardenia.net/plant/Diospyros-virginiana", "img_src": "/rendition.grid_lg/uploads/plant/1553533604-90e5c30d55a0fbc66/shutterstock_731497825Optimized.jpg"}, {"name": "Echinacea 'Sensation Pink' (Coneflower)", "desc": "Noted for its short stature, Echinacea 'Sensation Pink' is a dwarf Coneflower that stands out with its profusion of large, intense pink flowers, 3 in. across (7 cm), adorned with flat, hot magenta pink ray petals surrounding a dark chocolate central cone. As they mature, the vibrant blossoms turn to softer lavender pink shades. Well branched, its numerous dark flowering stems are sturdy and held upright.", "url": "https://www.gardenia.net/plant/echinacea-Sensation-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1521137201-6f3895a603c5f9e33/Echinacea%20'Sensation%20Pink'2Optimized.jpg"}, {"name": "Echinacea purpurea 'Razzmatazz' (Coneflower)", "desc": "Incredibly eye-catching and popular, Echinacea 'Razzmatazz' is an exquisite beauty with its pom-pom double Coneflowers! Well-branched, 'Razzmatazz' produces abundant magenta-purple flowers with drooping rays that stick out from a rose-pink central pompon like a formal pink pettiskirt.", "url": "https://www.gardenia.net/plant/Echinacea-Purpurea-Razzmatazz-coneflower", "img_src": "/rendition.grid_lg/uploads/plant/1456777867-c91e9b717a447d994/botanikfoto-534506-L.jpg"}, {"name": "Eryngium planum 'Blue Cap' (Flat Sea Holly)", "desc": "Eryngium Planum 'Blue Cap' (Flat Sea Holly) is a clump-forming perennial with a profusion of small, steel-blue flowers, tightly packed into egg-shaped heads, that light up the garden throughout summer. Each flower is adorned with a spiky collar of narrow bracts.", "url": "https://www.gardenia.net/plant/eryngium-planum-blue-cap", "img_src": "/rendition.grid_lg/uploads/plant/1548497004-b71742d8a29c19b39/12520188_s%20Optimized.jpg"}, {"name": "Euonymus atropurpureus (Eastern Wahoo)", "desc": "Noted for its very ornamental red berries and attractive fall color, Euonymus  atropurpureus (Eastern Wahoo) is a very adaptable, upright, spreading, deciduous shrub or small tree.", "url": "https://www.gardenia.net/plant/Euonymus-Atropurpureus-Eastern-Wahoo", "img_src": "/rendition.grid_lg/uploads/plant/1443442808-40031630c02d0ddb3/15481496678_27c958b69e_z.jpg"}, {"name": "Fosteriana Tulips", "desc": "Tulipa fosteriana is a wild species found in the mountainous areas of Central Asia. Although no longer being cultivated, numerous beautiful cultivars developed from it are still marketed. They differ from one another in height, but all have solitary, bowl-shaped flowers, 5 in. wide (12 cm), with a slender shape and large, sometimes striped, leaves. These tulips generally naturalize easily and come back year after year in the garden. They are well-suited to mixed borders and create impressive bedding displays. Bloom in early-mid spring.", "url": "/plant-variety/fosteriana-tulips", "img_src": "/rendition.grid_lg/uploads/plant_family/1537102690-f59ffc2120a3a1d14/10922Optimized.jpg"}, {"name": "Fritillaria persica 'Adiyaman' (Persian Lily)", "desc": "Taller and more free-flowering than the species, Fritillaria persica 'Adiyaman' is a vigorous bulbous perennial which grows up to 2-3 ft. tall (60-90 cm), in a beautiful display of racemes of pendent, bell-shaped, rich plum purple flowers. Blooming in mid to late spring, each stem may carry up to 30 flowers. This beautiful scenery is complimented by lanceolate, gray-green leaves.", "url": "https://www.gardenia.net/plant/fritillaria-persica-Adiyaman", "img_src": "/rendition.grid_lg/uploads/plant/1533281297-35f8f07ae66c4f034/Fritillaria%20persica%20Optimized.jpg"}, {"name": "Galanthus nivalis F. pleniflorus 'Flore Pleno' (Double Snowdrop)", "desc": "Robust and incredibly attractive, Galanthus nivalis 'Flore Pleno' is a double snowdrop, which produces dainty, nodding white flowers, 1 in. long (2.5 cm), delicately marked with a green spot at the apex of each petal.", "url": "https://www.gardenia.net/plant/galanthus-nivalis-Flore-Pleno-snowdrop", "img_src": "/rendition.grid_lg/uploads/plant/1470175393-a51f1542adf47855f/Galanthus%20nivalis%20%20f.%20pleniflorus%20‘Flore%20Pleno’2.jpg"}, {"name": "Geranium pratense 'Plenum Violaceum' (Meadow Cranesbill)", "desc": "An exquisite double flowered variety of Meadow Cranesbill, award-winning Geranium pratense 'Plenum Violaceum' is incredibly beautiful. It forms dense mounds of jaggedly-lobed, dark green leaves, topped in late spring - midsummer with profuse and very attractive, double violet-blue blossoms delicately flushed purple at their heart", "url": "https://www.gardenia.net/plant/geranium-pratense-plenum-violaceum-meadow-cranesbill", "img_src": "/rendition.grid_lg/jardin/images/main_picture_545680033c4aa.jpg"}, {"name": "Hamamelis (Witch Hazel)", "desc": "Hardy, low maintenance, and ignored by most pests, Hamamelis (Witch Hazel) are deciduous shrubs or small trees of great beauty, particularly when their showy, fragrant flowers are on full display.", "url": "/plant-variety/hamamelis-witch-hazel", "img_src": "/rendition.grid_lg/uploads/plant_family/1474228644-786b4e8aa4b018bc3/53616213_m.jpg"}, {"name": "Helianthemum 'Red Dragon' (Rock Rose)", "desc": "Helianthemum 'Red Dragon' (Rock Rose or Sun Rose) is a charming low-growing evergreen subshrub resembling a flower carpet in late spring to late summer. Abundant, showy, saucer-shaped, bright red flowers, 1 in. across (3 cm), adorned with a boss of central yellow stamens literally smother the plant.", "url": "https://www.gardenia.net/plant/Helianthemum-Red-Dragon-Rock-Rose", "img_src": "/rendition.grid_lg/uploads/plant/1464291041-f8ff85ea217d163f7/Helianthemum-Red-Dragon-30416ch.jpg"}, {"name": "Helianthus strumosus (Woodland Sunflower)", "desc": "Helianthus strumosus (Woodland Sunflower) is a showy perennial with narrow, oval leaves, white underneath, and a profusion yellow flowers, 2-4 in. across (5-10 cm), each adorn with up to 8-20 yellow rays and a yellow center disk. They are held in loose clusters of 3-15 blossoms at the branch tips", "url": "https://www.gardenia.net/plant/Helianthus-strumosus", "img_src": "/rendition.grid_lg/uploads/plant/1547669676-115090cee1f7ff5fe/shutterstock_1243619077Optimized.jpg"}, {"name": "Hemerocallis 'Africa' (Reblooming Daylily)", "desc": "Hemerocallis 'Africa' is a late midseason Daylily which produces profuse blooms of large, 5 in. wide (12 cm), rich dark red to nearly black-red trumpets with contrasting bright tangerine-orange throats.", "url": "https://www.gardenia.net/plant/hemerocallis-Africa-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1518789501-db2c97dab47110240/1935898_mOptimized.jpg"}, {"name": "Hemerocallis 'Cherry Cheeks' (Daylily)", "desc": "Hemerocallis 'Cherry Cheeks' is a late midseason Daylily which produces profuse blooms of large, 6 in. wide (15 cm), rose-pink trumpets with pale pink midribs and golden-orange throats with matching stamens.", "url": "https://www.gardenia.net/plant/hemerocallis-Cherry Cheeks-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452174448-91d5ecbefdf744921/Hemerocallis-Cherry-Cheeks-1767.jpg"}, {"name": "Hemerocallis 'Hyperion' (Daylily)", "desc": "Sweetly fragrant, Hemerocallis 'Hyperion' is a radiant midseason Daylily which produces an abundance of small, canary-yellow flowers with delicate green throats.", "url": "https://www.gardenia.net/plant/hemerocallis-Hyperion-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452875213-6b0213704e678d023/24165938_m.jpg"}, {"name": "Hemerocallis 'Nona's Garnet Spider' (Daylily)", "desc": "A striking red spider selection, Hemerocallis 'Nona's Garnet Spider' is a midseason Daylily which produces large, open, brilliant garnet red, starry blossoms, 6.5 in. wide (16 cm), with a contrasting golden-yellow throat.", "url": "https://www.gardenia.net/plant/hemerocallis-Nonas-Garnet-Spider-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452640432-7ff680093f013660b/43562923_m.jpg"}, {"name": "Hemerocallis 'Sammy Russell' (Daylily)", "desc": "A striking Heirloom selection, Hemerocallis 'Sammy Russell' is a late season Daylily which produces dark crimson-red, starry blossoms with golden-yellow throats, atop a mound of arching leaves.", "url": "https://www.gardenia.net/plant/hemerocallis-Sammy-Russell-daylily", "img_src": "/rendition.grid_lg/uploads/plant/1452692060-5106f97106fffdc6f/4451734_m.jpg"}, {"name": "Heuchera 'Caramel' (Coral Bells)", "desc": "More tolerant of hot and humid summers than most heucheras, 'Caramel' is an exceptionally pretty variety of Coral Bells with a unique foliage of rounded leaves, emerging gray-red in spring and maturing to apricot-caramel with burgundy-red undersides by summer.", "url": "https://www.gardenia.net/plant/heuchera-caramel-coral-bells", "img_src": "/rendition.grid_lg/uploads/plant/1426713784-1bbf73941f5cf9e53/botanikfoto-517448-L.jpg"}, {"name": "Heuchera 'Peach Crisp' (Coral Bells)", "desc": "With bright peach color all summer long, Heuchera 'Peach Crisp' is a lovely variety of Coral Bells for the garden. It creates tight mounds of heavily ruffled foliage, emerging pinkish-red, then fading to shades of peach or apricot, and finally turning green.", "url": "https://www.gardenia.net/plant/heuchera-peach-crisp-coral-bells", "img_src": "/rendition.grid_lg/uploads/plant/1430482718-9705f80faf4aa14be/Heuchera_Peach_Crisp_1b.jpg"}, {"name": "Hibiscus moscheutos 'Southern Belle' (Hardy Hibiscus)", "desc": "Particularly cold-hardy, Hibiscus moscheutos 'Southern Belle' (Hardy Hibiscus) is a compact and well-branched shrub noted for its huge flowers with overlapping petals, 10 in. across (25 cm), in various colors including of pink, rose, red and white. Blooming continuously from mid to late summer, the gigantic flowers display conspicuous, protruding, creamy-white to pale yellow tubes of stamens. Each flower lasts about 1-2 days, but new flowers open each day in rapid succession until late in the season. They contrast nicely against the bold, ovate, toothed leaves.", "url": "https://www.gardenia.net/plant/Hibiscus-moscheutos-Southern-Belle", "img_src": "/rendition.grid_lg/uploads/plant/1529934216-83a1985ad06364666/Hibiscus%20Southern%20Belle%20Optimized.jpg"}, {"name": "Hosta 'Fire Island' (Plantain Lily)", "desc": "Prized for its brilliant foliage and stems, Hosta 'Fire Island' (Plantain Lily) is a fabulous addition to shady areas where it forms an attractive, dense mound of widely oval, heart-shaped, glowing, pale yellow leaves when they first emerge, then turning to chartreuse. Shiny above and matt below, the luminous foliage contrasts beautifully with the bright red stems, which keep their bold color throughout the season.", "url": "https://www.gardenia.net/plant/hosta-Fire-Island-plantain-lily", "img_src": "/rendition.grid_lg/uploads/plant/1511964260-5cc92930d7d57aa23/PM121575Optimized.jpg"}, {"name": "Hosta 'Rainforest Sunrise' (Plantain Lily)", "desc": "Small and attractive, Hosta 'Rainforest Sunrise' (Plantain Lily) forms a compact mound of widely oval, prominently veined, chartreuse to yellow leaves, widely margined bright dark green. The contrast between the bright center and the dark green margins is particularly lovely as it resembles a hand painted pattern. Thick and glossy, the leaves hold up well all season, and are also slug resistant.", "url": "https://www.gardenia.net/plant/Hosta-Rainforest-Sunrise", "img_src": "/rendition.grid_lg/uploads/plant/1521220150-d5ecbe3705e54b0c2/Hosta%20'Rainforest%20Sunrise'Optimized.jpg"}, {"name": "Hosta undulata var. undulata (Wavy Plantain Lily)", "desc": "Drawing attention, award-winning Hosta undulata var. undulata (Wavy Plantain Lily) is a clump-forming perennial forming a pretty mound of lance-shaped, intriguingly twisted, deeply channeled, mid-green leaves adorned with creamy-white markings. The leaves are thin, but leathery and nicely wavy-margined. Racemes of funnel-shaped, mauve flowers appear in early to mid summer on arching scapes rising above the foliage mound to 32 in. tall (80 cm). A terrific Hosta to brighten up shady borders and containers.", "url": "https://www.gardenia.net/plant/hosta-undulata-var-undulata", "img_src": "/rendition.grid_lg/uploads/plant/1532205762-32980ed555088af2a/PL111252Optimized.jpg"}, {"name": "Hyacinthus orientalis 'Pink Festival' (Dutch Hyacinth)", "desc": "Up to 6 flower spikes per bulb! 'Pink Festival' features soft pink flowers with slightly paler edges", "url": "https://www.gardenia.net/plant/hyacinthus-orientalis-pink-festival-dutch-hyacinth", "img_src": "/rendition.grid_lg/uploads/plant/1426005726-2626820b753aca9dd/main_picture_53ea26c6c7b85.jpg"}, {"name": "Hypericum kalmianum 'Cobalt-n-Gold' (Kalm St. John's Wort)", "desc": "Noted for its silver-green foliage, Hypericum kalmianum 'Cobalt-n-Gold' (Kalm St. John's Wort) is a shrub of dense, neatly rounded habit with showy, golden yellow flowers in late spring or early summer. They are borne in flat clusters at the tips of upright branching stems and blanket the shrub. Each cup-shaped flower presents 5 petals surrounding a prominent tuft of golden stamens.", "url": "https://www.gardenia.net/plant/Hypericum-Kalmianum-Cobalt-n-Gold", "img_src": "/rendition.grid_lg/uploads/plant/1549442852-ee17834e17c122890/hypercobaltngold1%20Optimized.jpg"}, {"name": "Iris 'About Town' (Bearded Iris)", "desc": "Ravishingly beautiful, Iris 'About Town' is a sumptuous Tall Bearded Iris ruffled and laced to perfection. The sumptuous flowers feature silvery mauve to silvery lilac standards sitting on a wine-red violet skirt delicately edged with a lilac ribbon", "url": "https://www.gardenia.net/plant/iris-IAbout-Town-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1447697974-96fcf35fe69133eb4/4960047_m.jpg"}, {"name": "Iris 'Clarence' (Reblooming Bearded Iris)", "desc": "Reblooming, fragrant and good looking! Iris 'Clarence' is a striking Tall Bearded Iris with white standards tinted violet contrasting with the light blue-violet falls and creamy beard.", "url": "https://www.gardenia.net/plant/iris-clarence-reblooming-bearded-iris", "img_src": "/rendition.grid_lg/jardin/images/main_picture_521f7d7c702f6.jpg"}, {"name": "Iris 'Imperial Reign' (Bearded Iris)", "desc": "As compellingly attractive as royalty, 'Imperial Reign' is a striking midseason bearded iris with large gently ruffled, deep lavender blooms which gloriously contrast against the bright tangerine beards.", "url": "https://www.gardenia.net/plant/iris-Imperial-Reign-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1450375268-88eeedb799b99d0da/imperialreign_web1.jpg"}, {"name": "Iris 'Queen's Circle' (Bearded Iris)", "desc": "Regarded as an outstanding Iris by most Iris experts, Iris 'Queen's Circle' is exquisitely beautiful, almost 'perfect' with its ruffled, pristine white standards, elegantly sitting atop large white ruffled falls, boldly edged with a pale blue to rich violet ribbon and conspicuous yellow-orange beards.", "url": "https://www.gardenia.net/plant/iris-queens-circle-bearded-iris", "img_src": "/rendition.grid_lg/jardin/images/main_picture_5445387d660b7.jpg"}, {"name": "Iris 'Venita Faye' (Bearded Iris)", "desc": "Multiple award-winning Iris 'Venita Faye' is exceptionally beautiful with its pale pink standards, soft lilac falls which pale in the center, and light coral beards delicately white tipped. Nicely ruffled, the blossoms of this spectacular Bearded Iris never fail to draw attention", "url": "https://www.gardenia.net/plant/iris-venita-faye-bearded-iris", "img_src": "/rendition.grid_lg/uploads/plant/1429130263-6cbf503d500f18d0c/venitafaye_web1.jpg"}, {"name": "Iris sibirica 'Blueberry Fair' (Siberian Iris)", "desc": "Adding drama in the garden, Iris sibirica 'Blueberry Fair' (Siberian Iris) is a clump-forming perennial with heavily ruffled, rich blue flowers adorned with a white signal. Blooming in late spring to early summer, the blossoms rise atop sturdy flower stalks, well above the foliage. After blooming, theÂ upright, blue-green, narrow and fairly rigid, blade-shaped leaves remain fresh-looking all season.", "url": "https://www.gardenia.net/plant/iris-sibirica-Blueberry-Fair-siberian-iris", "img_src": "/rendition.grid_lg/uploads/plant/1516133962-9435887487d32ac55/Iris%20sibirica%20'Blueberry%20Fair'Optimized.jpg"}, {"name": "Jonquilla Narcissus Group", "desc": "Loved since the 17th century, Jonquil Daffodils produce small flowers, 3 or more per stem, with short, wide petals held at right angles to cups. The cup of these daffodils is not that large: usually half the length of the petals. Strongly fragrant, their foliage is often rush like. Blooming in mid-late spring, they are excellent for naturalizing and prefer sunny locations, warm soils and humid conditions. Their heady fragrance has seduced many generations of gardeners.", "url": "/plant-variety/jonquilla-narcissus-group", "img_src": "/rendition.grid_lg/uploads/plant_family/1536847086-ee70fb800307a9890/Narcissus%20PuebloOptimized.jpg"}, {"name": "Kerria japonica 'Pleniflora' (Japanese Kerria)", "desc": "Noted for its green winter stems and yellow spring flowers, Kerria japonica 'Pleniflora' (Japanese Kerria) is a vigorous suckering deciduous shrub of great beauty. In spring, it gets covered with bright yellow, pom-pom-like flowers, 2 in. across (5 cm). Borne on slender, arching stems, the blossoms resemble small roses.", "url": "https://www.gardenia.net/plant/Kerria-japonica-Pleniflora-Japanese-Kerria", "img_src": "/rendition.grid_lg/uploads/plant/1498759463-7116eb85ce3c2da1c/13241127_m.jpg"}, {"name": "Lathyrus odoratus 'Painted Lady' (Sweet Pea)", "desc": "Strongly scented, Lathyrus odoratus 'Painted Lady' is a vigorous climbing annual with striking bi-color flowers. Each pretty blossom is adorned with a deep rose standard, pale rose wings and a pure white keel, creating a brilliant display. Dating back to 1752, this Grandiflora Sweet Pea begins flowering earlier than other Sweet Pea varieties. Today, this heirloom continues to be a wonderful addition to the garden and is perfect for containers where its heavenly scent can be enjoyed.", "url": "https://www.gardenia.net/plant/Lathyrus-Odoratus-Painted-Lady", "img_src": "/rendition.grid_lg/uploads/plant/1537629881-26702fb3982cbf1d0/63639Optimized.jpg"}, {"name": "Lilium 'African Queen' (Trumpet Lily)", "desc": "Deliciously fragrant, award-winner Lilium 'African Queen' is a fascinating Trumpet Lily with huge, bright apricot-orange trumpets marked with garnet-brown on the outside.", "url": "https://www.gardenia.net/plant/lilium-african-queen-lily", "img_src": "/rendition.grid_lg/uploads/plant/1427290942-5b9f86d1a97792e5f/6_25i.jpg"}, {"name": "Lilium 'Pollyanna' (Asiatic Lily)", "desc": "Lilium 'Pollyanna' is a fascinating Asiatic Lily with showy, upward-facing, wide-open flowers with bright yellow petals adorned with a pink flushed throat. Amazingly decorative, this tremendous LilyÂ will add drama to your garden and brighten it up!", "url": "https://www.gardenia.net/plant/lilium-Pollyanna-lily", "img_src": "/rendition.grid_lg/uploads/plant/1462479273-b684d2232b89fcad8/Asiatic-Lily-Pollyanna-29618.jpg"}, {"name": "Lily-Flowered Tulips", "desc": "Incredibly elegant, graceful and beautiful! What makes Lily-Flowered Tulips different from other tulip varieties are their slender flowers with often pointed, recurving petals.", "url": "/plant-variety/lily-flowered-tulips", "img_src": "/rendition.grid_lg/uploads/plant_family/1505923272-90fd78bc2e6cfa38b/1536770_m.jpg"}, {"name": "Lupinus 'Gallery White' (Lupine)", "desc": "A beautiful dwarf Lupine, Lupinus 'Gallery White' (Lupine) is a popular selection featuring showy, erect spikes of densely packed, sweetly scented, pure white flowers in late spring - early summer.", "url": "https://www.gardenia.net/plant/lupinus-Gallery-White-lupine", "img_src": "/rendition.grid_lg/uploads/plant/1539180611-f2930bf78fbaf459d/71370806_sOptimized.jpg"}, {"name": "Magnolia denudata 'Forrest's Pink' (Yulan Magnolia)", "desc": "Hardy and incredibly pretty, Magnolia denudata 'Forrest's Pink' is a small deciduous tree with exquisite, bubble gum pink flowers, flushed deeper pink at the base of their tepals. Upright and cup-shaped when borne, the fragrant flowers, 4-8 in. long (10-20 cm), gracefully open their 9-11 tepals as they mature, resembling lilies.", "url": "https://www.gardenia.net/plant/Magnolia-denudata-Forrests-Pink-Yulan-Magnolia", "img_src": "/rendition.grid_lg/uploads/plant/1477937422-3388caaa2fca77548/DP8269%20Magnolia%20denudata%20Forrests%20Pink.jpg"}, {"name": "Malus 'Ruby Tears' (Crabapple)", "desc": "Malus 'Ruby Tears' is a dense deciduous tree of rounded form with gracefully weeping branches over a long season of interest. Opening from red buds, masses of fragrant, pink blossoms appear in mid spring, just as the foliage is unfolding. Draped in clusters along the cascading branches, they provide a wonderful floral display.", "url": "https://www.gardenia.net/plant/Malus-Ruby-Tears", "img_src": "/rendition.grid_lg/uploads/plant/1539701652-0b138010df36a7512/2848_2Optimized.jpg"}, {"name": "Malus × scheideckeri 'Red Jade' (Crabapple)", "desc": "An outstanding Crabapple, Malus 'Red Jade' is a small deciduous tree with gracefully weeping branches over a long season of interest. Opening from pink buds, masses of fragrant, white, single flowers appear in mid spring, just as the foliage is unfolding.", "url": "https://www.gardenia.net/plant/Malus-scheideckeri-Red-Jade", "img_src": "/rendition.grid_lg/uploads/plant/1540036555-c6ba31d6d19a6a1a6/53036789_s%20Optimized.jpg"}, {"name": "Monarda 'Leading Lady Orchid' (Bee Balm)", "desc": "Compact and early flowering, Monarda 'Leading Lady Orchid' (Bee Balm) is a clump-forming, densely branched perennial which produces orchid pink flowers, borne in dense, globular terminal heads. A fine mist of fuchsia spots appears on the open petals. Blooming for weeks from early to mid summer, they rest upon a whorl of decorative bracts and attract scores of butterflies and hummingbirds.", "url": "https://www.gardenia.net/plant/monarda-Leading-Lady-Orchid", "img_src": "/rendition.grid_lg/uploads/plant/1549099702-4d51cc75cd05ee448/Monarda%20'Leading%20Lady%20Orchid'%20PPAF%20CPBRAF%200000%20high%20res%20Optimized.jpg"}, {"name": "Muscari armeniacum 'Saffier' (Grape Hyacinth)", "desc": "Late flowering Muscari with an unusual long-lasting display. Award-winner Muscari armeniacum 'Saffier' features densely packed racemes with violet-blue buds and green tips.", "url": "https://www.gardenia.net/plant/muscari-armeniacum-saffier-grape-hyacinth", "img_src": "/rendition.grid_lg/uploads/plant/1427669266-c4bdbfdc009db1e08/203764%20(1).jpg"}, {"name": "Narcissus 'Flower Drift' (Double Daffodil)", "desc": "Rich of a spicy fragrance, Narcissus 'Flower Drift' features large, fully double flowers, 4 in. across (10 cm), adorned with multiple creamy-white petals surrounding a warm orange-yellow center. Blooming in early-mid spring, one flower per stem, this Double Daffodil is a good naturalizer.", "url": "https://www.gardenia.net/plant/narcissus-flower-drift-double-daffodil", "img_src": "/rendition.grid_lg/uploads/plant/1536777459-46a68d9577e4cc91a/30057Optimized.jpg"}, {"name": "Narcissus 'Quail' (Jonquil Daffodil)", "desc": "Noted for its rich color and great fragrance, award-winner Narcissus 'Quail' is a delightful jonquil daffodil boasting up to 2-4 sweetly fragrant, bright deep golden-yellow flowers per stem, 2.5 in. across (4 cm), in mid spring. Vigorous and floriferous, this popular, bold bloomer naturalizes easily and is suitable for pots and containers, borders and rock gardens.", "url": "https://www.gardenia.net/plant/Narcissus-Quail", "img_src": "/rendition.grid_lg/uploads/plant/1536135548-08779ca28be156676/5662070_s%20Optimized.jpg"}, {"name": "Narcissus 'White Lion' (Double Daffodil)", "desc": "Multiple award-winning Narcissus 'White Lion' is sweetly fragrant and sturdy with blossoms resembling gardenias! It features long-lasting, double flowers with multiple creamy-white petals surrounding a warm yellow center. Blooming in mid to late spring, this strong and reliable heirloom Daffodil was introduced in the 1940s and is still a favorite.", "url": "https://www.gardenia.net/plant/narcissus-white-lion-double-daffodil", "img_src": "/rendition.grid_lg/uploads/plant/1536782252-e29d62ffa266c965e/3072%20Narcissus%20White%20LionOptimized.jpg"}, {"name": "Osmunda regalis (Royal Fern)", "desc": "Noted for its unique form and texture, Osmunda regalis (Royal Fern or Flowering Fern) is a tall, robust, deciduous fern forming a large rosette of elegant, broadly divided, bright green fronds.", "url": "https://www.gardenia.net/plant/Osmunda-Regalis-Royal-Fern", "img_src": "/rendition.grid_lg/uploads/plant/1547559135-372686ec820c869f1/42495407_mOptimized.jpg"}, {"name": "Paeonia 'Golden Glow' (Peony)", "desc": "A very pretty Hybrid Peony, award-winner 'Golden Glow' produces eye-catching, single, glossy scarlet-orange flowers. Cup-shaped, the large petals surround a center filled with bright golden-yellow stamens.", "url": "https://www.gardenia.net/plant/paeonia-Golden-Glow-peony", "img_src": "/rendition.grid_lg/uploads/plant/1449859973-aa7b09d6d45e4c9c2/43121516_m.jpg"}, {"name": "Paeonia (Peonies)", "desc": "Beloved for their abundant blooms, the beauty of their exquisite flowers, their delightful fragrance, and their bold foliage changing shades over the seasons, peony flowers add a dazzling splash of color in the landscape.", "url": "/plant-variety/peonies-all-you-need-to-know", "img_src": "/rendition.grid_lg/uploads/guide/1426176326-0535453d48b5bcf1e/23516889_m.jpg"}, {"name": "Paeonia lactiflora 'Honey Gold' (Peony)", "desc": "Delightfully fragrant, Peony 'Honey Gold' (Paeonia lactiflora) produces unique Japanese form flowers with large creamy white guard petals surrounding a prominent center of golden-yellow petaloids, out of which further bloom creamy-white petaloids.", "url": "https://www.gardenia.net/plant/paeonia-lactiflora-Honey-Gold-peony", "img_src": "/rendition.grid_lg/uploads/plant/1449877774-24dddc1ea4390edaa/14274223_m.jpg"}, {"name": "Paeonia lactiflora 'Sword Dance' (Peony)", "desc": "A peony of striking Japanese form, Peony 'Sword Dance' produces large, brilliant flowers with magenta-red petals surrounding an impressive center of golden-yellow staminodes streaked with red.", "url": "https://www.gardenia.net/plant/paeonia-lactiflora-Sword-Dance-peony", "img_src": "/rendition.grid_lg/uploads/plant/1449509866-4d619c8016b2ae974/42379311_m.jpg"}, {"name": "Papaver orientale 'Royal Wedding' (Oriental Poppy)", "desc": "Oriental Poppy 'Royal Wedding' (Papaver orientale) is quite a highlight in the garden with its large, crepe papery, cup-shaped, white flowers with a dark eye and black splotches at their base. Planted in small groups, its satiny blossoms will steal the show and draw the attention from late spring to early summer!", "url": "https://www.gardenia.net/plant/Papaver-orientale-Royal-Wedding", "img_src": "/rendition.grid_lg/uploads/plant/1519286150-e30713461d6a5a01e/Papaver%20'Royal%20Wedding'%20Optimized.jpg"}, {"name": "Petunia 'Easy Wave Silver'", "desc": "Petunia 'Easy Wave Silver' is a mound forming, spreading annual or perennial boasting masses of silvery-white flowers from late spring to the first frosts. Fast-growing and blooming freely all season, this Petunia is dense and full, making it perfect to quickly cover a large area in the garden, or to gracefully cascade from baskets and containers.", "url": "https://www.gardenia.net/plant/Petunia-Easy-Wave-Silver", "img_src": "/rendition.grid_lg/uploads/plant/1556095385-8cce52f565740d612/Spreading_Petunia_Easy_Wave_Silver_Bloom_11836%20Optimized.jpg"}, {"name": "Petunia 'Supertunia Royal Magenta'", "desc": "Petunia 'Supertunia Royal Magenta' is a mounding trailing annual or perennial boasting masses of bright magenta-purple flowers from late spring to the first frosts. Vigorous and blooming freely all season, this Petunia is perfect for the front of flower beds. It is terrific in containers or hanging baskets, where it can function as a filler or trail gracefully over the edges. Heat and drought tolerant, it attracts hummingbirds and is wonderful for creating a dazzling display through the summer.", "url": "https://www.gardenia.net/plant/Petunia-Supertunia-Royal-Magenta", "img_src": "/rendition.grid_lg/uploads/plant/1556294281-adcbb1adbb86ae2a2/supertunia_royal_magenta_improved_tag%20Optimized.jpg"}, {"name": "Phlox paniculata 'Jeana' (Garden Phlox)", "desc": "Noted for having excellent resistance to powdery mildew, Phlox paniculata 'Jeana' is an herbaceous perennial with large, tiered clusters of small, lavender-pink flowers. Blooming for weeks from mid summer to early fall, the fragrant flowers are rich of nectar and visited by hummingbirds and butterflies.", "url": "https://www.gardenia.net/plant/phlox-paniculata-Jeana-garden-phlox", "img_src": "/rendition.grid_lg/uploads/plant/1512757627-20e6522f768f9d780/7_29d%20Phlox%20paniculata%20‘Jeana’%20perfumes%20the%20Entrance%20Circle%20with%20lavender-pink%20blossoms.Optimized.jpg"}, {"name": "Physalis alkekengi var. franchetii (Chinese Lantern)", "desc": "Mostly grown for its luminous papery lanterns, Physalis alkekengi var. franchetii (Chinese Lantern) is a vigorous, spreading herbaceous perennial with ovate green leaves and small, starry, creamy-white flowers in summer. In the fall, the blossoms give way to edible berries that are enclosed in large, glowing orange, paper-like, Chinese lantern calyces.", "url": "https://www.gardenia.net/plant/Physalis-alkekengi-var-franchetii", "img_src": "/rendition.grid_lg/uploads/plant/1520964131-0f50bb3641810a58c/52213396_mOptimized.jpg"}, {"name": "Picea pungens 'Edith' (Colorado Spruce)", "desc": "Particularly attractive, Picea pungens 'Edith' (Colorado Spruce) is an evergreen tree of conical habit with layered horizontal branches densely clothed in long, icy-blue to silver needles. The younger needles are more silver, while the older needles tend towards dark green.", "url": "https://www.gardenia.net/plant/Picea-pungens-Edith", "img_src": "/rendition.grid_lg/uploads/plant/1548402286-c58506678211a2196/shutterstock_737391346Optimized%20Optimized.jpg"}, {"name": "Pinus sylvestris 'Glauca' (Scotch Pine)", "desc": "Picturesque, Pinus sylvestris 'Glauca'(Scotch Pine) is a slow-growing, evergreen coniferous tree of somewhat pyramidal habit with an umbrella-shaped top. Its beautiful foliage of glaucous blue-green, twisted needles, looks almost silvery blue in the cold months of winter. Equally striking is the bark, dark gray-brown on the lower trunk, and thin, flaky and bright copper-orange on the upper trunk and branches.", "url": "https://www.gardenia.net/plant/Pinus-sylvestris-Glauca", "img_src": "/rendition.grid_lg/uploads/plant/1534283411-9633080fd2b1aa110/botanikfoto-535426-LOptimized.jpg"}, {"name": "Primula auricula 'Baltic Amber' (Primrose)", "desc": "Primula auricula 'Baltic Amber' is an evergreen perennial forming a rosette of pale gray-green leaves, topped with sturdy stems bearing lightly fragrant, soft amber-orange, fully double flowers. Blooming profusely from mid to late spring, the lovely blooms look great at the front of borders or in containers.", "url": "https://www.gardenia.net/plant/Primula-auricula-Baltic-Amber", "img_src": "/rendition.grid_lg/uploads/plant/1541360146-016663012e53b63fd/Baltic%20Amber%20primula%20auriculaOptimized.jpg"}, {"name": "Primula vulgaris (Primrose)", "desc": "Harbinger of spring, Primula vulgaris (Primrose) is a compact, semi-evergreen perennial bearing masses of scented, pale yellow flowers, 1 in. across (2.5 cm), adorned with a deep yellow heart from late winter to mid spring. The luminous blossoms are borne above a rosette of oval, toothed, bright green leaves. Easy to grow, this wild primrose readily self-seeds, turning the ground into a carpet of stunning yellow.", "url": "https://www.gardenia.net/plant/Primula-vulgaris", "img_src": "/rendition.grid_lg/uploads/plant/1541423775-6b49a37b39c72ab92/botanikfoto-479054-LOptimized.jpg"}, {"name": "Pulmonaria longifolia 'Bertram Anderson' (Lungwort)", "desc": "Pulmonaria longifolia 'Bertram Anderson' (Lungwort) is a clump-forming, semi-evergreen perennial with profuse clusters of bright gentian blue flowers emerging from vibrant pink buds in late spring. Strong-growing, it forms a luminous foliage mound of long, narrow, deep green leaves that are dramatically spotted in silver, and remain attractive throughout the entire growing season if cut back after blooming. Evergreen in mild winter regions, this plant is outstanding for mass plantings and an excellent choice for shady gardens.", "url": "https://www.gardenia.net/plant/Pulmonaria-longifolia-Bertram-Anderson", "img_src": "/rendition.grid_lg/uploads/plant/1530820301-19fdc8beb0b4d4772/Pulmonaria%20longifolia%20'Bertram%20Anderson'Optimized.jpg"}, {"name": "Rhododendron mucronulatum 'Cornell Pink'", "desc": "Exceptionally cold hardy and decorative, Rhododendron mucronulatum 'Cornell Pink' is also prized for its very early spring blooms, when very little else is blooming.", "url": "https://www.gardenia.net/plant/Rhododendron-Mucronulatum-Cornell-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1446153339-43f66822cda7318e8/Rhododendron%20Cornell%20Pink2.jpg"}, {"name": "Rosa 'Fruhlingsgold' (Shrub Rose)", "desc": "Rosa 'Fruhlingsgold' is a vigorous, dense medium-sized shrub with masses of very fragrant, semi-double (9-16 petals), pale creamy-yellow flowers, 5 in. across (12 cm). Born in large clusters in late spring or early summer, they stand out against the gracefully arching thorny branches clothed in medium green leaves.", "url": "https://www.gardenia.net/plant/rose-Fruhlingsgold", "img_src": "/rendition.grid_lg/uploads/plant/1542313021-4736f8748fcee8663/botanikfoto-502413-LOptimized.jpg"}, {"name": "Rosa gallica var. officinalis (Old Red Damask Rose)", "desc": "Noted for its beauty and exceptional fragrance, Rosa gallica var. officinalis, commonly known as Old Red Damask or Red Rose of Lancaster, is a healthy and robust small shrub rose that can be relied on to provide interest and color.", "url": "https://www.gardenia.net/plant/Rosa-Gallica-var-Officinalis-Old-Red-Damask-Rose", "img_src": "/rendition.grid_lg/uploads/plant/1464703095-6ab6723eadf89f8af/10972.jpg"}, {"name": "Rudbeckia fulgida var. sullivantii 'Goldsturm' (Black-Eyed Susan)", "desc": "roven to be a workhorse in the garden, award-winning Rudbeckia fulgida var. sullivantii 'Goldsturm' is a highly popular choice. This perennial plant is long-lived and reliably produces masses of rich golden yellow, 3-4 in. flowers (7-10 cm) from midsummer through early fall, no matter what the weather is like.", "url": "https://www.gardenia.net/plant/rudbeckia-fulgida-var-sullivantii-goldsturm", "img_src": "/rendition.grid_lg/uploads/plant/1548593541-b0d8fb91adb096957/455753_mOptimized%20Optimized.jpg"}, {"name": "Salvia horminum 'Blue' (Annual Sage)", "desc": "Showing off its large, intense, dark blue bracts from summer to fall, Annual Sage 'Blue' (Salvia horminum or Salvia viridis) is among the most rewarding plants in the summer garden.", "url": "https://www.gardenia.net/plant/salvia-horminum-blue", "img_src": "/rendition.grid_lg/uploads/plant/1522848298-d69518d6e18654a53/2480544_sOptimized.jpg"}, {"name": "Sambucus nigra 'Black Lace' (Elderberry)", "desc": "Noted for its dramatic foliage, award-winning Sambucus nigra 'Black Lace' (Elderberry) is a large, upright, deciduous shrub adorned with a striking lacy foliage of deeply dissected, purple black leaves from spring to fall. In early summer, a profusion of lemon-scented umbels packed with creamy pink flowers are on display.", "url": "https://www.gardenia.net/plant/Sambucus-nigra-f-porphyrophylla-Eva", "img_src": "/rendition.grid_lg/uploads/plant/1542904752-0d7dc9934d0e4c3e6/Sambucus%20Black%20Lace%202_1080_1080_60Optimized.jpg"}, {"name": "Sedum 'Herbstfreude' ('Autumn Joy')", "desc": "Hard to miss in the garden! Vigorous, hardy, carefree, good-looking, with a season of interest lasting more than 6 months from early summer until well into winter, who could resist?", "url": "https://www.gardenia.net/plant/sedum-herbstfreude-autumn-joy", "img_src": "/rendition.grid_lg/uploads/plant/1429106041-9f0391e063a32a175/botanikfoto-500021-L.jpg"}, {"name": "Sempervivum 'Rocknoll Rosette' (Hens and Chicks)", "desc": "Sempervivum 'Rocknoll Rosette' (Hens & Chicks) is a mat-forming succulent perennial forming attractive, evergreen rosettes, 3.5 in. wide (8 cm), of fleshy, glowing wine-red leaves, flushed apple green at their base. This color varies by season, intensifying in cooler temperatures for a showy fall or winter display. In summer, a thick flowering stalk arises from the center of the hen rosette and bears showy starry, pink flowers.", "url": "https://www.gardenia.net/plant/Sempervivum-Rocknoll-Rosette", "img_src": "/rendition.grid_lg/uploads/plant/1525351990-b2530575ec4cc3e30/Sempervivum%20'Rocknoll%20Rosette'.jpg"}, {"name": "Spiraea japonica Magic Carpet 'Walbuma' (Japanese Spirea)", "desc": "Bursting out in color, Spiraea japonica Magic Carpet 'Walbuma' (Japanese Spirea) is a low-growing deciduous shrub with brilliant red leaves in spring, maturing to golden yellow as the summer progresses. The luminous foliage turns rich russet red in the fall. In late spring to early summer, flat sprays of small bright pink flowers grace the tips of its branches. Perfect for contrasting and brightening the landscape, this spirea cultivar is a wonderful choice for borders and containers. Its petite size makes is ideal for small gardens!", "url": "https://www.gardenia.net/plant/Spiraea-japonica-Magic-Carpet-Walbuma", "img_src": "/rendition.grid_lg/uploads/plant/1527003739-de8307517a40a03f9/40394985_sOptimized.jpg"}, {"name": "Syringa pubescens subsp. microphylla 'Superba' (Littleleaf Lilac)", "desc": "Award-winner Syringa pubescens subsp. microphylla 'Superba' (Littleleaf Lilac) is a bushy, spreading deciduous shrub adorned with loose panicles of fragrant, single, long-tubed, rosy-pink flowers. Blooming in late spring to early summer, this pretty lilac often repeats bloom in summer or early fall.", "url": "https://www.gardenia.net/plant/Syringa-pubescens-subsp-microphylla-Superba", "img_src": "/rendition.grid_lg/uploads/plant/1538855751-cfdfd4812ab35d80c/13585804_sOptimized.jpg"}, {"name": "Syringa x hyacinthiflora 'Asessippi' (Early Flowering Lilac)", "desc": "A profuse bloomer, Syringa x hyacinthiflora 'Asessippi' (Early Flowering Lilac) is an upright, deciduous shrub with showy panicles packed with very fragrant, single, deep lilac flowers. Blooming in mid spring, about 7-10 days earlier than common lilacs, it produces abundant blossoms uniformly over the entire plant, even on the lower branches.", "url": "https://www.gardenia.net/plant/Syringa-hyacinthiflora-Asessippi", "img_src": "/rendition.grid_lg/uploads/plant/1538850397-74086b5692b77c910/0780-1_SyrxhyacAsessippiLilaclavender.jpgOptimized.jpg"}, {"name": "Thuja occidentalis 'Danica' (American Arborvitae)", "desc": "Award-winning Thuja occidentalis 'Danica' (American Arborvitae) is a dwarf, evergreen shrub of dense, rounded habit with erect sprays of bright, emerald green foliage, tinged bronze in winter. Slow-growing, this cute conifer adds year-round interest in the landscape and is perfect for mixed borders and rock gardens. Its petite size makes it ideal for containers and small gardens too.", "url": "https://www.gardenia.net/plant/Thuja-occidentalis-Danica", "img_src": "/rendition.grid_lg/uploads/plant/1526908218-f4bacda943993c619/91652854_sOptimized.jpg"}, {"name": "Tropaeolum majus (Nasturtium)", "desc": "Vibrant and handsome, fast grower and easy going, Nasturtium (Tropaeolum majus), is a popular annual plant that will both command attention in any landscape and reward you with weeks of blooms, from early summer until frost.", "url": "https://www.gardenia.net/plant/tropaeolum-majus-nasturtium", "img_src": "/rendition.grid_lg/uploads/plant/1430828634-f7ac1a59eafa285e3/9209900027_87625cb19f_z.jpg"}, {"name": "Tulipa 'Artist' (Viridiflora Tulip)", "desc": "Standing out, award-winning Tulip 'Artist' is truly an unusual tulip with its amazing golden-orange flowers and soft green feathering. Sturdy and reliable", "url": "https://www.gardenia.net/plant/tulipa-artist-viridiflora-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506025432-209e01a623b07191c/35407%20Tulipa%20Artist.jpg"}, {"name": "Tulipa 'Blushing Lady' (Single Late Tulip)", "desc": "Amazingly beautiful! Tulip 'Blushing Lady' is incredibly pretty with large, glowing creamy lily-shaped blossoms with soft hints of orange and yellow and a delightful blushing pink flame.", "url": "https://www.gardenia.net/plant/tulipa-blushing-lady-single-late-tulip", "img_src": "/rendition.grid_lg/jardin/images/main_picture_53c64742d31ac.jpg"}, {"name": "Tulipa 'Davenport' (Fringed Tulip)", "desc": "Eye-catching! Tulip 'Davenport' is exceptionally beautiful with its brilliant crimson-red blossoms ending in delicate canary-yellow fringes.", "url": "https://www.gardenia.net/plant/tulipa-davenport-fringed-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506015409-54fef57c8ac758d2a/35746.jpg"}, {"name": "Tulipa 'Flaming Parrot' (Parrot Tulip)", "desc": "For a striking impact! Tulip 'Flaming Parrot' is a dazzling whimsically-shaped tulip which displays primrose yellow petals, crimson flamed and delicately fringed at the end.", "url": "https://www.gardenia.net/plant/tulipa-flaming-parrot-parrot-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505937478-d59f33be30d485016/203367.jpg"}, {"name": "Tulipa 'Happy Generation' (Triumph Tulip)", "desc": "Adds beauty and grace! A festive and spectacular Tulip! Tulip 'Happy Generation' brings splashes of color in the mid-late spring garden with its enormous and long lasting, ivory-white blossoms delicately flamed with deep ruby-red flames and hints of yellow", "url": "https://www.gardenia.net/plant/tulipa-happy-generation-triumph-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506097461-5e34af17ec6b9cb3b/20233004_m.jpg"}, {"name": "Tulipa 'Mariette' (Lily-Flowered Tulip)", "desc": "Elegance and color in the garden! Riding high on long willowy stems, Tulip 'Mariette' is a fascinating lily-flowered tulip with deep satin rose, slightly reflexed, pointed petals contrasting with their white base.", "url": "https://www.gardenia.net/plant/tulipa-mariette-lily-flowered-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505924106-6f1ac706744679d20/blb1799.jpg"}, {"name": "Tulipa 'Parade' (Darwin Hybrid Tulip)", "desc": "For eye-catching spring color, award-winning Tulip 'Parade' is terrific with its enormous scarlet flowers with delicate yellow edges and a black heart", "url": "https://www.gardenia.net/plant/tulipa-parade-darwin-hybrid-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506362878-8c89ddef628519fc0/Tulipa%20Parade2.jpg"}, {"name": "Tulipa 'Red Shine' (Lily-Flowered Tulip)", "desc": "Two-time award-winner, Tulip 'Red Shine' belongs to the remarkably graceful and elegant Lily-flowered Tulips group and exhibits long lasting, radiant, bright red goblet-shaped flowers with pointed, reflexed petals.", "url": "https://www.gardenia.net/plant/tulipa-red-shine-lily-flowered-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1505932241-61f935387fa585c7c/15602672_m.jpg"}, {"name": "Tulipa 'Toronto' (Greigii Tulip)", "desc": "A coral bouquet per stem!", "url": "https://www.gardenia.net/plant/tulipa-toronto-greigii-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506009792-e0b878fc9bcdc4077/25913.jpg"}, {"name": "Tulipa clusiana chrysantha 'Tubergen's Gem' (Botanical Tulip)", "desc": "Award-winning Tulip 'Tubergen's Gem' is incredibly beautiful with its striking color combination: rhodonite red with sulphur-yellow margins on the outside, canary yellow on the inside.", "url": "https://www.gardenia.net/plant/tulipa-clusiana-chrysantha-tubergens-gem-botanical-tulip", "img_src": "/rendition.grid_lg/uploads/plant/1506371224-4b49c73706651f4bc/207258Optimized.jpg"}, {"name": "Verbena 'Superbena Burgundy'", "desc": "Noted for its vigor, heat, drought and mildew tolerance, Verbena 'Superbena Burgundy' is a trailing Verbena with masses of large clusters of rich burgundy-red flowers over a long season. Blooming continuously from summer to frost, the blossoms are so profuse that they literally smother the foliage of oval, toothed, mint-like leaves, creating an endless floral carpet.", "url": "https://www.gardenia.net/plant/verbena-Superbena-Burgundy", "img_src": "/rendition.grid_lg/uploads/plant/1522943843-747cf38f38c628c62/superbena_burgundy_2Optimized.jpg"}, {"name": "Veronicastrum virginicum 'Album' (Culver's Root)", "desc": "Valued for its stately elegance! Culver's Root 'Album' (Veronicastrum virginicum) displays eye-catching spikes of densely-clustered, tiny, pure white flowers from midsummer to fall", "url": "https://www.gardenia.net/plant/veronicastrum-virginicum-album-culvers-root", "img_src": "/rendition.grid_lg/uploads/plant/1428430176-41e26532fdd8efed7/5364104058_87bc1e89a5.jpg"}, {"name": "Viburnum × burkwoodii 'Mohawk' (Burkwood Viburnum)", "desc": "Wonderfully fragrant, Viburnum × burkwoodii 'Mohawk' (Burkwood Viburnum) is a compact, upright, multi-stemmed, semi-evergreen shrub with ovate, glossy, dark green leaves that turn attractive shades of orange and red in fall, except where evergreen (USDA Zones 7 and 8). In mid spring, red flower buds open to very fragrant white flowers, arranged in snowball clusters. Lasting up to 2 weeks, they give way to pendulous clusters of red berries which ripen black in mid to late summer.", "url": "https://www.gardenia.net/plant/Viburnum-×-burkwoodii-Mohawk", "img_src": "/rendition.grid_lg/uploads/plant/1531418504-ee3ba76ae64788bb0/103306487_sOptimized.jpg"}, {"name": "Weigela florida 'Sonic Bloom Pure Pink'", "desc": "Weigela florida 'Sonic Bloom Pure Pink' is a striking deciduous shrub noted for its long blooming season. From spring until the first frost, large, showy, clear pink flowers are produced in great quantities and literally cover the foliage of narrowly ovate, bright green leaves. The trumpet-like flowers are adored by hummingbirds. Deadheading is not necessary for rebloom. Easy to grow, this flowering shrub is the perfect choice for a flowering hedge or a backdrop to any sunny garden.", "url": "https://www.gardenia.net/plant/Weigela-florida-Sonic-Bloom-Pure-Pink", "img_src": "/rendition.grid_lg/uploads/plant/1532029517-3c686070fb06c780c/sonic_bloom_pure_pink_weigela_2Optimized.jpg"}, {"name": "Zinnia elegans 'Orange King'", "desc": "Tall, Zinnia elegans 'Orange King' boasts huge, full double flowers, 5-6 in. across (12-15 cm), packed with brilliant mandarin-orange petals. Resembling pom-pom dahlias, they are borne on very long, sturdy stems and make a big statement in the landscape.", "url": "https://www.gardenia.net/plant/zinnia-elegans-Orange-King", "img_src": "/rendition.grid_lg/uploads/plant/1552938515-be9402b9b480e563f/shutterstock_1147021859Optimized.jpg"}]